// Room:/d/welcome/regroom.c
// Updated by Lonely (08/11/2002)

#include <ansi.h>
inherit ROOM;
int do_register(string arg);
#define SMTP_D     "/adm/daemons/smtp_d"

void create()
{
        set("short", "×¢²á·¿¼ä");
        set("long", @LONG
Îª±£ÕÏÃ¿Ò»Î»Íæ¼ÒµÄÈ¨Òæ£¬±¾ÓÎÏ·ÊµÐÐÐÂÍæ¼Òµç×ÓÓÊ¼þ×¢²áÖÆ¶È£¬Õâ
Àï¾ÍÊÇÐÂÍæ¼Ò½øÐÐ×¢²áµÄµØ·½£¬ÔÚÕâÀïÇëÄúÊ¹ÓÃÃüÁî [1;36mregister[0m ¼ÓÉÏÄãµÄ
µç×ÓÓÊ¼þµØÖ·½øÐÐ×¢²á¡£
    ÀýÈç£º±ÈÈçÄãÕæÊµµÄµç×ÓÓÊ¼þµØÖ·Îª [1;33mplayer@me.com[0m£¬ÄÇÃ´Ö»ÒªÄãÊä
Èë£º [1;36mregister player@me.com[0m ¼´¿ÉÕýÈ·×¢²á¡£
    ÎÒÃÇÊµÐÐµç×ÓÓÊ¼þ×¢²áµÄÄ¿µÄÊÇÎªÁËÔÚÄã¶ªÊ§»òÕßÍü¼ÇÃÜÂëµÄÇé¿öÏÂ£¬
ÎÒÃÇÍ¨¹ý½«ÃÜÂë·¢µ½ÄãµÄÐÅÏäÀ´È·ÈÏÄãµÄÉí·ÝºÍ¹é»¹ÄãµÄÃÜÂë¡£Èç¹ûÄúÏÖ
ÔÚ»¹Ã»ÓÐµç×ÓÓÊ¼þµØÖ·£¬¿ÉÒÔÏÖÔÚÍË³ö£¨[1;33mquit[0m£©È¥Ãâ·Ñµç×ÓÓÊ¼þÌá¹©ÉÌ´¦
ÉêÇëÓÐÐ§µÄµç×ÓÓÊ¼þµØÖ·£¬Õâ¸öÕËºÅÎÒÃÇ»áÎªÄú±£Áô [1;32m48[0m Ð¡Ê±£¬¹ýºóÈç»¹
Î´¼ÌÐø×¢²á£¬´ËÁÙÊ±ÕËºÅ»á±»[1;31mÉ¾³ý[0m¡£  
¡¡¡¡ÔÚ´óÌüµÄÅÔ±ßÌù×ÅÒ»ÕÅ¸æÊ¾£¨[1;33msign[0m£©£¬Ã¿¸öÐÂÀ´µÄÍæ¼Ò¶¼±ØÐë¿´Ò»¿´
µÄ£¨ÊäÈë£º[1;32mlook sign[2;37;0m ¿´¸æÊ¾)¡£
LONG
);

        set("item_desc", ([
        "sign":
"\t     [1;33mÓÐ¹Øµç×ÓÓÊ¼þ×¢²áµÄ¼¸µãËµÃ÷[0m
[37m£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­[0m
Ê×ÏÈÇëÄã×ÐÏ¸¼ì²é×¢²áÃüÁîÀïÊäÈëµÄµç×ÓÓÊ¼þµØÖ·ÊÇ·ñÕýÈ·£¡

Õâ¸öÓÎÏ·µÄ×¢²á¹ý³ÌÊÇÓÉ»úÆ÷×Ô¶¯Íê³ÉµÄ£¬ÔÚÄã»¹Ã»ÓÐÀë¿ª
ÓÎÏ·µÄÊ±ºò×¢²áÐÅ¾ÍÒÑ¾­·¢³öÁË¡£Èç¹û×¢²áÐÅÎ´ÄÜÕýÈ··¢³ö
»áÌáÊ¾Äã´ÓÐÂÊäÈë×¢²áÃüÁî£¬Ö»ÓÐÕýÈ··¢³öÒÔºó²Å»á½«×¢²á
Íæ¼Ò¶ÏÏß¡£
ÄãÊÕµ½µÄÊ±¼äÊÇÓÐÄãµÄÓÊ¼þ·þÎñÌá¹©Õß¾ö¶¨µÄ£¬Èç¹ûËûÃÇ×ª
ÐÅµÄÊ±¼ä¿ì£¬Õý³£Çé¿öÏÂÄãÓ¦µ±ÔÚ[1;33m10[0mÃëÖÓÖ®ÄÚÊÕµ½¡£Ò²¾ÍÊÇ
Äã¹ØÉÏ zMud´°¿Ú´ò¿ªÓÊ¼þ³ÌÐò£¬¾ÍÓ¦µ±ÄÜÊÕµ½ÁË¡£×î³Ù[1;33m1-2[0m
¸öÐ¡Ê±Ò²Ó¦µ±ÊÕµ½¡£
ÎÒÃÇµÄÓÎÏ·¸øÍæ¼ÒÁôÁË [1;36m48[0m ¸öÐ¡Ê±µÄÊÕÐÅÊ±¼äÓ¦µ±ÊÇºÜ³ä·Ö
µÄ¡£Èç¹ûÔÚÕâ¶ÎÊ±¼äÄÚ»¹Î´ÄÜÊÕµ½ÎÒÃÇ·¢¸øÄãµÄÐÅ£¬½¨ÒéÄã
»»Ò»¸ö×ªÐÅ¿ìµÄÓÊ¼þ·þÎñÌá¹©ÕßÔÙ´ÎÉêÇë£¬»òÕßÏòÄãµÄÓÊ¼þ
·þÎñÌá¹©Õß½øÐÐ×ÉÑ¯¡£

¸ÐÐ»Äã¶ÔÕâ¸öÓÎÏ·µÄ¹Ø×¢¡£  (×¢£ºÓÊ¼þ×¢²áÖÆ¶ÈÔÝ»ºÊµÐÐ)
[37m£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­£­[0m
                               \t\t[1;36m" + MUD_NAME + "Î×Ê¦×é[0m\n"
        ]));


        set("no_fight", 1);
        set("no_magic", 1);
        set("no_steal", 1);
        set("no_beg", 1);   
        // set("valid_startroom", 1); 
     
        setup();
}

void init()
{
        add_action("do_register", "register");
        add_action("do_register", "zhuce");
}

int do_register(string arg)
{
        object me = this_player();
        string mail;
        string msg;
        
        if (me->query("registered"))
        {
                tell_object(me, sprintf(HIR"Äã²»ÊÇÒÑ¾­×¢²á¹ýÁËÂð£¿²»ÓÃÔÙ×¢²áÁË¡£\n"NOR));
                return 1;
        }

        if (! arg|| strsrch(arg, "@") == -1 
        || sscanf(arg, "%*s@%*s.%*s") != 3 
        || strsrch(arg, ",") != -1)
                return notify_fail("µç×ÓÓÊ¼þµØÖ·±ØÐëÊÇ "
                                   "player@me.com ¸ñÊ½¡£\n");
        else
        {
                mail = arg;
                me->set("email", mail);

                msg = me->query("name") + "£¨" + me->query("id") + "£©£º\n\n";

                msg += "    »¶Ó­½øÈëÄàÌ¶µÄÊÀ½ç£¬´ÓÕâÒ»¿ÌÆðÄú½«ÓÐ»ú»áÌåÑéµ½ÆäËûMUD ÎÞ\n" +
                       "·¨´ø¸øÄúµÄ¿ìÀÖ¡£\n";
                msg += "    Èç¹ûÄúÊÇÒ»¸öÏ²»¶ÁÄÌìµÄÈË£¬ÕâÀïÓÐ¸ü¶à£¬¸üÓÐÈ¤£¬Ò²¸üÈ«ÃæµÄ\n" +
                       "emote ¿ÉÒÔÈÃÄú¾¡ÇéÏíÀÖ£¬æÒÐ¦Å­Âî£¬ÍêÈ«²»±Ø¸ºÔðÈÎ¡£\n";
                msg += "    Èç¹ûÄúÊÇÒ»¸öÏ²»¶Á·¹¦µÄÈË£¬ÕâÀïµÄÃÅÅÉÖ®¼ä½«´ïµ½×î´óÏÞ¶ÈµÄ\n" +
                       "Æ½ºâ£¬¶àÑùµÄÈÎÎñÏµÍ³¿ÉÒÔÈÃÄú±È½ÏË³ÀûµÄ³É¾ÍÒ»´ú×ÚÊ¦¡£\n";
                msg += "    Èç¹ûºÜ²»ÇÉµÄÄúÊÇÒ»¸öÀûÓûÑ¬ÐÄµÄÈË£¬ÕâÀïµÄ¹ÙÖ°ÏµÍ³Ò»¶¨¿ÉÒÔ\n" +
                       "Âú×ãÄúµ£µ±±øÂí´ó½«¾üµÄÓûÍû¡£\n";
                msg += "    Èç¹ûÄúÊÇÒ»¸ö¿ÊÍûÉú»îµÄÈË£¬Äú¿ÉÒÔÔÚÕâÀïÈ¢ÆÞÉú×Ó£¬Âò·¿µöÓã\n" +
                       "ÎªÀÖ£¬ÏíÊÜÄÇÒ»·ÝÊÀÍâ¸ßÈËµÄÌñ¾²Óëµ­ÑÅ¡£\n";
                msg += "    Èç¹ûÄú¶ÔMUD ÓÎÏ·¸Ðµ½ºÜÄ°Éú£¬ÎÒÃÇµÄÄàÌ¶ÖÐÓÐÍêÉÆµÄÐÂÊÖÖ¸Òý\n" +
                       "ÏµÍ³£¬²¢ÉèÓÐ×¨ÃÅµÄÐÂÈËµ¼Ê¦¶Ô¸÷Î»ÐÂÍæ¼Ò½øÐÐÖ¸µ¼¡£\n";
                msg += "    Í¬Ê±£¬ÕâÀïÑÏ¸ñ¹á³¹¡°¹«Æ½£¬¹«Õý£¬¹«¿ª¡±Áù×ÖÕæÑÔ£¬Å¬Á¦Îª¸÷\n" +
                       "Î»Íæ¼Ò´òÔìÒ»Æ¬´¿¾»µÄÓÎÏ·Ìì¿Õ¡£\n";
                msg += "    ¸ü¶àµÄÓÎÏ·ÌØÉ«Äú¿ÉÒÔ·ÃÎÊÎÒÃÇµÄÍøÕ¾www.chinesemud.org£¬»ò\n" +
                       "ÕßÖ±½Ó½øÈëÓÎÏ·ÄÚ²¿ÓÃhelpÃüÁî½øÐÐ²éÑ¯¡£Èç¹ûÄú¶ÔÎÒÃÇµÄÓÎÏ·ÓÐÈÎ\n" +
                       "ºÎÒâ¼û£¬Äú¿ÉÒÔÔÚÓÎÏ·ÄÚ²¿µÄÁôÑÔ°åÉÏÁôÑÔ£¬»òÕßÖ±½ÓµÇÂ½ÎÒÃÇµÄÂÛ\n" +
                       "Ì³bbs.chinesemud.org¡£\n";
                msg += "    ÔÙ´ÎÖÔÐÄ¸ÐÐ»Äú²ÎÓëÎÒÃÇµÄÓÎÏ·£¬ÔÚ´ËÄàÌ¶µÄÎ×Ê¦ÃÇ½«ÒÔ×î´óµÄ\n" +
                       "ÈÈÇé»Ø±¨Äú¶ÔÎÒÃÇµÄÖ§³Ö¡£\n";
                msg += "    Ð»Ð»£¡\n\n";

                msg += "¡¡¡¡        ¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡                ÄàÌ¶Î×Ê¦¹¤×÷Èº\n";

                /*
                if (! MAIL_D->queue_mail(me, "nitan@chinesemud.org",
                        me->query("email"), "¸ÐÐ»Äú¹âÁÙÄàÌ¶ÍøÂçÓÎÏ·", msg))
                {
                        tell_object(me, query_fail_msg());
                        tell_object(me, "·¢ËÍ×¢²áÓÊ¼þÊ§°Ü£¬Çë×¢²áÄãÕýÈ·µÄÓÊ¼þµØÖ·£¡\n");
                        return 1;
                }
                */
                
                me->set("registered", 1);
                /*
                tell_object(me, "\nÓÐÒ»·âÓÊ¼þÒÑ¸ù¾ÝÄúµÇ¼ÇµÄµØÖ··¢Íù\n\n" +
                                "    " + HIW + me->query("email") + NOR + "\n\nÇëÄú" 
                                HIG "¶þ·ÖÖÓ" NOR "ºó¼ì²éÄúµÄµç×ÓÓÊ¼þÐÅÏä¡£\n");
                */
                tell_object(me, HIR "\n×£ÄúÔÚÄàÌ¶ÍæµÄÓä¿ì£¡:)\n\n" NOR);
                // SMTP_D->send_mail(me,mail);
                me->move("/d/register/entry");  
                
                return 1;
        }
}
