  inherit ITEM;


void create()
{

    set_name("京城地图", ({ "map"}));
	set_weight(100);
	set("unit", "张");
	set("long", "                   京城地图 \n"     
   "                                〖京城〗\n"


"[=]--------[=]--------[=]-------[皇  宫]-------[=]--------[=]--------[=]\n"
" |    　  景　    　　　　　　　　｜｜　　　　　　　　                | \n"
" |  城隍庙教－青龙－民宅　三花堂　｜｜ 丞相府 武馆    白虎－民宅      | \n"
" |    ｜｜寺　｜｜　　　　　｜｜　｜｜  ｜｜　｜｜　　｜｜            | \n"
" |    玄武－－十字－玄武－－玄武－十字－玄武－玄武－－丁字            | \n"
" |    　　　　｜｜　　　　　　　　｜｜　｜｜　｜｜　　｜｜            | \n"
"[=]     贾家－青龙　　　　　　　　｜｜ 铁匠铺 将军府  ｜｜           [=] \n"
" |      包子  ｜｜　　　　　　　　北门－药店　　　　　白虎－龙王庙    |  \n"
" |            ｜｜                ｜｜                ｜｜　　　　　  |  \n"
" |      草堂－青龙－民宅    布庄－北门                白虎            |  \n"
" |    紫阳楼　｜｜　长安府　书店　｜｜　驿站　镖局　　｜｜　 东大营   |  \n"
"=== 　｜｜　　｜｜　　｜｜　｜｜　｜｜　｜｜　｜｜　　｜｜　　｜｜   === \n"
"阜成－西门－十字路口－西门－西门－钟楼－东门－东门－十字路口－东门－朝阳 \n"
"===           ｜｜　　｜｜　｜｜　｜｜　｜｜　    　　｜｜           === \n"
" |    化生寺　青龙　总管府　银庄　｜｜　兵器铺　　　　白虎－肉铺      |  \n"
" |    　　　　｜｜　　　　当铺－－南门－南城客栈　　　｜｜            |  \n"
" |    　　　　｜｜　　　　　　　　｜｜　　　　　　　　｜｜            |  \n"
" |    　民宅－青龙－吉祥  国宾馆－南门－国子监　　　　白虎－小酒馆    |  \n"
"[=]         　｜｜　杂货　　布庄　｜｜　　　　　　　　｜｜　粮店     [=]  \n"
 "|          　｜｜　　　　　｜｜　｜｜　　　　　　　　｜｜　｜｜      |   \n"
 "|    朱雀－－十字－朱雀－－朱雀－十字－朱雀－朱雀－－十字－朱雀      |   \n"
 "|    ｜｜　  ｜｜　｜｜　　　　　｜｜　　　　｜｜　　｜｜            |   \n"
 "|  　民宅　　青龙　清虚观　　　　｜｜　　　木器铺    白虎－长安乐坊  |   \n"
 "|  　　　　　    　　　　　　　　｜｜　　　　　　　　                |   \n"
"[=]--------[=]--------[=]--------[南门]--------[=]--------[=]--------[=]  \n"


"	(注：细微之处及暗道恕不标出！)                                    \n"
"	(注：以以后编写中的为准。欢迎大家多提意见，放到客店的留言板上。)   \n");
	set("value", 10000);
	set("material", "paper");
}
