
#include <ansi.h>

inherit ROOM;


void create ()
{
  set ("short","草地");
  set ("long", @LONG
世人皆知，泰山雄，华山险，黄山奇，庐山秀；然而，神雾山集雄
、险、奇、秀于一体，浑然天成。置身山中，移步换景，举目成趣：雾
神、石怪、树奇、洞幽、竹秀，堪称四绝。沿途美景、奇境数不胜数；
“仙女潭、夫妻岩、小乔亭”风姿绰约；“瓜蒂结庐、吴王寨、吴王殿”令
人神往；“通天巷（一线天），阴阳合壁（绝妙之门），阳举峰、吴王
碑”神秘莫测；“白龙潭、十八潭、将军瀑”动魄惊心；“山猫捕鼠、乌龟
台，象鼻石、螺王石、将军石、鳌鱼头”栩栩如生；“佛祖岩”超凡脱俗
。群山里猿啼鸟语，山谷间飞瀑流泉。
LONG);

  set("exits", ([ 

  "northeast":__DIR__"shalu1",
  "west":__DIR__"caodi1",
  
         ]));

  set("valid_startroom", 1);
  set("outdoors","jiujiang");
  setup();
 
}

