
#include <ansi.h>
inherit ROOM;


void create ()
{
  set ("short","五老峰");
  set ("long", @LONG
五老峰在距万松坪一公里的地方.五峰耸立,雄伟陡峻,海拔1436米.从山麓明
代所建的海会寺仰视群峰，似五个老人并坐，故名。从各个角度去观察，山姿不
一，有的象诗人吟咏，有的象武士高歌，有的象渔翁垂钓，有的象老僧盘坐。其
中第三峰最险，峰顶有“日近云低”、“俯视大千”等石刻。第四峰最高，峰顶云松
弯曲如虬。下有五小峰，即狮子峰、金印峰、石舰峰、凌云峰和旗竿峰，往下为
观音崖，狮子崖，背后山谷有青莲寺。李白诗云“庐山东南五老峰，青天削出金
芙蓉。”这从这里往北走，就可以到九江，往西南走，可以到巴陵。
LONG);

  set("exits", ([ 
 "north":__DIR__"tulu1",
 "southwest":__DIR__"shanlu1",
         ]));
  set("outdoors","jiujiang"); 
  set("valid_startroom", 1);
  setup();
 
}

