// yaocao.c 药草
// 星星lywin 2000/6/15

#include <ansi.h>
inherit ITEM;
string *order = ({""HIY"", ""HIG"", ""RED"", ""MAG"", ""YEL"", ""HIC"", ""HIW"", ""HIR"",""HIB"", ""CYN"",""WHT"",""HIM"",""BLU""});
string *yaocaoname = ({
"丁香","八角茴香","刀豆","小茴香","小蓟","山药","山楂","马齿苋","乌梢蛇","乌梅","木瓜","火麻仁",
"代代花","玉竹","甘草","白芷","白果","白扁豆","白扁豆花","龙眼肉",
"决明子","百合","肉豆蔻","肉桂","余甘子","佛手","杏仁","沙棘","牡蛎","芡实","花椒","赤小豆","阿胶",
	"鸡内金","麦芽","昆布","大枣","酸枣","黑枣","罗汉果",
"郁李仁","金银花","青果","鱼腥草","生姜","干姜","枳子","枸杞子","栀子","砂仁","胖大海",
	"茯苓","香橼","香薷","桃仁","桑叶","桑椹","桔红","桔梗","益智仁",
"荷叶","莱菔子","莲子","高良姜","淡竹叶","淡豆豉","菊花","菊苣","黄芥子",
	"黄精","紫苏","紫苏籽","葛根","黑芝麻","黑胡椒","槐米","槐花","蒲公英","蜂蜜","榧子",
"酸枣仁","鲜白茅根","鲜芦根","蝮蛇","橘皮","薄荷","薏苡仁","薤白","覆盆子","藿香",
	"人参","人参叶","人参果","三七","土茯苓","大蓟","女贞子",
"山茱萸","川牛膝","川贝母","川芎","马鹿胎","马鹿茸","马鹿骨","丹参","五加皮","五味子","升麻",
	"天门冬","天麻","太子参","巴戟天","木香",
"木贼","牛蒡子","牛蒡根","车前子","车前草","北沙参","平贝母","玄参","生地黄","生何首乌","白及","白术","白芍",
"白豆蔻","石决明","石斛","地骨皮","当归","竹茹","红花","红景天","西洋参","茱萸","怀牛膝",
"杜仲","杜仲叶","沙苑子","牡丹皮","芦荟","苍术","补骨脂","诃子","赤芍","远志","麦门冬","龟甲",
"佩兰","侧柏叶","制何首乌","刺五加","刺玫果","泽兰","泽泻","玫瑰花","玫瑰茄","知母","罗布麻","苦丁茶","金荞麦",
	"金樱子","青皮","厚朴",
"厚朴花","姜黄","枳壳","枳实","柏子仁","珍珠","绞股蓝","胡芦巴","茜草","荜茇","韭菜子","首乌藤",
	"香附","骨碎补","党参","桑白皮","桑枝",
"浙贝母","益母草","积雪草","淫羊藿","菟丝子","野菊花","银杏叶","黄芪","湖北贝母",
	"越橘","槐实","蜂胶","酸角","墨旱莲","熟地黄","鳖甲"
});
void create()
{
string file;
string *roomlines;
string location;
//file = read_file("/clone/medicine/yaocainame");
//roomlines = explode(file,"\n");
location = yaocaoname[random(sizeof(yaocaoname))];
        //set_name(HIG "珍贵药草" NOR,({"yao cao", "yao"}));
set_name(order[random(13)]+"珍贵的"+location+NOR,({"yao cao", "yao"}));
        if ( clonep() )
                set_default_object(__FILE__);
        else {
                set("unit", "株");
		set("no_drop","不要乱丢，这东西打到人痛！\n");
		set("no_put",1);
		set("yaocao",1);
		set("lev",2);
                set("long", "这是一株生长在密林中的无名草药，一般人都会误认成杂草。\n");
             }
        setup();
}



void init()
{
	add_action("do_eat", "eat");
	add_action("do_eat", "fu");
}

int do_eat(string arg)
{
	object me = this_player();

	if(!id(arg)) return notify_fail("你要吃什么？\n");
	if(!present(this_object(), me))
		return notify_fail("你要吃什么？\n");
	if( me->is_busy() )
		return notify_fail("别急，慢慢吃，小心别噎着了。\n");
	me->add("food",20);
	me->add("water",20);
	write("你三口两口把"+this_object()->query("name")+"吃了下去。\n");
	destruct(this_object());
	return 1;
}
