【侠客行关外地图】
                　　　　　　　　　   ＾　　　
                                     ｜
                                     ＾



                                                      白
大                                                    云
门                                      鸡            峰
坎＼二                              铁  冠  鹿      ／  ＼
子  门  满                          壁—  —鸣＼玉／  天  ＼龙
    坎—天  谷  白  密  黑  夹      崖  砬  峰  柱          门
        星＼草—  —  —风—心      ｜  子      峰＼  池  ／峰
            垛  河  林  口  子      长              ＼  ／
                            ｜      白                梯
                            二      瀑                云
                            龙＼半／布                 峰
                            斗  拉
                                瓢


                              山神庙
                              ／
                           荒路        船厂—冰面—大门坎子
                          ／            ｜
           小巷—北城  荒路      雪地—雪地
           ／     ｜    ｜      ／
       小土屋    集市—东城—雪地
                  ｜    ｜
         香肉馆—南城 土窑馆
                  ｜
                 木桥
                  ｜
                 大道
                  ｜
                 大道
                ／
             大道
              ｜
             宁远
            ／
         官道
        ／
     官道
    ／
山海关
    ＼
    老龙头



