// Room: /d/dali/dongdajie1.c
// Data: ¹şµÏË¹(hades)
// Time: ¹«Ôª£º1999Äê4ÔÂ21ÈÕ£¬±±¾©Ê±¼ä£º17Ê±31·Ö11Ãë¡£

inherit ROOM;

void create()
{
	set("short", "¶«´ó½Ö");
	set("long", @LONG
ÕâÀïµÄ½ÖµÀ¿í³¨¶ø¸É¾»£¬ºº°×ÓñÆöµÄÂ·Ãæ±»ÓêË®³åµÃ¹âÃ÷Èç¾µ£¬µ«½Ö
µÀÁ½²àµÄµêÆÌÈºÁ¢¶øÓÖ²Î²î²»Æë£¬¹ıÍùµÄÈËÀ´È¥´Ò´Ò£¬Ö»Ìıµ½Ê÷ÉÏµÄĞ¡Äñ
Ê±¶ø²»Ê±µÄà±Ãù¼¸Éù£¬ÕâÀïµ½´¦¶¼É¢·¢×Å°²ÏéÄş¾²µÄÆø·Õ¡£Íù¶«Í¨Ïò´óÀí
³Ç¶«ÃÅ£¬ÍùÎ÷¾Íµ½ÁË´óÀí³ÇµÄÖĞĞÄ¡£Â·µÄÁ½ÅÔÖÖÂúÁËÕäÆæµÄ»¨²İ¡£Í¸¹ıÒ»
ÖêÖê¿ªµÄÕıÑŞµÄ²è»¨ÏòÁ½ÅÔ¿´È¥£¬Äã»á·¢ÏÖÂ·µÄÄÏÃæÓĞÒ»¼Ò[1;32mÒ©ÆÌ[2;37;0m£¬Â·µÄ±±
ÃæÊÇ[1;32m³¯ÑôÂ·[2;37;0m¡£
LONG
	);
	set("outdoors", "dali");
	set("exits", ([ /* sizeof() == 4 */
  "north" : __DIR__"dbdajie1",
  "west" : __DIR__"guangchang",
  "east" : __DIR__"dongdajie2",
  "south" : __DIR__"yaopu",
]));

	set("objects", ([ /* sizeof() == 2 */
        __DIR__"npc/girl" : 1,
        __DIR__"npc/girl1" : 1,
]));

	setup();
}
