// Room: /d/dali/dongdajie2.c
// Data: ¹şµÏË¹(hades)
// Time: ¹«Ôª£º1999Äê4ÔÂ19ÈÕ£¬±±¾©Ê±¼ä£º23Ê±11·Ö27Ãë¡£

inherit ROOM;

void create()
{
	set("short", "¶«´ó½Ö");
	set("long", @LONG
ÕâÀïµÄ½ÖµÀ¿í³¨¶ø¸É¾»£¬ºº°×ÓñÆöµÄÂ·Ãæ±»ÓêË®³åµÃ¹âÃ÷Èç¾µ£¬µ«½Ö
µÀÁ½²àµÄµêÆÌÈºÁ¢¶øÓÖ²Î²î²»Æë£¬¹ıÍùµÄÈËÀ´È¥´Ò´Ò£¬Ö»Ìıµ½Ê÷ÉÏµÄĞ¡Äñ
Ê±¶ø²»Ê±µÄà±Ãù¼¸Éù£¬ÕâÀïµ½´¦¶¼É¢·¢×Å°²ÏéÄş¾²µÄÆø·Õ¡£Íù¶«Í¨Ïò´óÀí
³Ç¶«ÃÅ£¬ÍùÎ÷¾Íµ½ÁË´óÀí³ÇµÄÖĞĞÄ¡£Â·µÄÁ½ÅÔÖÖÂúÁËÕäÆæµÄ»¨²İ¡£Í¸¹ıÒ»
ÖêÖê¿ªµÄÕıÑŞµÄ²è»¨ÏòÁ½ÅÔ¿´È¥£¬Äã»á·¢ÏÖÂ·µÄ±±ÃæÓĞÒ»¼Ò[1;32m²¼µê[2;37;0m£¬Â·µÄÄÏ
ÃæÓĞÒ»¼Ò[1;32mÔÓ»õµê[2;37;0m¡£
LONG
	);
	set("outdoors", "dali");
	set("exits", ([ /* sizeof() == 4 */
  "north" : __DIR__"fangjudian",
  "west" : __DIR__"dongdajie1",
  "east" : __DIR__"dongdajie3",
  "south" : __DIR__"zhahuodian",
]));

	setup();
}
