// Room: /d/dali/guangchang.c
// Data: ¹þµÏË¹(hades)
// Time: ¹«Ôª£º1999Äê4ÔÂ19ÈÕ£¬±±¾©Ê±¼ä£º21Ê±28·Ö14Ãë¡£

inherit ROOM;

void create()
{
	set("short", "´óÀí³ÇÖÐÐÄ");
	set("long", @LONG
ÕâÀï¾ÍÊÇ´óÀí³ÇµÄ³ÇÖÐÐÄ£¬´óÀí³ÇµÄÖ÷Òª½ÖµÀ¶¼ÔÚÕâÀï½»»á£¬¿í¹ãµÄÂ·ÃæÔÚÕâÀï
ÐÎ³ÉÁËÒ»¸ö·½Ô°Ô¼Ê®ÓàÕÉµÄ¹ã³¡¡£¹ã³¡³ÊÁâÐÎ£¬Ò»È¦Î§µÄ¶¼ÊÇÐ¡··£¬ÒÕÈË£¬ºÍ¿´ÈÈÄÖ
µÄ¡£ÎõÎõÈÁÈÁµÄÈËÈºÖÐÒ²ÉÙ²»ÁËÐ©¸öÅÜ½­ºþµÄ£¬ÔÓË£Éù£¬½ÐÂôÉù´ËÆð±Ë·ü¡£Ò»Ð©ÔÚÖÐ
Ô­ÎÅËùÎ´ÎÅµÄÐÂÏÊÊÂÎïÁîÒ»Ð©³õÈë½­ºþµÄÄêÇáÈËÐË·Ü²»ÒÑ¡£Î»ÓÚ¹ã³¡ÖÐÐÄÓÐÒ»¸ö²»´ó
²»Ð¡µÄË®³Ø£¬Ò»¾Þ´óµÄÄÖÁúÊ¯ÖùËÊÁ¢Ë®³ØÖÐÑë£¬Ò»ãéãéµÄ¸ÊÈªË®´ÓÊ¯ÖùµÄÁú×ìÖÐÓ¿³ö£¬
·ÅÑÛÏòÊ¯ÖùÉÏ¿´È¥£¬Ö»¼ûÉÏÊé£º

                          [1;33m~   Ìì  ´ó  ~[2;37;0m

                          [1;33m~   ÏÂ  Àí  ~[2;37;0m

                          [1;33m~   Ì«  ÖÐ  ~[2;37;0m

                          [1;33m~   Æ½  ÐË  ~[2;37;0m

LONG
	);
	set("resource", ([ /* sizeof() == 1 */
  "water" : 1,
]));
	set("outdoors", "dali");
	set("exits", ([ /* sizeof() == 4 */
  "north" : __DIR__"paifang",
  "west" : __DIR__"xidajie1",
  "east" : __DIR__"dongdajie1",
  "south" : __DIR__"nandajie1",
]));

        set("objects", ([
                __DIR__"npc/dlxunbu" : 2,
                __DIR__"npc/liumangtou" : 1,
                __DIR__"npc/liumang" : 2,
        ]));
	setup();
        "/d/board/dali_b"->foo();
}
