// Room: /d/dali/nandajie1.c
// Data: ¹şµÏË¹(hades)
// Time: ¹«Ôª£º1999Äê4ÔÂ19ÈÕ£¬±±¾©Ê±¼ä£º21Ê±32·Ö59Ãë¡£

inherit ROOM;

void create()
{
	set("short", "ÄÏ´ó½Ö");
	set("long", @LONG
ÕâÀïµÄ½ÖµÀ¿í³¨¶ø¸É¾»£¬ºº°×ÓñÆöµÄÂ·Ãæ±»ÓêË®³åµÃ¹âÃ÷Èç¾µ£¬µ«½Ö
µÀÁ½²àµÄµêÆÌÈºÁ¢¶øÓÖ²Î²î²»Æë£¬¹ıÍùµÄÈËÀ´È¥´Ò´Ò£¬Ö»Ìıµ½Ê÷ÉÏµÄĞ¡Äñ
Ê±¶ø²»Ê±µÄà±Ãù¼¸Éù£¬ÕâÀïµ½´¦¶¼É¢·¢×Å°²ÏéÄş¾²µÄÆø·Õ¡£ÍùÄÏÍ¨Ïò´óÀí
³ÇÄÏÃÅ£¬Íù±±¾Íµ½ÁË´óÀí³ÇµÄÖĞĞÄ¡£Â·µÄÁ½ÅÔÖÖÂúÁËÕäÆæµÄ»¨²İ¡£Í¸¹ıÒ»
ÖêÖê¿ªµÄÕıÑŞµÄ²è»¨ÏòÁ½ÅÔ¿´È¥£¬Äã»á·¢ÏÖÂ·µÄÎ÷ÃæÓĞÒ»¼Ò[1;32m¶Ä³¡[2;37;0m£¬Â·µÄ¶«
ÃæÓĞÒ»¼Ò[1;32mµ±ÆÌ[2;37;0m¡£
LONG
	);
	set("outdoors", "dali");
	set("exits", ([ /* sizeof() == 4 */
  "north" : __DIR__"guangchang",
  "west" : __DIR__"duchang1",
  "east" : __DIR__"dangpu",
  "south" : __DIR__"nandajie2",
]));

	setup();
}
