// Room: /d/dali/nandajie2.c
// Data: ĞÄ(ami)
// Time: ¹«Ôª£º1999Äê4ÔÂ19ÈÕ£¬±±¾©Ê±¼ä£º20Ê±54·Ö6Ãë¡£

inherit ROOM;

void create()
{
	set("short", "ÄÏ´ó½Ö");
	set("long", @LONG
ÕâÀïµÄ½ÖµÀ¿í³¨¶ø¸É¾»£¬ºº°×ÓñÆöµÄÂ·Ãæ±»ÓêË®³åµÃ¹âÃ÷Èç¾µ£¬µ«½Ö
µÀÁ½²àµÄµêÆÌÈºÁ¢¶øÓÖ²Î²î²»Æë£¬¹ıÍùµÄÈËÀ´È¥´Ò´Ò£¬Ö»Ìıµ½Ê÷ÉÏµÄĞ¡Äñ
Ê±¶ø²»Ê±µÄà±Ãù¼¸Éù£¬ÕâÀïµ½´¦¶¼É¢·¢×Å°²ÏéÄş¾²µÄÆø·Õ¡£ÍùÄÏÍ¨Ïò´óÀí
³ÇÄÏÃÅ£¬Íù±±¾Íµ½ÁË´óÀí³ÇµÄÖĞĞÄ¡£Â·µÄÁ½ÅÔÖÖÂúÁËÕäÆæµÄ»¨²İ¡£Í¸¹ıÒ»
ÖêÖê¿ªµÄÕıÑŞµÄ²è»¨ÏòÁ½ÅÔ¿´È¥£¬Äã»á·¢ÏÖÂ·µÄÎ÷ÃæÓĞÒ»¼ä[1;32mÊé¾Ö[2;37;0m£¬Â·µÄ¶«
ÃæÓĞÒ»¼Ò[1;32m»¨µê[2;37;0m¡£
LONG
	);
	set("outdoors", "dali");
	set("exits", ([ /* sizeof() == 4 */
  "north" : __DIR__"nandajie1",
  "west" : __DIR__"shuyuan",
  "east" : __DIR__"huadian",
  "south" : __DIR__"nandajie3",
]));
        set("objects", ([
                "/d/npc/duanyu": 1,
          ]));

	setup();
}
