// Room: /d/dali/xbdajie12
// Data: ¹şµÏË¹(hades)
// Time: ¹«Ôª£º1999Äê4ÔÂ21ÈÕ£¬±±¾©Ê±¼ä£º17Ê±28·Ö57Ãë¡£

inherit ROOM;

void create()
{
        set("short", "Ï¦ÕÕÂ·");
        set("long", @LONG
ÕâÊÇÒ»Ìõ´óÀíÊ¯ÆÌ³ÉµÄ´óµÀ£¬½ÖÃæÉÏ¼¸ºõÒ»³¾²»È¾£¬Ê®·ÖµÄ¸É¾»£¬¾İ
ËµÃ¿µ±Ï¦ÑôÎ÷ÏÂµÄÊ±ºò£¬ÕâÀï¾Í»áÓÉÓÚ´óÀíÊ¯µÄ·´ÕÕ¶ø³öÏÖ¹âÃ¢ËÄÉäµÄÃÀ
¾°£¬ÉõÊÇ×³¹Û¡£À´À´ÍùÍùµÄÈË´Ò´ÒµÄ×ß×Å£¬¶¼ÔÚÃ¦×Å¸÷×ÔµÄÊÂÇé£¬Ò»¸±Ïé
ºÍµÄÆø·Õ£¬Î¢·ç´µ¶¯×ÅÂ·±ßµÄÁøÊ÷£¬¶ÙÊ±Ò²Ò¡Ò·¶à×ËÆğÀ´£¬ÈÃÈË¶ÙÉúÒ»ÖÖ
ĞÄÉñ¾ãË¬Ö®Òâ¡£´óµÀÏòÄÏÑÓÉì×Å£¬¶«±ßÊÇÒ»¸ö´óÀíµÄ[1;32m±±³ÇÃÅ[2;37;0m£¬¿ì¸ÏÂ·°É£¡
LONG
        );
        set("objects", ([ /* sizeof() == 1 */
  __DIR__"npc/xiaofan" : 1,
]));

        set("outdoors", "dali");
        set("exits", ([ /* sizeof() == 2 */
  "east" : __DIR__"beidajie3",
  "south" : __DIR__"xbdajie2",
]));

        setup();
}


