// Room: /d/dali/xbdajie1
// Data: ¹şµÏË¹(hades)
// Time: ¹«Ôª£º1999Äê4ÔÂ21ÈÕ£¬±±¾©Ê±¼ä£º17Ê±28·Ö57Ãë¡£

inherit ROOM;

void create()
{
        set("short", "Ï¦ÕÕÂ·");
        set("long", @LONG
ÕâÊÇÒ»Ìõ´óÀíÊ¯ÆÌ³ÉµÄ´óµÀ£¬½ÖÃæÉÏ¼¸ºõÒ»³¾²»È¾£¬Ê®·ÖµÄ¸É¾»£¬¾İ
ËµÃ¿µ±Ï¦ÑôÎ÷ÏÂµÄÊ±ºò£¬ÕâÀï¾Í»áÓÉÓÚ´óÀíÊ¯µÄ·´ÕÕ¶ø³öÏÖ¹âÃ¢ËÄÉäµÄÃÀ
¾°£¬ÉõÊÇ×³¹Û¡£À´À´ÍùÍùµÄÈË´Ò´ÒµÄ×ß×Å£¬¶¼ÔÚÃ¦×Å¸÷×ÔµÄÊÂÇé£¬Ò»¸±Ïé
ºÍµÄÆø·Õ£¬Î¢·ç´µ¶¯×ÅÂ·±ßµÄÁøÊ÷£¬¶ÙÊ±Ò²Ò¡Ò·¶à×ËÆğÀ´£¬ÈÃÈË¶ÙÉúÒ»ÖÖ
ĞÄÉñ¾ãË¬Ö®Òâ¡£´óµÀÏò±±±ßÑÓÉì×Å£¬Î÷±ßÊÇ[1;32mÑÃÃÅ[2;37;0m£¬¶«±ßºÃÏó»¹ÊÇ±ÊÖ±µÄ½Ö
µÀ£¬ÏòÄÏ¾ÍÊÇ´óÀíµÄ[1;32mÎ÷´ó½Ö[2;37;0mÁË£¬¿ì¸ÏÂ·°É£¡
LONG
        );
        set("outdoors", "dali");
        set("exits", ([ /* sizeof() == 4 */
  "north" : __DIR__"xbdajie2",
  "west" : __DIR__"yamen",
  "east" : __DIR__"duan1",
  "south" : __DIR__"xidajie1",
]));

        setup();
}

