                          【少林寺地图】
                                 
                               后山
                                 |    
                              千佛殿 伽蓝殿
                                 |  /
          方丈室       地藏殿---广场---白衣殿   
            |                    |
           茶室                石板路---后殿门---木人巷     藏经阁
            |                    |                         /
         方丈精舍---林间小径---石板路---林间小道---水池---法堂
                          达摩院 |             
                                \|
                               立雪亭
                                 |  
                               石板路
                                 |
                     后殿广场---后殿---后殿广场   
                        |                 |
                    __ 走廊-----走廊-----走廊__
   防具库          /             |             \          藏药库 
     |            /     #-----------------#     \         /
 龙树院---竹林小道      |                 |      少林槐林---药王院
     |       |          |      较艺场     |          | 
  武器库     |  *较艺场-|                 |-较艺场*  |
             |/         |                 |         \|
   僧舍---竹林小道      #-----------------#         槐林---僧舍 戒律院
             |                   |                   |          /
 菩提塔---竹林小道      斋厅---弥勒殿               槐林---心禅平 
             \                   |                  /
     偏舍---偏殿               精进场             偏殿---偏舍   
                \                |               / 
          韦驮殿-侧廊--------大雄宝殿--------侧廊-金刚殿
                                 |
                              香炉殿
                                 |
                      西侧殿---天王殿---东侧殿  
                                 |
                              _石板路_ 
                   禅房     /    |     \
                    |      /     |      \
                   禅房--长廊   前殿   长廊--钟楼小院--钟楼一层
                    |     |      |       |
                 养精殿--长廊    |     长廊
                          |      |       |
              西碑林---西碑林---台阶---东碑林---东碑林         
                             /   |    \
                            /  山门殿  \
                       西侧殿    |     东侧殿  
                                广场  
                                  


附:地图(*)
           
                       般若堂九部                       
                           |                                                  
                       般若堂八部                               
                           |                                      
                       般若堂七部                                 
                           |                                          
     进斋厅   木人场   般若堂六部                                 
       |         |         |                                          
     修业场---修业场---般若堂五部---般若堂--石阶* 
       |         |         |                                        
     木人场   休息房---般若堂四部                                
                           |                                          
                       般若堂三部                                 
                           |                                       
                       般若堂二部                                 
                           |                                         
                       般若堂一部                                 
 
附:地图(*2)
                       罗汉堂九部           
                           |           
                       罗汉堂八部 
                           |
                       罗汉堂七部
                           |
                       罗汉堂六部   木人场   进斋厅
                           |          |        |
    (*2)石阶--罗汉堂---罗汉堂五部---修业场---修业场
                           |         |         |
                       罗汉堂四部---休息房   木人场
                           |
                       罗汉堂三部
                           |
                       罗汉堂二部
                           | 
                       罗汉堂一部 
  
By.godzilla@cctx
   1999.4.1                                          
                                                                                         
                                                                                                                 