“驰骋天下”华山总图

地图一

                  ／莎萝坪? 
　东村口－华山脚下    ｜    
 (接地图二)  |      青柯坪
          玉泉院      ｜
                    千尺幢
                      ｜
                    百尺峡
                      ｜             寝室   
                    老君沟            | 
                      ｜             客厅         
                    猢狲愁            |
             苍龙岭   ｜   山顶小店-练武场－兵器房      
               |   \镇岳宫－－－－    |           小山路－华山小筑
            舍身崖  /        　 　＼  |    小山路/
                 朝阳峰    玉女祠---玉女峰/
                              　　    |
                            　　  玉女峰小路
                                　　  ｜
                            　　  玉女峰小径
                                  　　｜
                                　　思过崖

地图二

     民宅     玄坛庙
      |        /
   西村口--碎石路
              \
             碎石路                  杂货店    民宅
	     /	\	               |        |
          民房 打谷场----------------碎石路--碎石路--碎石路--东村口(承地图一)
		  |	               |	        |
    小巷尽头   碎石路--前厅--内室  铁匠铺--小房间     草棚
         \        |
         小巷--碎石路
                  |
               碎石路--小土房
                  |
               碎石路
                  |
               南村口  
              /   |
     (通往长安) 黄土路  
                    \
                华山村码头            

