// Room: hnme.c
// Date: Sep.6 1997

#include <ansi.h>
#include <room.h>
inherit ROOM;

void create()
{
      set("short", "ÌıÔÂ¸ó");
      set("long", @LONG
ÕâÀïÊÇ¡®ÌıÔÂ¸ó¡¯£¬ÊÇ½­ºşÆæÈË¾»ÄÏµÄ¼Ò¡£ÎİÄÚ²¼ÖÃ¹ÅÆÓµäÑÅ£¬²»´ø
Ò»Ë¿Ë×Æø¡£·¿ÄÚ¼Ò¾ßËäÈ»²»¶à£¬µ«¶¼ÏÔµÃÇ¡µ½ºÃ´¦£¬×îÒıÈË×¢Ä¿µÄÊÇÓÒÊ×
Ò»¸ö¹ÅÉ«¹ÅÏãµÄºìÄ¾Êé¹ñ£¬ÀïÃæ·ÅÂúÁË¸÷ÃÅÅÉµÄÎä¹¦ÃÜ¼®¡£×óÊ×ÊÇÒ»ÕÅ´ó
´²£¬´²±ß²è¼¸ÉÏ»¹ÓĞÒ»Ì×±ğÖÂµÄ²è¾ß£¬ÀïÃæµÄ²èÕıÃ°×ÅÈÈÆø£¬Ê¹Õû¸ö·¿¼ä
ÃÖÂş×Åµ­µ­µÄ²èÏã¡£Ç½ÉÏÌù×ÅÒ»·ùÖ÷ÈËÊÖÊéµÄ¿ñ²İ£º[34mÏĞ¿´Í¥Ç°»¨¿ª
»¨ÂäÂşËæÌìÍâÔÆ¾íÔÆÊæ[2£»37£»0m
LONG );
      set("exits", ([ /* sizeof() == 1 */
          "south" : __DIR__"jiaowai7",
      ]));
      set("valid_startroom","1");

      set("no_fight", 1);
      set("no_clean_up", 0);
      set("sleep_room", 1);
      setup();
      create_door("south", "µñ»¨Ğ¡ÃÅ", "north", DOOR_CLOSED);
}


