#include <ansi.h>
int give_gift();
mixed *story =
({
      " “俺要买剑！”                                                                             ",
      "众人循声望去，只见角落里坐着一个汉子。青面白眼，正在一个人喝酒。                            ",
      "众人目光集中在他身上。                                                                      ",
      "他并不在意，摸了摸手上的瘊子，懒洋洋道：“有人不同意，可以问问我的刀。”                    ",
      "乌黑的菜刀，苍白的手！                                                                      ",
      "众人感到被一股无形的杀气迫得透不过气来。                                                    ",
      "那人缓缓站起身来。                                                                          ",
      "有人额头已渗出冷汗，后悔不该来此。                                                          ",
      "他一步一步向宝剑走去。                                                                      ",
      "他走路的姿态怪异而奇特，左脚先往前迈出一步，右脚再慢慢地跟下去，看来每一步都走得很艰苦。    ",
      "众人这才注意到，原来他右脚的鞋子底开了，为了防止鞋底掉下来，只好拖着走。                    ",
      "阿罕嘶声道：“你就这样把剑拿走？“                                                          ",
      "那人回头冷冷看了他一眼，苍白的手握紧了刀柄……                                              ",
      " *   *   *                                                                                  ",
      "刀光一闪。                                                                                  ",
      "桌上一棵白菜缓缓分为两半，菜刀钉入桌面半分。                                                ",
      "众人大惊失色。                                                                              ",
      "那人缓缓拔起菜刀，神情萧索地吹落上面的菜汁，眼中说不出的寂寞。                              ",
      "远山上冰雪般寒冷的寂寞，冬夜里流星般孤独的寂寞。                                            ",
      "众人敬畏地望着他的背影一跛一跛地离去，都长舒了一口气。                                      ",
      "忽然一阵“叮哐”之声，那人不慎从楼梯上滚了下去，双剑掉在了地上。                            ",
      "楼上只留下一只鞋底和一块"+HIR"和田大玉"WHT+"。",
      (: give_gift :),
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/clone/story/obj/poxie", 1,
        HIW "\n一只"NOR+HIC"破鞋"HIY"“啪”的一声掉在你面前。\n\n" NOR);
        return 1;
}

