#include <ansi.h>
int give_gift();
mixed *story =
({
        "话说某天十兆登陆北侠，想看看大家都在干嘛。",
        "……",
        "无缺恭恭敬敬地向多隆磕头请安，叫道：「师父！」",
        "倩儿正一边笑眯眯的吃着巧克力豆，一边在地狱里仰望天堂。",
        "伪钞象是着了魔一样，转来转去像个没头苍蝇，嘴里嘀咕着些谁也听不懂的话。",
        "天鹰无奈的把两个肩膀耸的老高。",
        "色的米觉得自己是一个地地道道的大猪头，而且非常肯定。",
        "水变油不停的说「让我们紧密团结在以扣肉为核心的党中央周围，高举十兆理论伟大旗帜，走有北侠特色的发展道路……」",
        "令狐虫之米四处跟人嬉皮笑脸的打招呼：「Hi,帅哥! ! !」",
        "财神爷突然降临人间，把地上的黄金全挖走了。",
        "渡空正在手舞足蹈：「如今的我们变态去，变呀变态去。」",
        "只听“呜-呜-”之声大作，天下无双又开始跟蒙面杀手吹海螺玩。",
        "巴锲勒在卧室里面百无聊赖，无所事事，只好左手和右手打架。",
        "红粉菲菲丢下一些白银。",
        "苏频陀变成一头又肥又壮的猪，伸长着鼻子拱来拱去。",
        "渡雪面对墙壁慢慢盘膝坐下，身躯挺直；头，手，足五心朝天；心中默念“南无阿弥陀佛”",
        "凡人雨，雪中雨一干人等在抢task。",
        "李逍遥躬身作了个揖：「欢迎来我家池子里灌水！」",
        "冰冰正在隐着身，看蚂蚁怎么上树。",
        "……",
        "十兆暗自奸笑：让我来搞点小破坏。。。",
        "只见十兆伸手凌空一指，变出了一颗什么东西，看也不看就扔了下去。",
        (: give_gift :),
        "咦……好像变错了……想变份迷春药出来，怎么变出来的好像是仙豆？",
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/d/wizard/obj/xiandou", 1,
                HIY"\n一颗"NOR+HIG"仙豆"HIY"从天而降，在地上跳了两下，正落在你的面前。\n\n" NOR);
        return 1;
}
