#include <ansi.h>
int give_gift();
mixed *story =
({
                 "某日，李逍遥在酒店打架闹事，",
                 "有人通风报信，李大婶急忙赶到，",
                 "只听众人议论纷纷： ",
                 "“这小子又来生事！有爹生没娘教！”  ",
                 "李大婶气上心头，“啪”的一声，晕倒在地。 ",
                 "“别玩了”逍遥嘴巴虽这么说，却冲上去， ",
                 "一把拉起她，发现李大婶全身发软，反应全无，",
                 "逍遥惊恐万分，不停摇着她喊道： ",
                 "“罗刹鬼婆，婶婶，婶婶！”  ",
                 "这时，一个熟悉的声音从房外传来：",
                 "“小兄弟，别失望，我有办法”， ",
                 "原来是赤木、阿寿与信长。",
                 "“余杭镇出海西南方，有一仙灵岛，岛上的仙女提炼了很多灵丹妙药，可起死回生。” ",
                 "赤木拿出一把锤子，交给逍遥：",
                 "“这个叫破天锤，用它砸碎岛上驻守的石像，那些机关就会自动消失。”  ",
                 "李逍遥拜谢，只身来到仙灵岛。 ",
                 "“何方妖孽！”逍遥拨开草丛定睛一看，原来是一尊“阿修罗”石像。 ",
                 "“各位神明，在下李逍遥，因婶婶重病，才来此求仙药救命，请众神开恩。” ",
                 "神像似乎不接受解释，纷纷向李逍遥压下。 ",
                 "他情急之下抓起破天锤，往石像砸去，那巨大的神像却时变得粉碎。",
                 "惊魂未定的逍遥，跪着向碎片叩拜：",
                 "“有怪莫怪，待逍遥救回婶婶，一定回来向各位赔罪！",
                 "这把破天锤就留在这里，以供后人求药之用吧。”  ",
                 (: give_gift :),
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/clone/story/obj/potianchui", 1,
        HIW "\n一把"NOR+HIY"破天锤"HIY"“啪”的一声掉在你面前。\n\n" NOR);
        return 1;
}

