#include <ansi.h>
int give_gift();
mixed *story = 
({
"秋，落叶萧萧",
"街上的尽头，有座巨大的宅院，看来也正和枝头的黄叶一样，已到了将近枯落的时候",
"那两扇朱漆大门，几乎已有一年多未曾开过了，门上的漆早已剥落，露出些许铁锈",
"萧索冷清的院内杂草丛生，一棵衰老的梧桐已经开始枯萎",
"一条人影负手站在雾中，腰悬长剑，看起来就像这秋夜一般萧索落寞",
"这人赫然竟是燕丹！",
"他从不笑",
"他不笑，全因为他从来也没真正的满足过",
"何以他从不满足？",
"缘于他在很年轻的时候，已经得到太多",
"他，五岁学剑，七岁已青出于蓝，九岁一剑成名，十三岁时更已悟出更高境界的剑道",
"从此创下圣灵剑法，功力益发炉火纯青",
"亦由那时开始，他在剑术的比试上，从无败绩",
"后来，江湖人更尊称他为——剑圣！",
"* * *",
"忽然他嘴角闪过一丝不宜察觉的冷笑,幽幽道：“我若是你，就不会来”",
"他没有回头竟已发现背后的人影",
"人影没有回答",
"他突然拔剑，反身刺去。赫然竟是清风十三式！",
"世上能躲过这一剑的绝对不超过十个！",
"杂烩饭恰好是其中一个。",
"倩儿也恰好是其中一个。",
"红粉菲菲也恰好是其中一个。",
"空陆也恰好是其中一个。",
"我想我是也恰好是其中一个。",
"天鹰也恰好是其中一个。",
"水变油也恰好是其中一个。",
"无能小米也恰好是其中一个。",
"小浩也恰好是其中一个。",
"蒙古奸细也恰好是其中一个。",
"可那人影像一片枯叶一样在气流中飘荡，躲开了这致命的一剑！",
"燕丹剑随身转，续而刺出十九剑，竟然是华山「玉女十九剑」！",
"但奇的是这十九剑便如一招，手法之快，直是匪夷所思！",
"竟然又刺了个空！",
"燕丹身形一变，奇诡地挥出「泉鸣芙蓉」、「鹤翔紫盖」、「石廪书声」、",
"「天柱云气」及「雁回祝融」衡山五神剑！",
"一剑穿心！",
"燕丹的瞳孔骤然收缩，他意识到自己犯了个不可饶恕的错误：",
"那人影并不是血肉之躯！",
"那是一件衬衣，他下午刚刚洗过的衬衣，他唯一的一件衬衣！",
"他准备明天穿着去和武当派女侠暖风约会的衬衣……",                                        
        (: give_gift :),
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/clone/story/obj/chenyi", 1,
        HIM"\n一件破破烂烂的"HIC"衬衣"HIM"从天上飘了下来\n" NOR);
        return 1;
}
