#include <ansi.h>

string give_gift();

protected mixed *story = ({
 "冷！",
 "极冷！  ",
 "庚寅年七月十四子时三刻，乌云暗涌，月光时隐时现。",
 "华山玉女峰。",
 "庭院，一处旧庭院，一处墙壁斑驳的破旧庭院... ",
 "旧庭院并不出奇，即便在深山老林，亦可觅见一二处旧庭院。  ",
 "然此庭院，虽院门深锁，却透出阵阵彻骨的寒意，寒气森森，令人望而却步！",
 "... ",
 "......  ",
 "......... ",
 "“唰唰唰唰”...四道身影！如箭似电，飞驰而至。   ",
 "一僧、一道、一儒生、一年轻女子。",
 "“渡最秃驴，你给...还是不给！？”道士深吸口气，压住暗涌的气血，冷冷说道。   ",
 "“给又如何？不给又如何？！”僧人抽了抽脸上横肉，狠狠瞪了道士一眼。  ",
 "“我散尽千金，报告你鸡翅无数，你竟如此绝情？”道士颤声道。  ",
 "“不要逼我！！不要逼我！！！”道士撕声叫了起来。",
 "“石中玉，你待怎样？”渡最不禁后退一步，暗运易筋经神功第十二层，浑身金光流闪，竟是“金刚不坏神功”。",
 "“好..好..我豁出去了！”石中玉脸色越发异常难看...   ",
 "石中玉后退一步，猛然扑地，头竟如小鸡啄米般磕起头来...   ",
 "“求求你，求求你，可怜可怜我，给一个丸子吧！我好长时间没磕药啦....呜呜..”  ",
 "“唉！地主家也没有余粮啊！”渡最摊了摊手。  ",
 "一旁，儒生不禁冷笑一声，转头对年轻女子低声说道：与渡最这样的老匹夫交朋友，倒还不如没有朋友。",
 "“天涯！你...你不要血口喷人！”渡最涨红脸申辩。 ",
 "“唉...石中玉，男人最重要是要自食其力，不要总是向人乞求！”",
 "年轻女子叹道。“大师 ，我这里倒有一颗『乌鸡白凤丸』，你与我给他吧！”",
 "渡最见那女子意欲送药，满脸堆笑，腻声说道：",
 "“青儿，不需你给，小僧兜里尚有81颗九转熊胆丸，方才一时忘记，我给他半颗就是了...” ",
 "“非但是铁公鸡，还非见色不吐宝...”天涯一脸不屑。   ",
 "“给他吧，以我今日之修为，有无灵丹妙药相助，已无差别。”青儿道。   ",
 "“谢谢仙姑，谢谢仙姑，仙姑菩萨心肠，普渡世人，千秋万世，一统江湖...”",
 "石中玉心中 一乐，竟语无伦次了起来。",
 "石中玉接过『乌鸡白凤丸』，这才抬了头望了望那女子。  ",
 "“哇！”只见那女子虽素衣淡妆，却仍美艳不可方物！",
 "石中玉色心大盛，张开双手作了一个饿虎擒羊式，向青儿环腰抱去，却只牵到一片衫角。  ",
 "渡最悲愤难抑，跨上一步，左右开弓，便是四记耳光。啪啪啪啪四声响过，石中玉两边脸颊登时红肿。  ",
 "石中玉只觉眼鼻剧痛，眼前一黑，向前扑倒，手中丹药脱手而出... ",
(: give_gift :)
});

void create()
{
seteuid(getuid());
}

mixed query_story_message(int step)
{
return step < sizeof(story) ? story[step] : 0;
}

string give_gift()
{
STORY_D->give_gift("/clone/story/obj/wujiwan", 1,
   HIM "\n“啪”的一声一枚仙丹掉到你面前。\n\n" NOR);
return HIM "听说华山遗落了一枚仙丹。\n" NOR;
}
