// story:xtu

#include <ansi.h>

string give_gift();

protected mixed *story = ({
"有人送雪の兔一面魔镜，雪の兔非常开心，马上来到魔镜面前。                 ",
"雪の兔：魔镜魔镜告诉我，谁是这个世界上最美丽的女人？                     ",
"魔镜：反正不是你～                                                       ",
"雪の兔：那世界上还有谁比我更漂亮？                                       ",
"魔镜：贞子，赵本山，爱因斯坦，张飞……                                   ",
"雪の兔生气了，把魔镜胖揍一顿。                                           ",
"......",
"雪の兔：魔镜魔镜告诉我，谁是这个世界上最美丽的女人？                     ",
"魔镜：应该就是你～                                                       ",
"雪の兔：那世界上谁是第二漂亮的女人？                                     ",
"魔镜：贞子，赵本山，爱因斯坦，张飞……                                   ",
"雪の兔又生气了，把魔镜又胖揍一顿。                                       ",
"......                                                                     ",
"雪の兔：魔镜魔镜告诉我，我这张妖媚性感的脸什么时候最耐看？               ",
"魔镜“啪”的一声变成天文望远镜：啥也看不清的时候最好看！                 ",
"雪の兔：魔镜魔镜告诉我，我这身冰清玉洁的身材什么时候最有气质？           ",
"魔镜“啪”的一声变成哈哈镜：身材变形的时候最有气质！                     ",
"雪の兔：魔镜魔镜告诉我，我全身哪个部位能火爆的让男人流鼻血？             ",
"魔镜：拳头！                                                             ",
"雪の兔太生气了，把魔镜再胖揍一顿！远远扔了出去...                        ",
        (: give_gift :)
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

string give_gift()
{
        STORY_D->give_gift("/clone/story/obj/jingzi", 1,
                           HIM "\n“啪”的一声一块魔镜掉到你面前。\n\n" NOR);
        return HIM "听说一块魔镜掉到了人间。\n" NOR;
}

