#include <ansi.h>
int give_gift();
mixed *story = 
({
"扬州城外华山村。",
"晚秋，已颇有几分寒意。",
"树叶几近落光，鸦在光秃秃的枝上哀啼。",
"村北打谷场边疏疏落落立着七八个神情严肃的江湖人。",
"其中南首一人，五短身材，双目如电，正是人称“鹰之眼”的巴锲勒。",
"这位以目力著称的塞外异人驾临这汲汲无名的小村落。",
"其目的只有一个---亲眼一见八神那名倾天下的快刀。",
"============================",
"八神",
"本名：不详",
"职业：待查",
"出身：未知，现隐居于华山村",
"============================",
"巴锲勒手中这份简略的材料记述的却是天下最富传奇色彩的人物。",
"他，年近而立始习刀，却以拔刀快而著称于世。",
"其出手更快！因此直到现下还从未有活人见过他的刀！",
"这就是为什么京城鹿鼎赌局情愿开出七十万两黄金的重注，",
"来赌他的刀究竟是什么颜色的原因！",
"而哦咯正是局主小宝·韦三顾茅庐，不惜血本由南疆沙漠中请来的鉴刀之人……",
"* * *",
"打谷场边的小路，八神慢慢地走过来，脸上透着凝重",
"从背后看，他身材很单薄。阳光从前面照过来，把他的身影拉得很长",
"就那么随随便便往场中一站，说不出的潇洒好看",
"刀斜插在腰带中——漆黑的刀鞘，同样漆黑的刀柄，衬托出握刀的手更加苍白",
"指甲修剪得短短的，因为他不想有任何东西妨碍他拔刀",
"人在江湖，拔刀慢通常只意味着一个字——死！",
"* * *",
"时间仿佛凝固了似的……",
"八神紧握刀柄的手已因极度兴奋而开始出汗",
"他的瞳子倏地一亮——对方眼中正闪过一丝恐惧，好机会！",
"转身——拔刀——出手",
"转瞬刀已入鞘！鲜血自刀口汩汩涌出",
"场周众人脸上一片惊惧与茫然，不约而同地摇了摇头，",
"齐将目光投向巴锲勒——赌局重金礼聘的仲裁人",
"这位七十步内能分辨蚊子公母，",
"当世号称目力无双的沙漠异人阴骘的脸上缓缓渗出一层细密的汗珠",
"他表情呆滞、神色木讷，颤声道：“我……我……”",
"忽然猛地将手探入怀中，掏出一面上刻“鹰之眼”三个金字的精致玉牌。",
"颤抖着慢慢高举过头顶，远远的扔了出去……",
(: give_gift :),
"八神看都不看众人一眼，神情变得更加凝重——他还有最重要的事要办！",
"只见他一边熟练地用铜盆去接血，一边扯开喉咙大喊：",
" “嘿——刚杀的猪喽——新鲜的下水谁要…… ”",
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/clone/story/obj/yupai", 1,
        HIM "\n一把绿色的"HIG"玉牌"HIM"从天而降，把你的脑袋砸了一个大包。\n" NOR);
        return 1;
}
