
#include <ansi.h>

inherit ROOM;


void create ()
{
  set ("short","岳母墓");
  set ("long", @LONG
岳飞是南宋抗金名将，岳家军先后屯驻江州（九江）,鄂州（武昌)
，为保卫江南人民免遭金兵铁蹄蹂躏作出了卓越贡献。岳母姚氏深明大
义，曾给岳飞刺“精忠报国”四字，支持他抗御外侮，收复中原的主张，
被中国人民尊崇千古母教典范。公元1136年春，岳母病逝于鄂州，岳飞
扶榇顺江而下，将其安葬于九江县株岭山东端，墓朝西北，圆形拱顶石
灰石结构，长9.1米，宽3.2米，高1.7米，墓碑直刻“宋岳忠武王母姚太
夫人之墓”。此外，在岳母墓旁有石雕马两具，高与长各1.5米，重约一
吨，还有秦桧夫妇跪势石俑残块。
LONG);

  set("exits", ([ 

  "east":__DIR__"caodi1",
  "southwest":__DIR__"xiaolu2",
  
         ]));

  set("valid_startroom", 1);
  set("outdoors","jiujiang");
  setup();
 
}

