// xiangfu-lun perform
//by iceland

#include <ansi.h>

string  *msga = ({
HIY"$N伸手搭在法轮上往斜里一拨，法轮在空中划出一道弧线，向$n飞去。\n"NOR,
HIY"$N不待法轮落地，抢上前伸脚一挑一送，法轮陡然飞起，撞向$n的。\n"NOR,
HIY"$N吐气发力，双掌齐推，法轮去势劲急，呜的一声冲向$n。\n"NOR,
HIY"$N双手箕张，拦在$n身前，法轮在空中旋转而回，袭向$n的后脑。\n"NOR,
HIY"$N霹雳般一声断喝，侧身单拳硬生生击在法轮上，法轮方向猛的一转，直追向$n。\n"NOR,
HIY"$N右手圈转，将法轮轻轻巧巧接在手中，紧接着手腕急翻，左手平推，法轮旋向$n的$l。\n"NOR,
HIY"$N凭内力将法轮定在手掌心上急旋，眼光扫向$n，法轮紧跟着飞了过去。\n"NOR,
HIY"$N跃入半空，双掌自上而下推出，法轮凭空加速，威势惊人。\n"NOR,
HIY"$N抢前几步，手腕一转，借势送出法轮，随后向$n虚拍几掌，封住了$n的退路。\n"NOR,
});

string  *msgd = ({
HIC"$n见法轮旋转奇疾，锋利只怕犹如刀剑，连忙一个筋斗跃起，法轮呼的从脚下飞过。\n\n"NOR,
HIC"$n不慌不忙，如陀螺般急转了个圈，避了开来。\n\n"NOR,
HIC"$n措手不及，危急中弯腰缩头，法轮刚好从头顶飞过。\n\n"NOR,
HIC"$n一个侧翻，身体在空中横滚出去，避过了这雷霆一击。\n\n"NOR,
HIC"$n大出意料之外，无奈之下只得滚倒在地，险些未能避过。\n\n"NOR,
HIC"$n看准来势，双手一兜一分，将法轮荡了开去。\n\n"NOR,
HIC"$n倒退几步，拧腰一闪，将法轮让了开去。\n\n"NOR,
HIC"$n双掌运足内力疾拍，法轮被荡得失了准头，从$n身旁飞了过去。\n\n"NOR,
});