//Cracked by Roath

inherit ROOM;
void create()
{
  set ("short", "´óÄ®½­Öİ");
  set ("long", @LONG

    Õâ¸öµØ·½¾ÍÊÇ½­ÖİµÄ¶«ÃÅÁË£¬Õâ¸öµØ·½±ÈÆğ³¤°²³Ç¿ÉÕæÊÇ²îÔ¶ÁË¡£
Õâ¸öµØ·½ ËäÈ» ºÍ ½­Î÷µÄ½­ÖİÍ¬Ãû£¬µ«µØ´¦´óÄ® ³ÇÊĞÒªĞ¡µÄ¶àÁË¡£
 Ò»ÑÛ¶«Íû£¬¿ÉÒÔ¿´µ½Â·ÉÏÊèÊèÀÊÀÊµÄ¼¸¸öĞĞÈË£¬Õâ¸ö³ÇÃÅ¿´ÆğÀ´
Ò²ºÜ¾ÉÁË¡£ÉÏÊé£º
[1;32m
                ¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù
                ¡ù                    ¡ù
                ¡ù    ½­        Öİ    ¡ù
                ¡ù                    ¡ù
                ¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù¡ù
[m
LONG);
        set("exits", ([
  "west" : __DIR__"sibei-w2",
  "north": "/d/qujing/shuangcha/shanlu1",
]));
        set("objects", ([
  "/d/city/npc/wujiang":2,
                ]));
  setup();
}
