inherit ROOM; 
 
#include <ansi.h>
void create() 
{ 
        set("short", "¾«Áé½ç");
        set("long",
"[1;32mÕâÀïÊÇÒ»¸öÒìÊÀ½ç£¬À´µ½ÕâÀï£¬ÒÑ¾­Ô¶ÀëÁËÄãµÄ½­ºþ¡£ÕâÀï\n"
"Ã»ÓÐ¶÷Ô¹£¬Ã»ÓÐ·×Õù¡£ÓÐµÄÖ»ÊÇ¶¯ÌýµÄÒôÀÖ£¬ÓÅÃÀµÄ·ç¾°¡£Ê®ËÄ¸ùÓñÊ¯Öù\n"
"×Ó²ÎÌì¶øÁ¢£¬¿´²»µ½¾¡Í·¡£ÓñÖù¼ä°×ÔÆçÔÈÆ£¬Í¸¹ý°×ÔÆ£¬ÒþÔ¼ÄÜ¿´µ½µñÀ¸\n"
"»­¶°£¬Ìýµ½Ë¿ÖñóÏ¸è£¬¹â²ÊÁ÷¶¯£¬ÆæÀö²»¿ÉÃû×´¡£ÕâÀïÃ»ÓÐÖçÒ¹Ö®·Ö£¬Ö»\n"
"ÓÐ¿ÕÆøÖÐ²»Ê±´«À´ÂÆÂÆÇåÏã£¬ÁîÈË¸Ðµ½Æ½¾²°²Äþ¡£\n"
);
        set("exits", ([ 
  "north" : __DIR__"spirit2",
]));
        set("no_clean_up", 0);

        setup();
        replace_program(ROOM);
}

