string *msg_d = ({
                      "他妈的","你妈的","傻B","我操","操你","和你妈睡",
                      "fuck","FUCK","Fuck","婊子","妈的","操你",
                      "你奶奶的","和你妈做爱","她妈的","扯蛋","你爷爷的"
                      "小b","j8","搞b","j8rd","做爱",
                      "放你妈的屁","操你妈","日死你","干你娘",
                      "操你姐","狗屁wiz","狗wiz","破wiz","日死你",
                      "小逼崽子","你妈了个老逼","你妈是","鸡巴",
                      "你奶奶个逼","滚鸡巴蛋","滚犊子","去你妈","我靠",
                      "十八代祖宗","我是你爹","我是你爸","我是你爷爷",
                      "该死的wiz","死wiz","j8wiz","日你母妈",
                      "个逼","各逼","了个逼","了各逼",
                      "阴道","b毛","阴毛","你妈了个老b",
                      "婊子养的","卖逼的","卖b","你妈了个老b",
                      "操你姐","狗屁wiz","狗wiz","破wiz","日死你",
                      "日你母妈","鸡巴wiz","狗日的wiz","卖b的wiz","日你祖宗",
                      });
