//干活
string *renwu = ({
  5,
  "前广场", "扫地",
  "菜园", "挑水",
  "柴房", "劈柴",
  "书房", "抄经文",
  //"证道院","念经",
  //"讲经台","搬砖",
  //"练功房","修理木人",
  "走廊", "刷漆",
  //"小院","修剪树木",
  //"罗汉堂","擦佛像",
  //"菩提院","擦玉瓶",
});

//购买
string *renwu1 = ({
  0,
  "烤鸡腿", "jitui",
  "包子", "baozi",
  "水壶", "shui hu",
  "牛皮酒袋", "jiudai",
  "北京烤鸭", "kaoya",
});

string *renwu2 = ({
  0,
  "烤鸡腿", "jitui", "肚子饿了",
  "蜂蜜", "feng mi", "炼制丹丸需要些蜂蜜",
  "长剑", "sword", "要下山去一趟，可是没有兵器",
  "烤鸡腿", "jitui", "肚子饿了",
  "烤鸡腿", "jitui", "肚子饿了",
});

string *renwu3 = ({
  0,
});

string *renwu4 = ({
  0,
});

string *renwu5 = ({
  0,
});

string *renwu6 = ({
  0,
});
