                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        "蜀山剑派"      :       
                ([      
                "rank"  : ({                            //score
                        HIM "【 剑  女 】" NOR,         //dx<1000
                        HIM "【 单剑手 】" NOR,         //dx<10000      
                        HIM "【 双剑手 】" NOR,         //dx<100000
                        HIM "【$a百剑舞者】" NOR,       //dx<500000
                        HIM "【$a千剑出者】" NOR,       //dx<1000000
                        HIM "【$a万剑归者】"NOR,        //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "女侠",                         //dx<100000
                        "婆婆",                         //dx<500000
                        "老奶奶",                       //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "小女子",                       //dx<10000      
                        "小女子",                       //dx<100000
                        "本姑娘",                       //dx<500000
                        "本姑娘",                       //dx<1000000
                        "本姑娘",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        "神剑山庄"      :       
                ([      
                "rank"  : ({                            //score
                        HIM "【 剑  女 】" NOR,         //dx<1000
                        HIM "【 单剑手 】" NOR,         //dx<10000      
                        HIM "【 双剑手 】" NOR,         //dx<100000
                        HIM "【$a百剑舞者】" NOR,       //dx<500000
                        HIM "【$a千剑出者】" NOR,       //dx<1000000
                        HIM "【$a万剑归者】"NOR,        //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "女侠",                         //dx<100000
                        "婆婆",                         //dx<500000
                        "老奶奶",                       //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "小女子",                       //dx<10000      
                        "小女子",                       //dx<100000
                        "本姑娘",                       //dx<500000
                        "本姑娘",                       //dx<1000000
                        "本姑娘",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        "将军府"        :       
                ([      
                "rank"  : ({                            //score
                        HIY "【 兵  卒 】" NOR,         //dx<1000
                        HIY "【 偏  将 】" NOR,         //dx<10000      
                        HIY "【 牙  将 】" NOR,         //dx<100000
                        HIY "【 $a女将军 】" NOR,       //dx<500000
                        HIY "【$a女大将军】" NOR,       //dx<1000000
                        HIY "【 $a女帅 】"NOR,  //
                        }),
                "respect" : ({
                        "女差官",                       //dx<1000
                        "女兵爷",                       //dx<10000      
                        "女将军",                       //dx<100000
                        "女将军",                       //dx<500000
                        "大将军",                       //dx<1000000
                        "女元帅",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({
                        "本差",                         //dx<1000
                        "本姑娘",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本将军",                       //dx<500000
                        "本大将军",                     //dx<1000000
                        "本帅", 
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                               //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
        "少林寺"        :                               //No Boy ?
                ([      
                "rank"  : ({                            //score
                        WHT "【 小尼姑 】" NOR,         //dx<1000
                        WHT "【 武  僧 】" NOR,         //dx<10000      
                        WHT "【授业师傅】" NOR,         //dx<100000
                        WHT "【$a比丘尼】" NOR,         //dx<500000
                        WHT "【 $a师太 】" NOR,         //dx<1000000
                        WHT "【 $a主持 】"NOR,  //
                        }),
                "respect" : ({
                        "小师太",                       //dx<1000
                        "师太",                         //dx<10000      
                        "师太",                         //dx<100000
                        "师太",                         //dx<500000
                        "师太",                         //dx<1000000
                        "女主持",       
                        }),
                "rude"  : ({
                        "小贼尼",                       //age<25
                        "贼尼",                         //age<50
                        "老贼尼",
                        }),                     
                "self"  : ({
                        "小尼",                         //dx<1000
                        "本尼",                         //dx<10000      
                        "本尼",                         //dx<100000
                        "本师太",                       //dx<500000
                        "本师太",                       //dx<1000000
                        "本主持",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小尼",                         //dx<1000
                        "小尼",                         //dx<10000      
                        "小尼",                         //dx<100000
                        "贫尼",                         //dx<500000
                        "贫尼",                         //dx<1000000
                        "贫尼", 
                        }),
                ]),
        
        
        
        
        "武当派"        :       
                ([      
                "rank"  : ({                            //score
                        WHT "【 小道姑 】" NOR,         //dx<1000
                        WHT "【 茶水道 】" NOR,         //dx<10000      
                        WHT "【 道  姑 】" NOR,         //dx<100000
                        WHT "【 $a道姑 】" NOR,         //dx<500000
                        WHT "【 $a道长 】" NOR,         //dx<1000000
                        WHT "【 $a掌道 】"NOR,  //
                        }),
                "respect" : ({
                        "小道姑",                               //dx<1000
                        "道姑",                                 //dx<10000      
                        "道姑",                                 //dx<100000
                        "道姑",                         //dx<500000
                        "女道长",                               //dx<1000000
                        "女掌教",       
                        }),
                "rude"  : ({
                        "小牛鼻子",                     //age<25
                        "牛鼻子",                       //age<50
                        "老牛鼻子",
                        }),                     
                "self"  : ({    
                        "本姑娘",                       //dx<1000
                        "本道姑",                       //dx<10000      
                        "本道姑",                       //dx<100000
                        "本师太",                       //dx<500000
                        "本师太",                       //dx<1000000
                        "本师太",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "贫道",                         //dx<1000
                        "贫道",                         //dx<10000      
                        "贫道",                         //dx<100000
                        "贫道",                         //dx<500000
                        "贫道",                         //dx<1000000
                        "贫道", 
                        }),
                ]),
        
        "明教"          :       
                ([      
                "rank"  : ({                            //score
                        HIM "【 教  众 】" NOR,         //dx<1000
                        HIM "【 旗  主 】" NOR,         //dx<10000      
                        HIM "【 舵  主 】" NOR,         //dx<100000
                        HIM "【 $a堂主 】" NOR,         //dx<500000
                        HIM "【 $a散人 】" NOR,         //dx<1000000
                        HIM "【 $a明王 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "女侠",                         //dx<100000
                        "婆婆",                         //dx<500000
                        "老奶奶",                       //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({    
                        "本少女",                       //dx<1000
                        "本姑娘",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本女侠",                       //dx<500000
                        "姑奶奶",                       //dx<1000000
                        "姑奶奶",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        

/*************************************************
**              神仙系                          **
*************************************************/
        "方寸山三星洞"  :       
                ([      
                "rank"  : ({                            //score
                        WHT "【 小道姑 】" NOR,         //dx<1000
                        WHT "【 女道士 】" NOR,         //dx<10000      
                        WHT "【 道  姑 】" NOR,         //dx<100000
                        WHT "【 $a真人 】" NOR,         //dx<500000
                        WHT "【 $a天师 】" NOR,         //dx<1000000
                        WHT "【 $a大圣 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "道姑",                         //dx<100000
                        "女真人",                       //dx<500000
                        "女天师",                       //dx<1000000
                        "大圣", 
                        }),
                "rude"  : ({
                        "小牛鼻子",                     //age<25
                        "牛鼻子",                       //age<50
                        "老牛鼻子",
                        }),                     
                "self"  : ({    
                        "本姑娘",                       //dx<1000
                        "本道姑",                       //dx<10000      
                        "本道姑",                       //dx<100000
                        "本师太",                       //dx<500000
                        "本师太",                       //dx<1000000
                        "本师太",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "贫道",                         //dx<1000
                        "贫道",                         //dx<10000      
                        "贫道",                         //dx<100000
                        "贫道",                         //dx<500000
                        "贫道",                         //dx<1000000
                        "贫道", 
                        }),
                ]),
"武圣门"        :       
                ([      
                "rank"  : ({                            //score
                        HIR "【 武  侍 】" NOR,         //dx<1000
                        HIR "【 武  众 】" NOR,         //dx<10000      
                        HIR "【 武  修 】" NOR,         //dx<100000
                        HIR "【$a武评者】" NOR,         //dx<500000
                        HIR "【 $a武神 】" NOR,         //dx<1000000
                        HIR "【 $a武圣 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "女侠",                         //dx<100000
                        "婆婆",                         //dx<500000
                        "老奶奶",                       //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({    
                        "本少女",                       //dx<1000
                        "本姑娘",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本女侠",                       //dx<500000
                        "姑奶奶",                       //dx<1000000
                        "姑奶奶",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
        "南海普陀山"    :       
                ([      
                "rank"  : ({                            //score
                        HIC "【 小沙弥 】" NOR,         //dx<1000
                        HIC "【 比丘尼 】" NOR,         //dx<10000      
                        HIC "【 师  父 】" NOR,         //dx<100000
                        HIC "【 $a师太 】" NOR,         //dx<500000
                        HIC "【 $a尊者 】" NOR,         //dx<1000000
                        HIC "【 $a菩萨 】"NOR,  //
                        }),
                "respect" : ({
                        "小师父",                       //dx<1000
                        "师太",                         //dx<10000      
                        "女师父",                       //dx<100000
                        "师太",                         //dx<500000
                        "女尊者",                       //dx<1000000
                        "女菩萨",       
                        }),
                "rude"  : ({
                        "小贼尼",                       //age<25
                        "贼尼",                         //age<50
                        "老贼尼",
                        }),                     
                "self"  : ({
                        "小尼",                         //dx<1000
                        "本尼",                         //dx<10000      
                        "本师太",                       //dx<100000
                        "本比丘尼",                     //dx<500000
                        "本尊者",                       //dx<1000000
                        "本菩萨",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小尼",                         //dx<1000
                        "贫尼",                         //dx<10000      
                        "贫尼",                         //dx<100000
                        "贫尼",                         //dx<500000
                        "老尼",                         //dx<1000000
                        "老尼", 
                        }),
                ]),
        
        "阎罗地府"      :       
                ([      
                "rank"  : ({                            //score
                        HIB "【 鬼  卒 】" NOR,         //dx<1000
                        HIB "【 鬼  差 】" NOR,         //dx<10000      
                        HIB "【勾魂女使】" NOR,         //dx<100000
                        HIB "【 $a女判 】" NOR,         //dx<500000
                        HIB "【 $a鬼主 】" NOR,         //dx<1000000
                        HIB "【$a地藏王】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "女侠",                         //dx<100000
                        "婆婆",                         //dx<500000
                        "老奶奶",                       //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小女鬼",                       //age<25
                        "贼女鬼",                       //age<50
                        "老女鬼",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "本姑娘",                       //dx<10000      
                        "本女使",                       //dx<100000
                        "本女判",                       //dx<500000
                        "本鬼主",                       //dx<1000000
                        "本王", 
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
        "东海龙宫"      :       
                ([      
                "rank"  : ({                            //score
                        HIG "【 侍龙女 】" NOR,         //dx<1000
                        HIG "【 小龙女 】" NOR,         //dx<10000      
                        HIG "【 龙  女 】" NOR,         //dx<100000
                        HIG "【 $a龙女 】" NOR,         //dx<500000
                        HIG "【 $a公主 】" NOR,         //dx<1000000
                        HIG "【 $a龙神 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "小龙女",                       //dx<10000      
                        "龙女",                         //dx<100000
                        "龙女",                         //dx<500000
                        "公主",                         //dx<1000000
                        "女龙神",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "本姑娘",                       //dx<10000      
                        "本龙女",                       //dx<100000
                        "本龙女",                       //dx<500000
                        "本公主",                       //dx<1000000
                        "本龙神",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
        "天空界"        :       
                ([      
                "rank"  : ({                            //score
                        WHT "【 顺风者 】" NOR,         //dx<1000
                        WHT "【 驭风者 】" NOR,         //dx<10000      
                        WHT "【 飞天者 】" NOR,         //dx<100000
                        WHT "【 $a天人 】" NOR,         //dx<500000
                        WHT "【 $a将神 】" NOR,         //dx<1000000
                        WHT "【 $a天众 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "女侠",                         //dx<100000
                        "婆婆",                         //dx<500000
                        "老奶奶",                       //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "小女子",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本姑娘",                       //dx<500000
                        "老婆子",                       //dx<1000000
                        "老婆子",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
        "三界散仙"      :       
                ([      
                "rank"  : ({                            //score
                        HIC "【 修行者 】" NOR,         //dx<1000
                        HIC "【 参悟者 】" NOR,         //dx<10000      
                        HIC "【 悟道者 】" NOR,         //dx<100000
                        HIC "【 $a散人 】" NOR,         //dx<500000
                        HIC "【 $a散仙 】" NOR,         //dx<1000000
                        HIC "【 $a仙尊 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "女侠",                         //dx<100000
                        "婆婆",                         //dx<500000
                        "老奶奶",                       //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "本道姑",                       //dx<10000      
                        "小仙",                         //dx<100000
                        "本真人",                       //dx<500000
                        "本尊",                         //dx<1000000
                        "本尊", 
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
        "五庄观"        :       
                ([
                "rank"  : ({                            //score
                        RED "【 仙  姑 】" NOR,         //dx<1000
                        RED "【 散  仙 】" NOR,         //dx<10000      
                        RED "【 大  仙 】" NOR,         //dx<100000
                        RED "【 $a真人 】" NOR,         //dx<500000
                        RED "【 $a真君 】" NOR,         //dx<1000000
                        RED "【 $a天尊 】"NOR,  //
                        }),
                "respect" : ({
                        "小仙姑",                       //dx<1000
                        "仙姑",                         //dx<10000      
                        "仙姑",                         //dx<100000
                        "女真人",                       //dx<500000
                        "真君",                         //dx<1000000
                        "女天尊",       
                        }),
                "rude"  : ({
                        "小牛鼻子",                     //age<25
                        "牛鼻子",                       //age<50
                        "老牛鼻子",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "本道姑",                       //dx<10000      
                        "小仙",                         //dx<100000
                        "本真人",                       //dx<500000
                        "本尊",                         //dx<1000000
                        "本尊", 
                        }),
                "self_rude"     : ({                    //自鄙称
                        "贫道",                         //dx<1000
                        "贫道",                         //dx<10000      
                        "贫道",                         //dx<100000
                        "贫道",                         //dx<500000
                        "贫道",                         //dx<1000000
                        "贫道", 
                        }),
                ]),     
        
        "昆仑山玉虚洞"  :       
                ([      
                "rank"  : ({                            //score
                        WHT "【 童  姑 】" NOR,         //dx<1000
                        WHT "【 半  仙 】" NOR,         //dx<10000      
                        WHT "【 地  仙 】" NOR,         //dx<100000
                        WHT "【 $a真人 】" NOR,         //dx<500000
                        WHT "【 $a尊者 】" NOR,         //dx<1000000
                        WHT "【 $a天尊 】"NOR,  //
                        }),
                "respect" : ({
                        "小仙姑",                       //dx<1000
                        "仙姑",                         //dx<10000      
                        "仙姑",                         //dx<100000
                        "女真人",                       //dx<500000
                        "女仙人",                       //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小牛鼻子",                     //age<25
                        "牛鼻子",                       //age<50
                        "老牛鼻子",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "本道姑",                       //dx<10000      
                        "小仙",                         //dx<100000
                        "本真人",                       //dx<500000
                        "本尊",                         //dx<1000000
                        "本尊", 
                        }),
                "self_rude"     : ({                    //自鄙称
                        "贫道",                         //dx<1000
                        "贫道",                         //dx<10000      
                        "贫道",                         //dx<100000
                        "贫道",                         //dx<500000
                        "贫道",                         //dx<1000000
                        "贫道", 
                        }),
                ]),
        
        "月宫"  :       
                ([      
                "rank"  : ({                            //score
                        WHT "【 小仙女 】" NOR,         //dx<1000
                        WHT "【 小仙姑 】" NOR,         //dx<10000      
                        WHT "【 仙  姑 】" NOR,         //dx<100000
                        WHT "【 $a仙女 】" NOR,         //dx<500000
                        WHT "【 $a玄女 】" NOR,         //dx<1000000
                        WHT "【 $a娘娘 】"NOR,  //
                        }),
                "respect" : ({
                        "小仙女",                       //dx<1000
                        "小仙姑",                       //dx<10000      
                        "仙姑",                         //dx<100000
                        "仙女",                         //dx<500000
                        "仙女",                         //dx<1000000
                        "娘娘", 
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "本仙姑",                       //dx<10000      
                        "本仙女",                       //dx<100000
                        "本仙子",                       //dx<500000
                        "本玄女",                       //dx<1000000
                        "本娘娘",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),

/*************************************************
**              妖魔系                          **
*************************************************/
        "盘丝洞"        :       
                ([      
                "rank"  : ({                            //score
                        WHT "【 侍  姑 】" NOR,         //dx<1000
                        WHT "【 童  子 】" NOR,         //dx<10000      
                        WHT "【 巡  使 】" NOR,         //dx<100000
                        WHT "【 $a巡使 】" NOR,         //dx<500000
                        WHT "【 $a巡仙 】" NOR,         //dx<1000000
                        WHT "【 $a大仙 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "姑娘",                         //dx<100000
                        "女侠",                         //dx<500000
                        "侠女",                         //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "小女子",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本姑娘",                       //dx<500000
                        "本仙姑",                       //dx<1000000
                        "本仙子",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
        "火云洞"        :       
                ([      
                "rank"  : ({                            //score
                        HIR "【巡山小妖】" NOR,         //dx<1000
                        HIR "【 飞  妖 】" NOR,         //dx<10000      
                        HIR "【  妖 将 】" NOR,         //dx<100000
                        HIR "【 $a洞主 】" NOR,         //dx<500000
                        HIR "【 $a女主 】" NOR,         //dx<1000000
                        HIR "【 $a女王 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "姑娘",                         //dx<100000
                        "女洞主",                       //dx<500000
                        "侠女",                         //dx<1000000
                        "女大王",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "小女子",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本洞主",                       //dx<500000
                        "本女主",                       //dx<1000000
                        "本女王",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
        "陷空山无底洞"  :       
                ([      
                "rank"  : ({                            //score
                        YEL "【 小  鼠 】" NOR,         //dx<1000
                        YEL "【 鼠  精 】" NOR,         //dx<10000      
                        YEL "【 鼠  妖 】" NOR,         //dx<100000
                        YEL "【 $a玉鼠 】" NOR,         //dx<500000
                        YEL "【 $a鼠王 】" NOR,         //dx<1000000
                        YEL "【 $a鼠仙 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "姑娘",                         //dx<100000
                        "女侠",                         //dx<500000
                        "侠女",                         //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小老鼠",                       //age<25
                        "妖女",                         //age<50
                        "老耗子",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "小女子",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本姑娘",                       //dx<500000
                        "本夫人",                       //dx<1000000
                        "本娘娘",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        "轩辕古墓"      :       
                ([      
                "rank"  : ({                            //score
                        YEL "【 小狐狸 】" NOR,         //dx<1000
                        YEL "【 狐狸精 】" NOR,         //dx<10000      
                        YEL "【 狐  妖 】" NOR,         //dx<100000
                        YEL "【 $a玉面狐狸 】" NOR,             //dx<500000
                        YEL "【 $a狐王 】" NOR,         //dx<1000000
                        YEL "【 $a九尾狐仙 】"NOR,      //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "姑娘",                         //dx<100000
                        "女侠",                         //dx<500000
                        "侠女",                         //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小老鼠",                       //age<25
                        "妖女",                         //age<50
                        "老耗子",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "小女子",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本姑娘",                       //dx<500000
                        "本夫人",                       //dx<1000000
                        "本娘娘",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
        "大雪山"        :       
                ([      
                "rank"  : ({                            //score
                        HIW "【巡山小妖】" NOR,         //dx<1000
                        HIW "【巡 山 妖】" NOR,         //dx<10000      
                        HIW "【 老  妖 】" NOR,         //dx<100000
                        HIW "【 $a老妖 】" NOR,         //dx<500000
                        HIW "【 $a老魔 】" NOR,         //dx<1000000
                        HIW "【 $a魔主 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "姑娘",                         //dx<100000
                        "女侠",                         //dx<500000
                        "女大王",                       //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "小女子",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本姑娘",                       //dx<500000
                        "本座",                         //dx<1000000
                        "本女主",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),

        "乱石山碧波潭"  :       
                ([      
                "rank"  : ({                            //score
                        HIW "【巡山小妖】" NOR,         //dx<1000
                        HIW "【巡 山 妖】" NOR,         //dx<10000      
                        HIW "【 老  妖 】" NOR,         //dx<100000
                        HIW "【 $a老妖 】" NOR,         //dx<500000
                        HIW "【 $a老魔 】" NOR,         //dx<1000000
                        HIW "【 $a魔主 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "姑娘",                         //dx<100000
                        "女侠",                         //dx<500000
                        "女大王",                       //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "小女子",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本姑娘",                       //dx<500000
                        "本座",                         //dx<1000000
                        "本女主",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
        
        "三界山"        :       
                ([      
                "rank"  : ({                            //score
                        BLU "【 小  妖 】" NOR,         //dx<1000
                        BLU "【 小  魔 】" NOR,         //dx<10000      
                        BLU "【 妖  魔 】" NOR,         //dx<100000
                        BLU "【 $a妖将 】" NOR,         //dx<500000
                        BLU "【 $a魔将 】" NOR,         //dx<1000000
                        BLU "【 $a魔神 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "姑娘",                         //dx<100000
                        "女侠",                         //dx<500000
                        "侠女",                         //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小妖精",                       //age<25
                        "妖女",                         //age<50
                        "老妖精",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "小女子",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本姑娘",                       //dx<500000
                        "本魔将",                       //dx<1000000
                        "本魔神",       
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
        "魔界"          :       
                ([      
                "rank"  : ({                            //score
                        HIW "【 下  妖 】" NOR,         //dx<1000
                        HIW "【 中  妖 】" NOR,         //dx<10000      
                        HIW "【 上  妖 】" NOR,         //dx<100000
                        HIW "【$a妖将军】" NOR,         //dx<500000
                        HIW "【 $a妖帅 】" NOR,         //dx<1000000
                        HIW "【 $a魔尊 】"NOR,  //
                        }),
                "respect" : ({
                        "小姑娘",                       //dx<1000
                        "姑娘",                         //dx<10000      
                        "姑娘",                         //dx<100000
                        "女侠",                         //dx<500000
                        "侠女",                         //dx<1000000
                        "女神仙",       
                        }),
                "rude"  : ({
                        "小魔女",                       //age<25
                        "魔女",                         //age<50
                        "老魔女",
                        }),                     
                "self"  : ({
                        "小女子",                       //dx<1000
                        "小女子",                       //dx<10000      
                        "本姑娘",                       //dx<100000
                        "本将军",                       //dx<500000
                        "本帅",                         //dx<1000000
                        "本尊", 
                        }),
                "self_rude"     : ({                    //自鄙称
                        "小女子",                       //dx<1000
                        "奴家",                         //dx<10000      
                        "奴家",                         //dx<100000
                        "妾身",                         //dx<500000
                        "妾身",                         //dx<1000000
                        "老婆子",       
                        }),
                ]),
        
]);

