
public string set_verify_string(object ob);
public void task_verify_string(object ob);
public void task_verify_reward(object ob);
public void task_verify_fail(object ob);
public string vr_room_set_verify_string(object ob);
public void vr_room_verify_string(object ob);
public void vr_room_verify_reward(object ob);
public void vr_room_verify_fail(object ob);

#define VERIFY_REWARD_GOLD	3000		// 验证奖励：金钱
#define VERIFY_REWARD_EXP	3000		// 验证奖励：经验
#define VERIFY_REWARD_POT	3000		// 验证奖励：潜能

string *all_symbols = ({
	"A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z",
	"a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z",
	"1","2","3","4","5","6","7","8","9",
	"~","!",",",".","?","@","#","$","^","&","*","/","(",")","-","+","[","]",":",";","|","`"
});
string *all_words = ({
//	"想","群","英","梦","回","西","游","记","热","爱","小","雪","初","晴","验","证","奖","励"
"Ａ","Ｂ","Ｃ","Ｄ","Ｅ","Ｆ","Ｇ","Ｈ","Ｉ","Ｊ","Ｋ","Ｌ","Ｍ","Ｎ","Ｏ","Ｐ","Ｑ","Ｒ","Ｓ","Ｔ","Ｕ","Ｖ","Ｗ","Ｘ","Ｙ","Ｚ",
"ａ","ｂ","ｃ","ｄ","ｅ","ｆ","ｇ","ｈ","ｉ","ｊ","ｋ","ｌ","ｍ","ｎ","ｏ","ｐ","ｑ","ｒ","ｓ","ｔ","ｕ","ｖ","ｗ","ｘ","ｙ","ｚ",
"樾",
"橱",
"橛",
"橇",
"樵",
"檎",
"橹",
"樽",
"橼",
"樨",
"橙",
"橘",
"墼",
"整",
"橐",
"融",
"翮",
"瓢",
"醛",
"醐",
"醍",
"醒",
"醚",
"醑",
"磺",
"磲",
"赝",
"飙",
"霖",
"霏",
"霓",
"霍",
"霎",
"殪",
"錾",
"辙",
"辚",
"臻",
"冀",
"鹾",
"餐",
"遽",
"氅",
"瞥",
"瞟",
"瞠",
"瞰",
"嚆",
"噤",
"暾",
"蹀",
"踹",
"踵",
"踽",
"嘴",
"踱",
"蹄",
"蹉",
"蹁",
"蹂",
"螓",
"螨",
"蟒",
"蟆",
"螈",
"螅",
"螟",
"螭",
"螗",
"螃",
"噱",
"器",
"噪",
"噬",
"噫",
"噻",
"噼",
"罹",
"圜",
"鹦",
"赠",
"默",
"黔",
"镖",
"镗",
"镘",
"镙",
"镛",
"镜",
"镝",
"镞",
"镟",
"氇",
"氆",
"赞",
"憩",
"穑",
"穆",
"篝",
"篚",
"篥",
"篮",
"篡",
"篦",
"篪",
"篷",
"篙",
"篱",
"盥",
"儒",
"劓",
"鼽",
"翱",
"魉",
"魈",
"邀",
"徼",
"衡",
"歙",
"憷",
"懒",
"憾",
"懈",
"懔",
"膨",
"膪",
"膳",
"膦",
"雕",
"鲭",
"鲮",
"鲰",
"鲱",
"鲲",
"鲳",
"鲴",
"鲵",
"鲶",
"鲷",
"鲸",
"鲻",
"鲺",
"獭",
"獬",
"飚",
"邂",
"憝",
"鹧",
"磨",
"廨",
"癀",
"瘭",
"瘰",
"廪",
"瘿",
"瘵",
"瘴",
"癃",
"瘾",
"瘸",
"瘳",
"斓",
"凝",
"麇",
"麈",
"辨",
"辩",
"嬴",
"壅",
"羲",
"糙",
"糗",
"糖",
"糕",
"甑",
"燎",
"燠",
"燔",
"燃",
"燧",
"褰",
"寰",
"窿",
"濑",
"濒",
"濉",
"潞",
"澧",
"澡",
"激",
"澹",
"澶",
"濂",
"黉",
"褶",
"禧",
"嬗",
"缰",
"缱",
"缲",
"缳",
"缴",
"壁",
"避",
"嬖",
"犟",
"隰",
"鹨",
"颡",
"璨",
"璩",
"璐",
"戴",
"螫",
"擤",
"觳",
"壕",
"擦",
"罄",
"擢",
"藉",
"薹",
"鞠",
"藏",
"薷",
"薰",
"藐",
"藓",
"藁",
"檬",
"檑",
"檄",
"檐",
"檩",
"檀",
"懋",
"醢",
"醣",
"翳",
"礁",
"礅",
"磷",
"磴",
"鹩",
"霜",
"霞",
"龋",
"龌",
"壑",
"豳",
"黻",
"嶷",
"瞧",
"瞬",
"瞳",
"瞵",
"瞩",
"瞪",
"嚏",
"曙",
"嚅",
"蹑",
"蹒",
"蹋",
"蹈",
"蹊",
"蟥",
"螬",
"螵",
"疃",
"螳",
"螺",
"蟋",
"蟓",
"蟑",
"蟀",
"嬲",
"嚎",
"嚓",
"羁",
"罾",
"赡",
"黜",
"黝",
"髁",
"髀",
"镡",
"镢",
"镣",
"镤",
"镥",
"镦",
"镧",
"镨",
"镩",
"镪",
"镫",
"罅",
"穗",
"黏",
"魏",
"簧",
"簌",
"篾",
"篼",
"簏",
"簇",
"簖",
"簋",
"繁",
"黛",
"鼢",
"儡",
"鹪",
"鼾",
"皤",
"魍",
"徽",
"艚",
"龠",
"懦",
"爵",
"繇",
"貘",
"邈",
"貔",
"臌",
"朦",
"臊",
"膻",
"臁",
"臆",
"臃",
"鲼",
"鲽",
"鳃",
"鳄",
"鳅",
"鳆",
"鳇",
"鳊",
"鳋",
"獯",
"螽",
"鹫",
"襄",
"糜",
"縻",
"膺",
"癍",
"癌",
"麋",
"辫",
"赢",
"糟",
"糠",
"馘",
"燥",
"燮",
"豁",
"蹇",
"謇",
"邃",
"懑",
"濡",
"濮",
"濞",
"濠",
"濯",
"襁",
"嬷",
"臀",
"檗",
"甓",
"臂",
"擘",
"孺",
"隳",
"翼",
"蟊",
"鹬",
"鍪",
"骤",
"鏊",
"鳌",
"鬈",
"鬃",
"瞽",
"謦",
"藕",
"鞯",
"鞭",
"鞫",
"鞣",
"藜",
"藤",
"藩",
"檫",
"覆",
"醪",
"蹙",
"礞",
"礓",
"燹",
"餮",
"蹩",
"瞿",
"瞻",
"曛",
"颢",
"曜",
"躇",
"蹦",
"鹭",
"蟛",
"蟪",
"蟠",
"蟮",
"嚣",
"黠",
"黟",
"髅",
"髂",
"镬",
"镭",
"镯",
"镰",
"镱",
"馥",
"簟",
"簪",
"簦",
"鼬",
"雠",
"艟",
"懵",
"翻",
"鳍",
"鳎",
"鳏",
"鳐",
"鹱",
"鹰",
"癞",
"癔",
"癜",
"癖",
"糨",
"冁",
"瀑",
"鎏",
"襟",
"邋",
"彝",
"璧",
"戳",
"鬏",
"攉",
"攒",
"鞲",
"鞴",
"藿",
"蘧",
"孽",
"蘅",
"警",
"蘑",
"藻",
"麓",
"攀",
"麴",
"醭",
"醮",
"醯",
"礤",
"酃",
"霪",
"霭",
"黼",
"鳖",
"巅",
"曝",
"嚯",
"蹰",
"蹶",
"蹼",
"蹯",
"蹴",
"蹲",
"蹭",
"蹿",
"蹬",
"蠖",
"蠓",
"蟾",
"蠊",
"黢",
"髋",
"髌",
"镲",
"籀",
"簸",
"籁",
"簿",
"鳘",
"魑",
"艨",
"鼗",
"鳓",
"鳔",
"鳕",
"鳗",
"鳙",
"蟹",
"颤",
"靡",
"癣",
"麒",
"鏖",
"瓣",
"蠃",
"羸",
"羹",
"爆",
"瀚",
"瀣",
"瀛",
"襦",
"谶",
"缵",
"襞",
"疆",
"骥",
"瓒",
"鬓",
"攘",
"壤",
"馨",
"蘩",
"蘖",
"醵",
"醴",
"霰",
"颥",
"酆",
"耀",
"巍",
"矍",
"曦",
"躁",
"躅",
"蠛",
"蠕",
"鼍",
"嚼",
"嚷",
"黩",
"黥",
"黪",
"镳",
"黧",
"籍",
"纂",
"璺",
"鼯",
"鳜",
"鳝",
"鳞",
"鳟",
"獾",
"魔",
"糯",
"灌",
"瀹",
"瀵",
"孀",
"譬",
"骧",
"蠢",
"鼙",
"醺",
"礴",
"霸",
"露",
"霹",
"颦",
"曩",
"躏",
"黯",
"髓",
"鳢",
"癫",
"麝",
"赣",
"夔",
"爝",
"灏",
"禳",
"蠡",
"鐾",
"羼",
"耱",
"懿",
"蘸",
"鹳",
"蘼",
"囊",
"霾",
"氍",
"饕",
"躔",
"躐",
"髑",
"镶",
"穰",
"瓤",
"饔",
"鬻",
"鬟",
"趱",
"攫",
"攥",
"颧",
"躜",
"罐",
"鼹",
"鼷",
"齄",
"癯",
"麟",
"蠲",
"纛",
"矗",
"蠹",
"躞",
"衢",
"鑫",
"灞",
"襻",
"鬣",
"攮",
"囔",
"馕",
"戆",
"蠼"
});

mapping verify_strings_balnk = ([
	"1"	:
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n"
" \n",

	"2"	:
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n"
"  \n",

	"3"	:
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n"
"   \n",

	"4"	:
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
"    \n"
]);

mapping verify_strings_symbol = ([
	"A"	:
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n",

	"B"	:
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n",

	"C"	:
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n",

	"D"	:
"幻幻幻幻幻幻幻幻幻幻幻幻            \n"
"幻幻幻幻幻幻幻幻幻幻幻幻            \n"
"幻幻幻幻幻幻幻幻幻幻幻幻            \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻            \n"
"幻幻幻幻幻幻幻幻幻幻幻幻            \n"
"幻幻幻幻幻幻幻幻幻幻幻幻            \n",

	"E"	:
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n",

	"F"	:
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n",

	"G"	:
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻      幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻      幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n",

	"H"	:
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n",

	"I"	:
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n",

	"J"	:
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n",

	"K"	:

"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻            \n"
"幻幻幻幻幻幻幻幻幻幻幻幻            \n"
"幻幻幻幻幻幻幻幻幻幻幻幻            \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n",

	"L"	:

"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n",

	"M"	:
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻幻幻幻      幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻      幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻      幻幻幻幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n",

	"N"	:

"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻幻幻幻            幻幻幻幻\n"
"幻幻幻幻幻幻幻幻            幻幻幻幻\n"
"幻幻幻幻幻幻幻幻            幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻      幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻      幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻            幻幻幻幻幻幻幻\n"
"幻幻幻幻幻            幻幻幻幻幻幻幻\n"
"幻幻幻幻幻            幻幻幻幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n"
"幻幻幻幻幻                  幻幻幻幻\n",

	"P"	:
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n",

	"Q"	:
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n",

	"R"	:
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n",

	"S"	:
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n",

	"T"	:
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n",

	"U"	:
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n",

	"V"	:
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n",

	"X"	:
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻      幻幻幻      \n"
"      幻幻幻幻幻幻      幻幻幻      \n"
"      幻幻幻幻幻幻      幻幻幻      \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"      幻幻幻      幻幻幻幻幻幻      \n"
"      幻幻幻      幻幻幻幻幻幻      \n"
"      幻幻幻      幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n",

	"Y"	:
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n",

	"1"	:
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n",

	"3"	:
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"            幻幻幻幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻幻幻幻      \n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n",

	"4"	:
"      幻幻幻幻幻                    \n"
"      幻幻幻幻幻                    \n"
"      幻幻幻幻幻                    \n"
"      幻幻幻幻幻                    \n"
"      幻幻幻幻幻                    \n"
"      幻幻幻幻幻                    \n"
"      幻幻幻幻幻      幻幻幻幻幻    \n"
"      幻幻幻幻幻      幻幻幻幻幻    \n"
"      幻幻幻幻幻      幻幻幻幻幻    \n"
"      幻幻幻幻幻      幻幻幻幻幻    \n"
"      幻幻幻幻幻      幻幻幻幻幻    \n"
"      幻幻幻幻幻      幻幻幻幻幻    \n"
"      幻幻幻幻幻      幻幻幻幻幻    \n"
"      幻幻幻幻幻      幻幻幻幻幻    \n"
"      幻幻幻幻幻      幻幻幻幻幻    \n"
"幻幻幻幻幻            幻幻幻幻幻    \n"
"幻幻幻幻幻            幻幻幻幻幻    \n"
"幻幻幻幻幻            幻幻幻幻幻    \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"                      幻幻幻幻幻    \n"
"                      幻幻幻幻幻    \n"
"                      幻幻幻幻幻    \n"
"                      幻幻幻幻幻    \n"
"                      幻幻幻幻幻    \n"
"                      幻幻幻幻幻    \n",

	"5"	:
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻                        \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻            \n"
"幻幻幻幻幻幻幻幻幻幻幻幻            \n"
"幻幻幻幻幻幻幻幻幻幻幻幻            \n",

	"6"	:
"            幻幻幻幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n",

	"7"	:
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                        幻幻幻幻幻幻\n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n"
"      幻幻幻幻幻幻                  \n",

	"8"	:
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻      幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻      幻幻幻幻幻幻\n"
"幻幻幻幻幻幻幻幻幻      幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻      幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻      幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻      幻幻幻幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n",

	"9"	:
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"幻幻幻幻幻幻            幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"      幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻      \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"            幻幻幻幻幻幻            \n"
"      幻幻幻幻幻幻幻幻幻            \n"
"      幻幻幻幻幻幻幻幻幻            \n"
"      幻幻幻幻幻幻幻幻幻            \n",

/*
	"C"	:
*/
]);

mapping verify_strings_word = ([
	"爱"	:
"                                        幻幻幻幻幻幻幻幻    \n"
"                          幻幻幻幻幻幻幻幻幻                \n"
"          幻幻幻幻幻幻幻幻  幻                幻幻          \n"
"                幻            幻              幻幻幻        \n"
"                  幻          幻幻            幻幻          \n"
"                  幻幻          幻幻        幻幻            \n"
"                    幻幻        幻幻      幻幻              \n"
"                    幻                    幻          幻    \n"
"        幻                                          幻幻幻  \n"
"        幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻  \n"
"        幻                幻                        幻      \n"
"      幻幻                幻幻                    幻        \n"
"      幻                  幻                    幻          \n"
"                        幻幻                    幻幻        \n"
"          幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻            \n"
"                        幻幻                                \n"
"                        幻                    幻            \n"
"                      幻幻幻幻幻幻幻幻幻幻幻幻幻幻          \n"
"                      幻幻幻                幻幻            \n"
"                    幻幻    幻            幻幻              \n"
"                    幻        幻        幻幻                \n"
"                  幻幻        幻幻    幻幻                  \n"
"                幻幻            幻幻幻幻                    \n"
"              幻幻                幻幻幻                    \n"
"            幻幻              幻幻幻  幻幻幻                \n"
"          幻              幻幻幻          幻幻幻幻幻幻幻    \n"
"        幻            幻幻幻                  幻幻幻幻幻幻  \n"
"      幻      幻幻幻幻                                幻    \n",

	"幻"	:
"                幻幻                                        \n"
"                幻幻幻                                      \n"
"              幻幻幻                                        \n"
"              幻幻            幻幻幻幻幻幻幻幻幻幻幻幻幻幻  \n"
"            幻幻                                      幻幻  \n"
"            幻幻                                      幻幻  \n"
"          幻幻              幻幻                      幻幻  \n"
"          幻幻            幻幻幻                      幻幻  \n"
"        幻幻              幻幻                        幻幻  \n"
"        幻              幻幻                          幻幻  \n"
"      幻                幻幻                          幻幻  \n"
"      幻              幻幻                            幻幻  \n"
"  幻幻幻幻幻幻幻幻幻幻幻                              幻幻  \n"
"    幻幻幻          幻幻                              幻幻  \n"
"    幻            幻幻                                幻幻  \n"
"                幻幻                                  幻幻  \n"
"                幻                                    幻    \n"
"              幻幻        幻                          幻    \n"
"            幻幻          幻幻                        幻    \n"
"            幻              幻幻                      幻    \n"
"          幻                  幻幻                  幻幻    \n"
"        幻                    幻幻                  幻幻    \n"
"      幻                幻幻幻幻幻幻                幻幻    \n"
"    幻幻幻幻幻幻幻幻幻幻        幻幻                幻幻    \n"
"    幻幻幻幻                    幻幻              幻幻      \n"
"                                        幻幻幻幻幻幻幻      \n"
"                                            幻幻幻幻        \n"
"                                              幻幻          \n",

	"想"	:
"                幻幻                                        \n"
"                幻幻            幻幻                幻幻    \n"
"                幻幻            幻幻幻幻幻幻幻幻幻幻幻幻    \n"
"                幻幻            幻幻                幻幻    \n"
"                幻幻    幻幻    幻幻                幻幻    \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻  幻幻                幻幻    \n"
"              幻幻幻            幻幻幻幻幻幻幻幻幻幻幻幻    \n"
"              幻幻幻            幻幻                幻幻    \n"
"            幻幻幻幻            幻幻                幻幻    \n"
"            幻幻幻幻幻幻        幻幻                幻幻    \n"
"          幻幻  幻幻  幻幻      幻幻幻幻幻幻幻幻幻幻幻幻    \n"
"          幻    幻幻    幻幻    幻幻                幻幻    \n"
"        幻      幻幻    幻幻    幻幻                幻幻    \n"
"      幻        幻幻            幻幻                幻幻    \n"
"      幻        幻幻            幻幻                幻幻    \n"
"    幻          幻幻            幻幻幻幻幻幻幻幻幻幻幻幻    \n"
"  幻            幻幻            幻幻                幻幻    \n"
"                幻幻                                        \n"
"                                                            \n"
"                    幻幻      幻幻              幻幻幻      \n"
"                    幻幻        幻幻幻              幻幻    \n"
"          幻        幻幻          幻幻      幻        幻幻  \n"
"          幻        幻幻          幻幻      幻        幻幻幻\n"
"        幻幻        幻幻                    幻          幻幻\n"
"      幻幻幻        幻幻                    幻          幻  \n"
"    幻幻幻          幻幻                    幻幻            \n"
"      幻            幻幻幻幻幻幻幻幻幻幻幻幻幻幻            \n",

	"群"	:
"                                  幻              幻幻幻    \n"
"                          幻幻      幻幻          幻幻      \n"
"        幻幻幻幻幻幻幻幻幻幻幻      幻幻幻        幻        \n"
"              幻幻        幻          幻幻      幻幻        \n"
"              幻幻        幻          幻幻      幻          \n"
"              幻幻        幻            幻      幻      幻  \n"
"              幻幻        幻  幻  幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"    幻幻幻幻幻幻幻幻幻幻幻幻幻  幻          幻              \n"
"              幻幻        幻                幻              \n"
"              幻幻        幻                幻              \n"
"              幻          幻                幻              \n"
"              幻          幻                幻        幻    \n"
"      幻幻幻幻幻幻幻幻幻幻幻      幻幻幻幻幻幻幻幻幻幻幻幻  \n"
"            幻幻          幻                幻              \n"
"            幻幻                            幻              \n"
"            幻                              幻              \n"
"          幻幻幻          幻幻              幻              \n"
"          幻幻幻幻幻幻幻幻幻幻              幻          幻  \n"
"        幻幻幻幻          幻  幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"        幻  幻幻          幻                幻              \n"
"      幻    幻幻          幻                幻              \n"
"    幻      幻幻          幻                幻              \n"
"  幻        幻幻          幻                幻              \n"
"            幻幻          幻                幻              \n"
"            幻幻          幻                幻              \n"
"            幻幻幻幻幻幻幻幻                幻              \n"
"            幻幻                            幻              \n"
"            幻                              幻              \n",

	"英"	:
"                      幻幻              幻幻幻              \n"
"                      幻                幻            幻    \n"
"                      幻                幻          幻幻幻  \n"
"    幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻        \n"
"                      幻                幻                  \n"
"                      幻                幻                  \n"
"                      幻      幻幻      幻                  \n"
"                              幻幻                          \n"
"                              幻幻                          \n"
"              幻              幻幻            幻幻          \n"
"              幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻        \n"
"              幻              幻幻            幻幻          \n"
"              幻              幻幻            幻幻          \n"
"              幻              幻              幻幻          \n"
"              幻              幻              幻幻          \n"
"              幻            幻幻              幻幻          \n"
"              幻            幻幻              幻幻    幻幻  \n"
"              幻            幻幻              幻幻  幻幻幻幻\n"
"    幻幻幻幻幻  幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻    幻        \n"
"                          幻幻    幻                        \n"
"                          幻幻      幻                      \n"
"                        幻幻          幻                    \n"
"                      幻幻              幻幻                \n"
"                    幻幻                  幻幻              \n"
"                  幻幻                      幻幻幻          \n"
"                幻                            幻幻幻幻幻幻  \n"
"            幻幻                                  幻幻幻幻  \n"
"      幻幻幻                                          幻    \n",

	"梦"	:
"                  幻幻幻                幻幻幻              \n"
"                  幻幻                  幻幻                \n"
"                  幻幻                  幻幻                \n"
"                  幻幻    幻            幻幻          幻    \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻  幻幻幻幻幻幻幻幻幻幻幻幻幻  \n"
"                  幻幻        幻        幻幻幻              \n"
"                幻幻幻                幻幻幻幻              \n"
"                幻幻幻幻幻幻          幻幻幻  幻            \n"
"              幻幻幻幻  幻幻幻      幻幻幻幻  幻幻          \n"
"            幻幻  幻幻    幻幻    幻幻  幻幻    幻幻幻      \n"
"            幻    幻幻          幻幻    幻幻      幻幻幻    \n"
"          幻      幻幻        幻幻      幻幻        幻幻幻幻\n"
"        幻        幻幻      幻          幻幻          幻    \n"
"      幻          幻幻    幻            幻幻                \n"
"    幻            幻幻  幻幻幻          幻                  \n"
"                      幻幻幻                    幻          \n"
"                      幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻        \n"
"                    幻幻                      幻幻          \n"
"                  幻幻                      幻幻            \n"
"                幻幻  幻                  幻幻              \n"
"              幻        幻幻            幻幻                \n"
"          幻幻          幻幻幻        幻幻                  \n"
"        幻                幻幻    幻幻幻                    \n"
"                          幻    幻幻幻                      \n"
"                            幻幻幻                          \n"
"                        幻幻幻                              \n"
"                  幻幻幻                                    \n"
"      幻幻幻幻幻幻                                          \n",

	"回"	:
"        幻                                          幻幻幻  \n"
"        幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻  幻    \n"
"        幻                                            幻    \n"
"        幻                                            幻    \n"
"        幻                                            幻    \n"
"        幻                                            幻    \n"
"        幻          幻                  幻            幻    \n"
"        幻          幻幻幻幻幻幻幻幻幻幻幻幻          幻    \n"
"        幻          幻幻                幻幻          幻    \n"
"        幻          幻幻                幻幻          幻    \n"
"        幻          幻幻                幻幻          幻    \n"
"        幻          幻幻                幻幻          幻    \n"
"        幻          幻幻                幻幻          幻    \n"
"        幻          幻幻                幻幻          幻    \n"
"        幻          幻幻                幻幻          幻    \n"
"        幻          幻幻                幻幻          幻    \n"
"        幻          幻幻幻幻幻幻幻幻幻幻幻幻          幻    \n"
"        幻          幻幻                幻幻          幻    \n"
"        幻          幻幻                              幻    \n"
"        幻                                            幻    \n"
"        幻                                            幻    \n"
"        幻                                            幻    \n"
"        幻                                            幻    \n"
"        幻                                            幻    \n"
"        幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻    \n"
"        幻                                            幻    \n"
"        幻                                            幻    \n"
"        幻                                          幻      \n",

	"西"	:
"                                                      幻    \n"
"                                                    幻幻幻  \n"
"    幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"                        幻幻        幻幻                    \n"
"                        幻幻        幻幻                    \n"
"                        幻幻        幻幻                    \n"
"                        幻幻        幻幻                    \n"
"                        幻幻        幻幻            幻      \n"
"          幻            幻幻        幻幻          幻幻幻    \n"
"          幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻  幻幻    \n"
"          幻            幻幻        幻幻            幻      \n"
"          幻            幻幻        幻幻            幻      \n"
"          幻            幻          幻幻            幻      \n"
"          幻            幻          幻幻            幻      \n"
"          幻          幻幻          幻幻            幻      \n"
"          幻          幻幻          幻幻            幻      \n"
"          幻          幻            幻幻            幻      \n"
"          幻        幻幻            幻幻            幻      \n"
"          幻        幻                幻幻幻幻幻幻  幻      \n"
"          幻      幻                                幻      \n"
"          幻    幻                                  幻      \n"
"          幻  幻                                    幻      \n"
"          幻                                        幻      \n"
"          幻                                        幻      \n"
"          幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"          幻                                        幻      \n"
"          幻                                        幻      \n"
"                                                    幻      \n",

	"游"	:
"        幻幻            幻                幻幻幻            \n"
"          幻幻          幻幻幻            幻幻              \n"
"            幻幻          幻幻          幻幻                \n"
"            幻幻          幻幻          幻幻                \n"
"              幻                        幻            幻幻  \n"
"                                幻    幻  幻幻幻幻幻幻      \n"
"                  幻幻幻幻幻幻幻幻幻  幻                    \n"
"  幻幻          幻      幻          幻                      \n"
"    幻幻        幻      幻        幻                  幻幻  \n"
"      幻幻    幻        幻        幻    幻幻幻幻幻幻幻幻幻幻\n"
"      幻幻    幻        幻      幻                  幻      \n"
"        幻    幻      幻幻      幻幻              幻        \n"
"              幻      幻幻幻幻幻幻幻          幻幻          \n"
"            幻        幻幻      幻幻          幻幻幻        \n"
"            幻        幻幻      幻幻          幻幻          \n"
"            幻        幻幻      幻幻          幻幻          \n"
"          幻幻        幻        幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"          幻          幻        幻            幻幻          \n"
"  幻幻幻幻幻        幻幻        幻            幻幻          \n"
"      幻幻幻        幻幻        幻            幻幻          \n"
"        幻幻        幻        幻幻            幻幻          \n"
"        幻幻      幻幻        幻幻            幻幻          \n"
"        幻幻      幻幻        幻幻            幻幻          \n"
"      幻幻幻    幻幻          幻幻            幻幻          \n"
"      幻幻幻    幻    幻    幻幻              幻幻          \n"
"        幻幻  幻        幻幻幻幻        幻幻幻幻幻          \n"
"            幻            幻幻              幻幻幻          \n"
"          幻              幻                  幻            \n",

	"唐"	:
"                                幻幻                        \n"
"                                  幻幻                      \n"
"          幻                      幻                幻幻    \n"
"          幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻  \n"
"          幻幻                  幻幻幻                      \n"
"          幻幻                  幻幻                        \n"
"          幻幻                  幻幻            幻幻        \n"
"          幻幻    幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻        \n"
"          幻幻                  幻幻            幻幻        \n"
"          幻幻                  幻幻            幻幻    幻  \n"
"          幻幻                  幻幻            幻幻  幻幻幻\n"
"          幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"          幻幻                  幻幻            幻幻        \n"
"          幻幻                  幻幻            幻幻        \n"
"          幻幻                  幻幻            幻幻        \n"
"          幻幻    幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻        \n"
"          幻幻                  幻幻            幻          \n"
"          幻幻                  幻幻                        \n"
"          幻                    幻              幻          \n"
"          幻        幻幻                        幻幻        \n"
"        幻幻        幻  幻幻幻幻幻幻幻幻幻幻幻幻幻幻        \n"
"        幻幻        幻                          幻幻        \n"
"        幻          幻                          幻幻        \n"
"      幻幻          幻                          幻幻        \n"
"      幻            幻                          幻幻        \n"
"    幻              幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻        \n"
"    幻              幻                          幻幻        \n"
"  幻                幻                          幻          \n",

	"僧"	:
"                幻幻        幻              幻幻幻          \n"
"                幻幻幻        幻幻          幻幻            \n"
"                幻幻          幻幻幻        幻              \n"
"              幻幻              幻幻      幻                \n"
"              幻幻              幻        幻                \n"
"              幻      幻幻              幻          幻幻    \n"
"            幻幻      幻幻幻幻幻幻幻幻幻  幻幻幻幻幻幻幻    \n"
"            幻        幻幻            幻      幻    幻幻    \n"
"          幻幻幻      幻幻  幻幻      幻      幻幻  幻幻    \n"
"          幻幻幻      幻幻    幻幻    幻      幻  幻幻幻    \n"
"        幻幻幻幻      幻幻    幻幻    幻    幻      幻幻    \n"
"        幻  幻幻      幻幻      幻    幻  幻        幻幻    \n"
"      幻    幻幻      幻幻            幻  幻        幻幻    \n"
"      幻    幻幻      幻幻            幻            幻幻    \n"
"    幻      幻幻      幻幻幻幻幻幻幻幻  幻幻幻幻幻幻幻幻    \n"
"            幻幻      幻幻                          幻      \n"
"            幻幻        幻                                  \n"
"            幻幻          幻幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"            幻幻          幻幻                  幻幻        \n"
"            幻幻          幻幻                  幻幻        \n"
"            幻幻          幻幻                  幻幻        \n"
"            幻幻          幻幻                  幻幻        \n"
"            幻幻          幻幻幻幻幻幻幻幻幻幻幻幻幻        \n"
"            幻幻          幻幻                  幻幻        \n"
"            幻幻          幻幻                  幻幻        \n"
"            幻幻          幻幻                  幻幻        \n"
"            幻幻          幻幻幻幻幻幻幻幻幻幻幻幻幻        \n"
"            幻幻          幻幻                  幻幻        \n",

	"孙"	:
"                                          幻幻              \n"
"                        幻                幻幻              \n"
"      幻幻幻幻幻幻幻幻幻幻幻              幻幻              \n"
"                      幻幻幻              幻幻              \n"
"                      幻                  幻幻              \n"
"                    幻幻                  幻幻              \n"
"                    幻                    幻幻              \n"
"                幻幻            幻        幻幻  幻          \n"
"                幻幻            幻幻幻    幻幻  幻          \n"
"                幻幻            幻幻      幻幻    幻        \n"
"                幻幻        幻  幻幻      幻幻    幻        \n"
"                幻幻    幻幻    幻幻      幻幻      幻      \n"
"                幻幻幻幻      幻幻        幻幻      幻      \n"
"              幻幻幻          幻幻        幻幻      幻幻    \n"
"          幻幻幻幻幻          幻          幻幻        幻    \n"
"      幻幻幻    幻幻          幻          幻幻        幻幻  \n"
"    幻幻幻      幻幻        幻幻          幻幻        幻幻  \n"
"      幻        幻幻        幻            幻幻        幻幻幻\n"
"                幻幻      幻幻            幻幻          幻幻\n"
"                幻幻      幻              幻幻          幻幻\n"
"                幻幻    幻                幻幻          幻幻\n"
"                幻幻    幻                幻幻          幻幻\n"
"                幻幻  幻                  幻幻              \n"
"                幻幻                      幻幻              \n"
"                幻幻                      幻幻              \n"
"          幻幻幻幻幻            幻幻幻幻幻幻幻              \n"
"            幻幻幻                    幻幻幻                \n"
"              幻                        幻                  \n",

	"悟"	:
"            幻幻幻                                  幻幻    \n"
"            幻幻        幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻  \n"
"            幻幻                    幻                      \n"
"            幻幻                  幻幻                      \n"
"            幻幻                  幻幻                      \n"
"            幻幻幻幻              幻幻                      \n"
"      幻    幻幻  幻幻            幻幻          幻幻        \n"
"      幻    幻幻    幻幻幻幻幻幻幻幻  幻幻幻幻幻幻幻幻      \n"
"      幻    幻幻    幻幻          幻            幻幻        \n"
"      幻    幻幻                幻幻            幻幻        \n"
"    幻幻    幻幻                幻幻            幻幻        \n"
"    幻幻    幻幻                幻幻            幻幻        \n"
"    幻      幻幻                幻幻            幻幻    幻幻\n"
"            幻幻    幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"            幻幻                                            \n"
"            幻幻                                            \n"
"            幻幻                                  幻        \n"
"            幻幻            幻幻                幻幻幻      \n"
"            幻幻            幻幻幻幻幻幻幻幻幻幻  幻幻      \n"
"            幻幻            幻幻                  幻        \n"
"            幻幻            幻幻                  幻        \n"
"            幻幻            幻幻                  幻        \n"
"            幻幻            幻幻                  幻        \n"
"            幻幻            幻幻                  幻幻      \n"
"            幻幻            幻幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"            幻幻            幻幻                  幻幻      \n"
"            幻幻            幻幻                  幻幻      \n"
"            幻幻                                            \n",

	"空"	:
"                              幻幻                          \n"
"                              幻幻幻                        \n"
"          幻                    幻幻                        \n"
"          幻                    幻                    幻幻  \n"
"          幻幻幻幻幻幻幻幻幻幻幻  幻幻幻幻幻幻幻幻幻幻幻幻幻\n"
"        幻幻                                          幻    \n"
"        幻幻                                        幻      \n"
"      幻幻幻          幻幻            幻幻        幻        \n"
"                    幻幻幻幻            幻幻幻              \n"
"                  幻幻幻                    幻幻幻幻        \n"
"                幻幻幻                        幻幻幻幻      \n"
"              幻幻                                幻幻幻    \n"
"            幻幻                                    幻幻    \n"
"        幻幻                                幻幻    幻幻    \n"
"      幻        幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻          \n"
"                              幻幻                          \n"
"                              幻幻                          \n"
"                              幻幻                          \n"
"                              幻幻                          \n"
"                              幻幻                          \n"
"                              幻幻                          \n"
"                              幻幻                          \n"
"                              幻幻                          \n"
"                              幻幻                          \n"
"                              幻幻                    幻    \n"
"                              幻幻                  幻幻幻  \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻    幻幻幻幻幻幻幻幻幻        \n",

	"猪"	:
"                    幻              幻幻幻                  \n"
"    幻              幻幻            幻幻                    \n"
"      幻幻        幻幻              幻幻            幻幻    \n"
"          幻      幻                幻幻    幻幻    幻幻幻  \n"
"            幻  幻幻                幻幻  幻幻幻幻幻幻幻    \n"
"            幻幻幻        幻幻幻幻幻幻幻幻        幻幻      \n"
"            幻幻幻                  幻幻        幻幻        \n"
"          幻幻幻幻                  幻幻      幻幻          \n"
"        幻幻    幻                  幻幻    幻幻        幻  \n"
"      幻幻      幻幻                幻幻  幻幻        幻幻幻\n"
"    幻          幻幻    幻幻幻幻幻幻    幻幻  幻幻幻幻      \n"
"                幻幻                    幻幻                \n"
"              幻幻幻                  幻幻                  \n"
"              幻  幻                幻幻                    \n"
"            幻幻  幻          幻  幻              幻幻      \n"
"          幻幻    幻          幻幻  幻幻幻幻幻幻幻幻幻幻    \n"
"          幻幻    幻        幻幻                  幻幻      \n"
"        幻幻      幻      幻幻幻                  幻幻      \n"
"      幻幻        幻    幻幻  幻                  幻幻      \n"
"      幻          幻  幻      幻                  幻幻      \n"
"    幻            幻幻        幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"  幻              幻          幻                  幻幻      \n"
"                幻幻          幻                  幻幻      \n"
"                幻幻          幻                  幻幻      \n"
"                幻幻          幻                  幻幻      \n"
"        幻幻幻幻幻            幻幻幻幻幻幻幻幻幻幻幻幻      \n"
"          幻幻幻幻            幻                  幻幻      \n"
"            幻幻              幻                  幻幻      \n",

	"八"	:
"                                    幻                      \n"
"                                    幻幻                    \n"
"                      幻幻          幻幻                    \n"
"                      幻幻幻        幻幻                    \n"
"                      幻幻          幻幻                    \n"
"                      幻幻            幻                    \n"
"                      幻幻            幻                    \n"
"                      幻幻            幻                    \n"
"                      幻幻            幻                    \n"
"                      幻幻            幻                    \n"
"                      幻              幻幻                  \n"
"                    幻幻              幻幻                  \n"
"                    幻幻                幻                  \n"
"                    幻幻                幻                  \n"
"                    幻幻                幻幻                \n"
"                  幻幻                    幻                \n"
"                  幻幻                    幻                \n"
"                  幻幻                    幻幻              \n"
"                幻幻                        幻              \n"
"                幻幻                        幻幻            \n"
"                幻                            幻幻          \n"
"              幻幻                            幻幻          \n"
"            幻幻                                幻幻        \n"
"            幻                                    幻幻幻    \n"
"          幻                                      幻幻幻幻  \n"
"        幻                                          幻幻幻幻\n"
"      幻                                              幻    \n"
"    幻                                                      \n",

	"戒"	:
"                                    幻幻      幻幻          \n"
"                                    幻幻        幻幻        \n"
"                                    幻幻        幻幻幻      \n"
"                                    幻幻          幻        \n"
"                                    幻幻              幻    \n"
"                                    幻幻            幻幻幻  \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻        \n"
"                                    幻幻                    \n"
"              幻幻      幻幻        幻幻                    \n"
"              幻        幻幻        幻幻          幻        \n"
"              幻        幻幻        幻幻          幻幻      \n"
"              幻        幻幻        幻幻          幻幻      \n"
"              幻        幻幻          幻        幻幻        \n"
"              幻        幻幻    幻幻  幻幻      幻幻        \n"
"      幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻幻    幻幻          \n"
"              幻        幻幻          幻幻    幻幻          \n"
"              幻        幻幻          幻幻    幻            \n"
"            幻幻        幻幻            幻幻幻幻            \n"
"            幻幻        幻幻            幻幻幻              \n"
"            幻幻        幻幻            幻幻幻              \n"
"            幻          幻幻            幻幻幻            幻\n"
"          幻幻          幻幻          幻幻幻幻幻          幻\n"
"          幻            幻幻        幻幻幻  幻幻幻        幻\n"
"          幻            幻幻      幻幻        幻幻幻    幻幻\n"
"        幻              幻      幻幻            幻幻幻  幻幻\n"
"      幻                    幻幻幻                幻幻幻幻幻\n"
"    幻                    幻幻                      幻幻幻幻\n"
"    幻                                                  幻幻\n",

	"沙"	:
"        幻                            幻幻幻                \n"
"          幻幻                        幻幻                  \n"
"            幻幻                      幻幻                  \n"
"            幻幻幻                    幻幻                  \n"
"              幻幻    幻              幻幻                  \n"
"              幻      幻              幻幻    幻            \n"
"                    幻      幻幻      幻幻      幻幻        \n"
"                    幻      幻幻幻    幻幻          幻幻    \n"
"    幻幻            幻    幻幻幻      幻幻          幻幻幻  \n"
"      幻幻        幻      幻幻        幻幻            幻幻幻\n"
"        幻幻      幻    幻幻          幻幻              幻幻\n"
"        幻幻    幻      幻            幻幻                幻\n"
"        幻幻    幻    幻幻            幻幻                  \n"
"                幻    幻              幻幻                  \n"
"              幻    幻幻              幻幻        幻        \n"
"              幻    幻                幻幻        幻幻      \n"
"            幻幻  幻                  幻幻      幻幻幻幻    \n"
"            幻                        幻幻    幻幻幻        \n"
"          幻幻                        幻    幻幻幻          \n"
"    幻幻幻幻幻                              幻幻            \n"
"        幻幻                            幻幻幻              \n"
"          幻                          幻幻幻                \n"
"          幻                        幻幻幻                  \n"
"        幻幻                      幻幻                      \n"
"        幻幻                  幻幻幻                        \n"
"        幻幻              幻幻幻                            \n"
"          幻          幻幻幻                                \n"
"                幻幻幻                                      \n",

]);