// Created by waiwai@2001/03/23

nosave string *nature_name = ({ 
"网络监控", "调试精灵", "魂魄精灵", "天神之眼", "错误报告", "天籁", "系统信息", "神界传音", "水陆大会",
"谣言惑众", "顺风耳", "千里眼", "摊贩叫卖", "潭际飞梭", "频道精灵", "春之絮语", "夏之物语", "秋之思语",
"屠人大赛", "谈天说地", "大罗仙", "异域佛祖", "初来乍到", "情意绵绵", "小道消息", "謠言惑众", "四季变迁",
"冬之情素", "光辉岁月", "光辉", "岁月", "系统", "悄悄话", "伴侣", "没有人", "新手频道", "聊天频道", "财神爷",
"频道", "天气", "季节", "春季", "夏季", "秋季", "冬季", "大宗师", "网路讯息", "公共频道", "频道巡捕", "季节精灵",
"早春夜色", "春日晴夜", "春雨夜色", "春风夜色", "初夏夜色", "盛夏之夜", "夏末之夜", "夏日雨夜", "雷雨之夜",
"风色夜空", "风和之夜", "季风之夜", "初秋夜色", "秋晴夜空", "深秋之夜", "秋雨夜色", "萧瑟雨夜", "秋风之夜",
"瑟瑟秋夜", "冬日夜空", "隆冬夜色", "雪雨之夜", "瑞雪夜色", "寒风之夜", "冷风夜色", "盛夏之风", "早春时光",
"春日煦阳", "春雨绵绵", "春风絮语", "初夏阳光", "盛夏炎阳", "夏末骄阳", "夏日雨季", "夏日雷雨", "夏日之风",
"夏末季风", "初秋时光", "秋高气爽", "草色深秋", "秋雨绵绵", "萧瑟秋雨", "秋风送爽", "秋风瑟瑟", "冬日暖阳",
"隆冬时光", "冬之雪雨", "瑞雪丰年", "凛冽寒风", "冬日冷风", "晨曦细雨", "秋季飓风", "秋之霜华", "天外横财",
"春之喜雨", "春之甘霖", "夏之甘霖", "夏之暴雨", "秋之瑟雨", "冬之雪雨", "皇宫大内", "地主老豺", "枯枝落叶",
"帮会消息", "天降奇缘", "风霜雨雪", "占星家", "四季交替", "端午佳节", "牛郎织女", "仲秋佳节", "重阳佳节",
"元旦佳节", "龙头佳节", "连绵夜雨", "长安值更", "值更老人", "平安无事", "风高放火", "月黑杀人", "天灾人祸",
"注册", "中文", "英文", "伊拉克", "科威特", "伊朗", "土耳其", "德意志", "俄罗斯", "苏联", "管理密码", "信息通告",
});

nosave string *family_name = ({ 
"方寸山三星洞", "南海普陀山", "大唐将军府", "五庄观", "花果山盘丝洞", "轩辕古墓", "蜀山剑派",
"斜月三星", "慈悲红尘", "沙场战神", "真武道尊", "痴心情长", "古墓丽影", "忘忧剑魔", "魔毒神姬",
"天蓬府", "月宫", "东海龙宫", "阎罗地府", "大雪山", "陷空山无底洞", "乱石山碧波潭", "枯松涧火云洞",
"天河之尊", "广寒宫主", "东海龙神", "大力鬼王", "魔毒神君", "嗜血精灵", "万顷碧波", "焚心似火",
"地府女主", "绝情谷", "侍剑山庄", "流沙河", "将军府", "普陀山", "方寸山", "三星洞", "火云洞"
 });

string *bad_word = ({"爸","妈","姨","妓","爷","奶","公","婆","死","尿","屎","自己","告诉","取经",
"蒋","腚","歪","姥","操","干","鸡","你","蛋","婊","爹","娘","铞","囊","大米","彬","台湾","毛","货",
"去","表","便","呆","痒","养","处","处","月经","巾","套","孕","警察","巡警","彪","西游","呸","包",
"大话","西游记","囚","齐天大圣","玉皇大帝","太上老君","管理员","系统","黑客","杀手","月宫","皮","个"
"男","女","性","阎罗王","西王母","大鹏明王","敖广","孔雀公主","罴","尸","骷髅","公安","狮","精","怪",
"豺","狼","狈","熊","豹","虎","狐","大米","妖","客栈","杀","劳改","犯","牙","一","二","三","四","五",
"六","七","八","九","十","黑","暗","法轮功","淫","生","爱","亲","吻","金","银","老鼠","执法","玩家",
"巫师","革命","蟒","包皮","聊天","神话","刽子手","杀人狂","便衣","小偷","扒手","哈哈","嬉","神龙","师太",
"水老鼠","飞蚂蚁","贱","卖","骚","床","波霸","大波","中国","大陆","反动","球","猪","掌门","唐僧","沙僧",
"八戒","妹妹","迷糊","鼠","肉","雪山","方寸","少林","百姓","明教","普陀","龙宫","将军府","天蓬府","天宫",
"无底洞","地府","大雪山","五庄","太白","火云","青霞","大腿","屁股","李洪志","李靖","袁天罡","钱庄","清单",
"碧波","剑圣","教主","狗","小长工","孙悟空","张无忌","无忌","身上","阴","嘉盈","悟性","灵性","容貌","福缘",
"体格","胆识","定力","哈","如来","根骨","精神","气血","武学","道行","杀气","内力","法力","食物","饮水",
"抢劫","半仙","八成","天神","佛祖","强奸","不正","正","斜","神话","悟空","八戒","嘻","流","氓","坐月子",
"雪山","孩","犯","阿孑","天蓬","佛","希特勒","丐帮","大圣","普通","留言板","邮件","攻击","咸阳","客栈",
"护法","工人","破烂","农民","解放军","自由","钱","人民币","美元","货币","电脑","奴隶","财主","财神","莫言",
"大肚子","法西斯","红军","新四军","西游记","民工","地主","老豺","长工","亡命徒","亡命","摸","俺","圣人",
"忌","魔神","战记","魔神战记","魔","神","穴","名字","今昔","痴","傻","界","病","疯","绝情谷","母","地痞",
"痞","盟主","传奇","盘丝","风速小子","永飞","往昔","紫霞","花果山","水帘洞","毛","蜀山","忽悠","晕罐","搞笑",
"猴","色","鬼","留言","板","这个","那个","至尊宝","崔珏","赵灵儿","李逍遥","这个","那个","金箍棒","任务",
"少妇","月奴","金刚经","千字文","色","三字经","武士","魔法师","人族","神族","鬼族","职业","魔法","歪歪",
"种族","黄金","雅典娜","圣水","迷雾岛","精灵","勇气","日本","美国","德国","风速","风儿","花满城","测试"
"勇气","萨达姆","伊拉克","非典","暴躁", "懦弱", "开朗", "孤僻", "聪慧", "迟钝", "邋遢","系统","操作","谣言", 
"↑","↓","⊙","●","○","★","☆","■","♀","『","』","◆","◣","◥","▲","Ψ ","※","南城客栈","没头","霉头脑"
"︺","ш","┉","≦","╰☆╮","≠","±","×","÷","▂","▃","▅","▆","█","▓","∏","卐","【","】","△",
"√","∩","¤","々","♀","♂","∞","①","ㄨ","≡","↘","↙","↖","↗","▂","▂","▃","▄","▅","▆","▇",
"︸","ㄖ","﹄","﹃","┗","╢","╄","┏","τ","▁","█","┗","┛","∪","◇","◆","║","┋","龌龊", "机灵", 
"狡诈", "阴险", "呆滞","╣","╟","╠","╧","￤","╬","┇","┇","〆","﹎","Н","╩","┆","┆","︴","︻","︼","Ъ",
"◤", "◥", "→", "№", "←", "㊣", "∑", "⌒", "〖", "〗","ξ", "ζ", "ω", "□","〓","身", "头", "脚", "眼", "屁",
"①", "②", "③", "④", "⑤", "⑥", "⑦", "⑧", "⑨", "⑩", "㈠", "㈡", "㈢", "㈣", "㈤", "㈥", "㈦", "㈧", 
"ａ", "ｂ", "ｃ", "ｄ", "ｅ", "ｆ", "ｇ", "ｈ", "ｉ", "ｊ", "ｋ", "+","㈨", "㈩","没脑","非典","红孩儿",
"蛮横", "怯弱", "毒辣", "刚烈", "疯癫", "倔强", "聪颖", "伶俐", "柔顺", "多疑", "爽朗", "活泼","妖魔","妖怪",
"大仙","人参果","还阳丹","鬼魂","长安", "开封", "宝象", "祭赛", "江州", "乌鸡", "车迟", "朱紫", "比丘", "钦法", 
"凤仙", "玉华", "天竺", "灵山","子鼠", "丑牛", "寅虎", "卯兔", "辰龙", "巳蛇", "午马", "未羊", "申猴", "酉鸡", 
"戌狗", "亥猪","白羊星座", "金牛星座", "双子星座", "巨蟹星座", "狮子星座", "处女星座", "天秤星座", "天蝎星座",
"射手星座", "摩羯星座", "水瓶星座", "双鱼星座","黑店","靠","脑","碧", "美人鱼", "小米", "小宝", "布袋", "任务",
"人物" });


string *msg_d = ({
"他妈的","你妈的","傻B","我操","操你","和你妈睡","有活的没有","没死会？","操",
"操！","操!","fuck","FUCK","Fuck","婊子","有没有活的","想死?","shit","SHIT","Shit",
"你奶奶的","和你妈做爱","她妈的","你爷爷的","有没有喘气的","cao","CAO","Cao",
"放你妈的屁","tmd","TMD","tmmd","TMMD","操你妈","日死你","干你娘","没死回？",
"操你姐","狗屁wiz","狗wiz","破wiz","死wiz","日死你","Nnd","kao","KAO","Kao","放屁",
"干你妈","干你的","ｆｕｃｋ","ＦＵＣＫ","F u c k","f u c k","nnd","NND","SB","Kao",
"K a o","KAO","K  A  O","k  a  o","KAo","kAo","kaO","草","k ao","ka o","k  a  o",
"mlgb","MLGB","mcb","Sb","sb","shabi","SHABI","MCB","danzi","蛋子","你妈","你爹",
"牛比","放屁","吃屎","你大爷","操你妈","打炮","6mang","大便","小便","caobi",
"避孕套","手淫","老处女","小处女","j8","J8","娼妇","日你妈","贱b","贱B","杂种",});


string *limit_id=({"fuck","shit","sex","father","mother","vip","cao","gan","shxy","reboot","mud",
"look","mlgb","sys","danzi","jizi","wwaiai","wwaiwai","niao","shi","dabo","nngx","nngdyd","news",
"boba","diao","kiss","zccc","dabi","nnd","dyd","none","alias","skills","kill","smash","anyway",
"summon","shutdown","mon","reclaim","sishi","uptime","score","fly","haha","chat","rumors","test",
"xwaiwai","learn","kao","goto","wiz","lingtai","kele","ping","ask","skills","jiji","qiujin",
"haaa","naizi","nai","laobi","chedan","fangcun","longgong","wuzhuang","xueshan","moon","jjf",
"mingjiao","huoyun","tianpeng","putuo","bibotan","wzg","hell","wudidong","jiangjun","jiangjunfu",
"wuji","wukong","sunwukong","sjmd","qusi","qvsi","loveying","qiangjian","nngxd","ddz","mszj","finger",
"mcb","reboot","shaolin","gaibang","zhen","pillow","where","→","city","vip","ghost","changan",
"baoxiang","jisai","xyj","follow","smash","wkz","heidian","wai","feicun", "npc"});


/*
"↑","↓","⊙","●","○","★","☆","■","♀","『","』","◆","◣","◥","▲","Ψ ","※","南城客栈","没头","霉头脑"
"︺","ш","┉","≦","╰☆╮","≠","±","×","÷","▂","▃","▅","▆","█","▓","∏","卐","【","】","△",
"√","∩","¤","々","♀","♂","∞","①","ㄨ","≡","↘","↙","↖","↗","▂","▂","▃","▄","▅","▆","▇",
"┱","︸","╊","ㄖ","へ","┯","┾","﹄","﹃","┗","╢","╄","┏","┍","┑","╨","╪","τ","┬","┴","┎","╀",
"▁","┪","╤","█","┗","┛","∪","◇","◆","＋","┺","║","┋","┦","龌龊", "机灵", "狡诈", "阴险", "呆滞",
"╇","┶","￢","╣","┰","╟","╠","╂","╧","╃","┽","┸","￤","╬","╡","┇","┇","╈","┹","┕","┙","〆",
"﹎","┿","Н","╫","╩","┟","┖","┚","┆","┆","┲","╁","︴","︻","︼","﹂","Ъ","╅","╉","┡","┩","┧",
"┨","┥","┭","◤", "◥", "→", "№", "←", "㊣", "∑", "⌒", "〖", "〗","ξ", "ζ", "ω", "□","∮","〓",
"①", "②", "③", "④", "⑤", "⑥", "⑦", "⑧", "⑨", "⑩", "㈠", "㈡", "㈢", "㈣", "㈤", "㈥", "㈦", "㈧", 
*/

