// random_name.c 随机姓名库。
//版权为〖神州〗巫师公会高级巫师所有。

nosave mixed xing = ({
({"赵","zhao"}),({"钱","qian"}),({"孙","sun"}),({"李","li"}),({"周","zhou"}),({"吴","wu"}),({"郑","zhen"}),({"王","wang"}),
({"冯","feng"}),({"陈","chen"}),({"褚","zhu"}),({"卫","wei"}),({"蒋","jiang"}),({"沈","shen"}),({"韩","han"}),({"杨","yang"}),
({"朱","zhu"}),({"秦","qing"}),({"尤","you"}),({"许","xu"}),({"何","he"}),({"吕","lv"}),({"施","shi"}),({"张","zhang"}),
({"孔","kong"}),({"曹","cao"}),({"严","yan"}),({"华","hua"}),({"金","jin"}),({"魏","wei"}),({"陶","tao"}),({"姜","jiang"}),
({"戚","qie"}),({"谢","xie"}),({"邹","zou"}),({"喻","yu"}),({"柏","bo"}),({"水","shui"}),({"窦","dou"}),({"章","zhang"}),
({"云","yun"}),({"苏","su"}),({"潘","pan"}),({"葛","ge"}),({"段","duan"}),({"范","fan"}),({"彭","peng"}),({"鲁","lu"}),
({"韦","wei"}),({"昌","chang"}),({"马","ma"}),({"苗","miao"}),({"凤","feng"}),({"花","hua"}),({"方","fang"}),({"任","ren"}),
({"袁","yuan"}),({"柳","liu"}),({"邓","deng"}),({"鲍","bao"}),({"史","shi"}),({"唐","tang"}),({"费","fei"}),({"廉","lian"}),
({"岑","chen"}),({"薛","xue"}),({"雷","lei"}),({"贺","he"}),({"倪","ni"}),({"汤","tang"}),({"藤","teng"}),({"殷","yin"}),
({"罗","luo"}),({"华","hua"}),({"郝","hao"}),({"田","tian"}),({"安","an"}),({"常","chang"}),({"勒","jin"}),({"时","shi"}),
({"付","fu"}),({"皮","pi"}),({"卞","bian"}),({"齐","qi"}),({"康","kang"}),({"伍","wu"}),({"余","yu"}),({"元","yuan"}),
({"顾","gu"}),({"平","ping"}),({"黄","huang"}),({"和","he"}),({"穆","mu"}),({"肖","xiao"}),({"尹","yin"}),({"姚","yao"}),
({"邵","shao"}),({"湛","zhan"}),({"汪","wang"}),({"祁","qi"}),({"毛","mao"}),({"禹","yu"}),({"狄","di"}),({"米","mi"}),
({"贝","bei"}),({"明","ming"}),({"藏","zang"}),({"计","ji"}),({"姬","ji"}),({"成","cheng"}),({"戴","dai"}),({"谭","tan"}),
({"宋","song"}),({"茅","mao"}),({"庞","pang"}),({"熊","xiong"}),({"纪","ji"}),({"舒","su"}),({"屈","qu"}),({"项","xiang"}),
({"祝","zhu"}),({"董","dong"}),({"梁","liang"}),({"樊","fan"}),({"胡","hu"}),({"凌","ling"}),({"霍","ho"}),({"虞","yu"}),
({"万","wan"}),({"柯","ke"}),({"管","guan"}),({"卢","lu"}),({"英","ying"}),({"仇","qiu"}),({"铑","hou"}),({"岳","yue"}),
({"帅","shuai"}),({"年","nian"}),({"佟","dong"}),({"蒯","kuai"}),({"钟","zhong"}),({"宗","zong"}),({"林","lin"}),({"石","shi"}),
({"司马","sima"}),({"上官","shangguan"}),({"欧阳","ouyang"}),({"夏侯","xiahou"}),({"诸葛","zhuge"}),({"东方","dongfang"}),
({"南宫","nangong"}),({"呼延","huyan"}),({"皇甫","huangpu"}),({"公孙","gongsun"}),({"令狐","linghu"}),({"宇文","yuwen"}),
({"长孙","zhangsun"}),({"幕容","murong"}),({"司徒","situ"}),({"西门","ximen"}),({"俞","yu"}),({"莫","mo"}),
});

nosave mixed name = ({
({"忠","zhong"}),({"孝","xiao"}),({"礼","li"}),({"义","yi"}),({"智","zhi"}),({"勇","yong"}),({"仁","ren"}),({"匡","kuang"}),
({"宪","xian"}),({"令","ling"}),({"福","fu"}),({"禄","lu"}),({"大","da"}),({"小","xiao"}),({"晓","xiao"}),({"高","gao"}),
({"可","ke"}),({"阿","a"}),({"金","jin"}),({"世","shi"}),({"克","ke"}),({"叔","shu"}),({"之","zhi"}),({"公","gong"}),
({"夫","fu"}),({"时","shi"}),({"若","ruo"}),({"庆","qing"}),({"文","wen"}),({"武","wu"}),({"多","duo"}),({"才","cai"}),
({"长","chang"}),({"子","zi"}),({"永","yong"}),({"友","you"}),({"人","ren"}),({"为","wei"}),({"铁","tie"}),({"不","bu"}),
({"志","zhi"}),({"明","ming"}),({"乐","le"}),({"冥","ming"}),({"无","wu"}),({"伶","ling"}),({"富","fu"}),({"伯","bo"}),
({"道","dao"}),({"玄","xuan"}),({"少","shao"}),({"鹤","he"}),({"青",""}),({"翠","cui"}),({"远","yuan"}),({"丹","dan"}),
({"德","de"}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),({"",""}),
});

nosave mixed name_e = ({
({"霸","ba"}),({"白","bai"}),({"班","ban"}),({"斌","bin"}),({"宾","bin"}),({"昌","chang"}),({"超","chao"}),({"诚","chen"}),
({"川","chuan"}),({"鼎","ding"}),({"定","ding"}),({"法","fa"}),({"飞","fei"}),({"风","feng"}),({"锋","feng"}),({"钢","gang"}),
({"罡","gang"}),({"贯","guan"}),({"光","guang"}),({"海","hai"}),({"虎","hu"}),({"华","hua"}),({"浩","hao"}),({"宏","hong"}),
({"济","ji"}),({"坚","jian"}),({"健","jian"}),({"剑","jian"}),({"江","jiang"}),({"进","jin"}),({"杰","jie"}),({"俊","jun"}),
({"康","kang"}),({"良","liang"}),({"麟","lin"}),({"民","min"}),({"明","ming"}),({"鸣","ming"}),({"宁","ning"}),({"培","pei"}),
({"启","qi"}),({"强","qiang"}),({"荣","rong"}),({"山","shan"}),({"泰","tai"}),({"涛","tao"}),({"挺","ting"}),({"伟","wei"}),
({"熙","xi"}),({"祥","xiang"}),({"雄","xiong"}),({"旭","xu"}),({"群","qun"}),({"扬","yang"}),({"清","qing"}),({"毅","yi"}),
({"瑜","yu"}),({"羽","yu"}),({"宇","yu"}),({"舟","zhou"}),({"斗","dou"}),({"真","zhen"}),({"丰","feng"}),({"枫","feng"}),
({"平","ping"}),({"冲","chong"}),({"之","zhi"}),({"方","fang"}),({"楠","nan"}),({"安","an"}),({"雷","lei"}),({"宁","ning"}),
({"独","du"}),({"波","po"}),({"浪","lang"}),({"淳","chun"}),({"封","feng"}),({"云","yun"}),({"天","tian"}),({"贵","gui"}),
({"琦","qi"}),({"泽","ze"}),({"利","li"}),({"兴","xing"}),({"止","zhi"}),({"灭","mie"}),({"峰","feng"}),({"空","kong"}),
({"中","zhong"}),({"勋","xun"}),({"逵","kui"}),({"越","yue"}),({"誉","yu"}),({"义","yi"}),({"胜","sheng"}),({"弘","hong"}),
({"进","jin"}),({"顺","shun"}),({"青","qing"}),({"俊","jun"}),({"信","xin"}),({"滔","tao"}),({"定","ding"}),({"正","zheng"}),
({"秀","xiu"}),({"绍","shao"}),({"立","li"}),({"圭","gui"}),({"廷","ting"}),({"振","zhen"}),({"宣","xuan"}),({"让","rang"}),
({"鹏","peng"}),({"盛","sheng"}),({"瑞","rui"}),({"坚","jian"}),({"威","wei"}),({"达","da"}),({"旺","wang"}),({"忠","zhong"}),
({"勇","yong"}),({"庆","qing"}),({"润","run"}),({"通","tong"}),({"猛","meng"}),({"隆","long"}),({"新","xin"}),({"松","song"}),
({"亮","liang"}),({"恩","en"}),({"迁","qian"}),({"雕","diao"}),({"保","bao"}),({"豹","bao"}),({"圣","sheng"}),({"龙","long"}),
({"佑","you"}),({"亭","ting"}),({"岱","dai"}),({"岩","yan"}),({"诺","nuo"}),({"谷","gu"}),({"高","gao"}),({"恒","heng"}),
({"归","gui"}),({"臣","chen"}),({"径","jin"}),({"晔","ye"}),({"艮","hen"}),({"骅","hua"}),({"泉","quan"}),({"柳","liu"}),
({"钰","yu"}),({"显","xian"}),({"谨","jin"}),({"益","yi"}),({"坦","tan"}),({"凡","fan"}),({"敬","jing"}),({"轩","xuan"}),
({"炳","bing"}),({"雪","xue"}),({"忌","ji"}),({"靖","jing"}),
});

nosave mixed name_w = ({      //女性专用
({"爱","ai"}),({"春","chun"}),({"丹","dan"}),({"芳","fang"}),({"芬","fen"}),({"凤","feng"}),({"姑","gu"}),({"红","hong"}),
({"虹","hong"}),({"娇","jiao"}),({"娟","juan"}),({"菊","ju"}),({"兰","lan"}),({"岚","lan"}),({"丽","li"}),({"莉","li"}),
({"莲","lian"}),({"玲","ling"}),({"琳","lin"}),({"娜","na"}),({"琴","qin"}),({"芹","qin"}),({"倩","qian"}),({"萍","ping"}),
({"婷","ting"}),({"霞","xia"}),({"香","xaing"}),({"艳","yan"}),({"燕","yan"}),({"英","ying"}),({"瑛","ying"}),({"玉","yu"}),
({"珍","zhen"}),({"珠","zhu"}),({"媛","yuan"}),({"锦","jin"}),({"芸","yun"}),({"灵","ling"}),({"珊","shan"}),({"芙","fu"}),
({"娴","xian"}),({"瑾","jin"}),({"瑤","yao"}),({"襄","xiang"}),({"蓉","rong"}),({"若","ruo"}),({"梦","meng"}),({"仪","yi"}),
({"",""}),
});

void set_random_name(string gender)
{
	string l_c, l_e, f_c, f_e, f_c_e, f_e_e;
	int    i, j, k;
	
	i = random(sizeof(xing));
	if (stringp(gender) && gender == "女性"){
		j = random(sizeof(name_w));
		k = random(sizeof(name_w));
		if ( k == j ) k = random(sizeof(name_w)) / 2;
		f_c = name_w[j][0];
		f_e = name_w[j][1];
		f_c_e = name_w[k][0];
		f_e_e = name_w[k][1];
	}else{
		j = random(sizeof(name));
		k = random(sizeof(name_e));
		f_c = name[j][0];
		f_e = name[j][1];
		f_c_e = name_e[k][0];
		f_e_e = name_e[k][1];
	}

	l_c = xing[i][0];
	l_e = xing[i][1];

	set_name(l_c+f_c+f_c_e, ({ l_e+ " " + f_e + f_e_e , l_e, }));
	set("id_long", l_e + " " + f_e + f_e_e);
	set("id_short", l_e);
}