/********************************************************************************

 『 主管天神 』━━┳━ bowl     晚风      离线：二十二天            「尚未分配」
                   ┣━ djx      刀剑笑    离线：一天五小时          「底层维护」
                   ┣━ run      乱        离线：一天二小时          以懒为名
                   ┣━ seawind  雪鱼      离线：十九天              PFM总管
                   ┣━ tom      开心汤姆  离线：一天十九小时        到处逛逛
                   ┗━ yhq      风琴      离线：十九天              保障服务器
 『 天界大神 』━━━━ wqfeng   风羽      离线：四天十七小时        「尚未分配」

********************************************************************************/

string *wiz = ({
        "晚风","Bowl","刀剑笑","Djx","乱","Run",
        "雪鱼","Seawind","开心汤姆","Tom","眠兔","Snowtu",
        "风琴","Yhq","风羽","Wqfeng",
});

string *foods = ({
        "茶食刀切","杏仁佛手","香酥苹果","合意饼","四喜乾果","虎皮花生","怪味大扁","奶白葡萄","雪山梅",
        "四甜蜜饯","蜜饯苹果","蜜饯桂圆","蜜饯鲜桃","蜜饯青梅","龙凤呈祥","洪字鸡丝黄瓜","福字瓜烧里脊",
        "万字麻辣肚丝","年字口蘑发菜","御膳豆黄","芝麻卷","金糕","枣泥糕","凤尾鱼翅","红梅珠香","宫保野兔",
        "豆面饽饽","奶汁角","祥龙双飞","爆炒田鸡","芫爆仔鸽","八宝野鸭","佛手金卷","炒墨鱼丝","绣球乾贝",
        "炒珍珠鸡","奶汁鱼片","干连福海参","花菇鸭掌","五彩牛柳","挂炉山鸡","生烤狍肉",
        "山珍刺龙芽","莲蓬豆腐","草菇西兰花",
});

string wizname(int num)
{
int i = random(sizeof(wiz)/2)*2;
string w_name = wiz[i];
string w_id = wiz[i+1];
string str = w_name;
if (num==1)
        str+="("+w_id+")";
return str;
}


object random_player(object *who)
{
object player = who[random(sizeof(who))];
if ( player->query("礼物/2003元旦1") )
        player = find_player("snowtu"); //得过的就给wiz吧，哈哈，暂时没想到其他办法
return player;
}

