mixed bat_message()
{		
        return
        ([
                0 :([
                "attack": ({
"$N抄起手中的$o0，对准$T的xx就是一戟。",
"$N挥舞着手中的$o0，猛地刺向$T的xx。",
"$N手持$o0，狠命地朝$T的xx砍去。",
"$N端着掌中$o0，不管三七二十一地朝$T一阵乱劈。", }),
"attack-on-horse": ({
"$N手拿$o0，双脚一夹马肚，催动跨下$o3边冲边象$T的xx刺去。",
"$N一个错身，用力一扯马缰，掌中$o0反手扫向$T。",
}),
"hit": ({
"结果只是划出了一处轻微的伤痕。",
"结果轻轻地划破了$T的皮肉。",}),
"dodge": ({
"$T急忙一闪身，避开了$N的攻击。",
"$T身子一侧，总算躲过了$N的攻击。", }),
"dodge-on-horse": ({
"$T用力一扯马缰，跨下$o3猛地一跳，闪过了$N的攻击。",
"$T连忙一夹马腹，$o3负痛一个转身，避开了去。",
"$T慌忙弯腰，伏在马背上，躲过了$N的攻击。",
"$T急忙一个侧身闪开，却差点跌下马去。",}),
"miss" : ({
"结果离$T的衣角都还相差甚远。",
"结果跟$T的xx偏了几寸。", }),
"wait" : ({
"$N紧紧握着手中的$o0，缓缓移动脚步，伺机出手。",
"$N目不转睛地盯住$T，准备寻找对方的破绽出手。", }),
"wait-on-horse" : ({
"$N一手紧紧攥住马缰，一手持着$o0，等待着机会发动攻击。",
"$N双腿一夹，策动跨下$o2，伺机出手。", }),
"parry" : ({
"结果被$T格开了。",
"但是被$T挡开了。",
"结果被$T手中的$o1架开了去。",
"只听『铛』的一声，被$T掌中的$o1格开了。", }),
                ]),
		1 :([
"attack": ({
"$N身形微晃，手中的$o0确毫不迟疑的向$T的xx刺了过去。",
"$N倒转$o0，以$o0的尾部瞧着$T的xx打了过来。",
"$N抄起手中的$o0，对准$T的xx就是一戟。",
"$N手持$o0，狠命地朝$T的xx砍去。",
"$N挥舞着手中的$o0，猛地刺向$T的xx。", }),
"hit":  ({
"结果只是划出了一处伤痕。",
"结果地划破了$T的皮肉。",}),
"dodge": ({
"$T急忙一闪身，避开了$N的攻击。",
"$T身子一侧，总算躲过了$N的攻击。", }),
"dodge-on-horse": ({
"$T用力一扯马缰，跨下$o3猛地一跳，闪过了$N的攻击。",
"$T连忙一夹马腹，$o3负痛一个转身，避开了去。",
"$T慌忙弯腰，伏在马背上，躲过了$N的攻击。",
"$T急忙一个侧身闪开，却差点跌下马去。",}),
"miss" : ({
"结果离$T的衣角都还相差甚远。",
"结果跟$T的xx偏了几寸。", }),
"wait" : ({
"$N紧紧握着手中的$o0，缓缓移动脚步，伺机出手。",
"$N目不转睛地盯住$T，准备寻找对方的破绽出手。", }),
"wait-on-horse" : ({
"$N一手紧紧攥住马缰，一手持着$o0，等待着机会发动攻击。",
"$N双腿一夹，策动跨下$o2，伺机出手。", }),
"parry" : ({
"结果被$T格开了。",
"但是被$T挡开了。",
"结果被$T手中的$o1架开了去。",
"只听『铛』的一声，被$T掌中的$o1格开了。", }),
                ]),
		2 :([
"attack": ({
"$N举起手中的$o0，使出全力的向$T当头砍了过来。 ",
"$N身形微晃，手中的$o0确毫不迟疑的向$T的xx刺了过去。",
"$N倒转$o0，以$o0的尾部瞧着$T的xx打了过来。",
"$N抄起手中的$o0，对准$T的xx就是一戟。",
"$N挥舞着手中的$o0，猛地刺向$T的xx。", }),
"hit":  ({
"结果划出了一处伤痕。",
"结果划破了$T的皮肉。",}),
"dodge": ({
"$T急忙一闪身，避开了$N的攻击。",
"$T身子一侧，总算躲过了$N的攻击。", }),
"dodge-on-horse": ({
"$T用力一扯马缰，跨下$o3猛地一跳，闪过了$N的攻击。",
"$T连忙一夹马腹，$o3负痛一个转身，避开了去。",
"$T慌忙弯腰，伏在马背上，躲过了$N的攻击。",
"$T急忙一个侧身闪开，却差点跌下马去。",}),
"miss" : ({
"结果离$T的衣角都还相差甚远。",
"结果跟$T的xx偏了几寸。", }),
"wait" : ({
"$N紧紧握着手中的$o0，缓缓移动脚步，伺机出手。",
"$N目不转睛地盯住$T，准备寻找对方的破绽出手。", }),
"wait-on-horse" : ({
"$N一手紧紧攥住马缰，一手持着$o0，等待着机会发动攻击。",
"$N双腿一夹，策动跨下$o2，伺机出手。", }),
"parry" : ({
"结果被$T格开了。",
"但是被$T挡开了。",
"结果被$T手中的$o1架开了去。",
"只听『铛』的一声，被$T掌中的$o1格开了。", }),
                ]),
		3 :([
"attack": ({
"$N举起手中的$o0，使出全力的向$T当头砍了过来。 ",
"$N身形微晃，手中的$o0确毫不迟疑的向$T的xx刺了过去。",
"$N摆动手中的$o0，出奇不意的向$T的xx砍了过去。 ",
"$N大呼一声，手中的$o0向$T拦腰砍过去。 ",
"$N挥舞着手中的$o0，猛地刺向$T的xx。", }),
"hit":  ({
"结果划出了一处明显的伤痕。",
"结果在$T的身上划出了一条深深的血沟。",}),
"dodge": ({
"$T急忙一闪身，避开了$N的攻击。",
"$T身子一侧，总算躲过了$N的攻击。", }),
"dodge-on-horse": ({
"$T用力一扯马缰，跨下$o3猛地一跳，闪过了$N的攻击。",
"$T连忙一夹马腹，$o3负痛一个转身，避开了去。",
"$T慌忙弯腰，伏在马背上，躲过了$N的攻击。",
"$T急忙一个侧身闪开，却差点跌下马去。",}),
"miss" : ({
"结果离$T的衣角都还相差甚远。",
"结果跟$T的xx偏了几寸。", }),
"wait" : ({
"$N紧紧握着手中的$o0，缓缓移动脚步，伺机出手。",
"$N目不转睛地盯住$T，准备寻找对方的破绽出手。", }),
"wait-on-horse" : ({
"$N一手紧紧攥住马缰，一手持着$o0，等待着机会发动攻击。",
"$N双腿一夹，策动跨下$o2，伺机出手。", }),
"parry" : ({
"结果被$T格开了。",
"但是被$T挡开了。",
"结果被$T手中的$o1架开了去。",
"只听『铛』的一声，被$T掌中的$o1格开了。", }),
                ]),
		3 :([
"attack": ({
"$N举起手中的$o0，使出全力的向$T当头砍了过来。 ",
"$N身形微晃，手中的$o0确毫不迟疑的向$T的xx刺了过去。",
"$N摆动手中的$o0，出奇不意的向$T的xx砍了过去。 ",
"$N大呼一声，手中的$o0向$T拦腰砍过去。 ",
"$N挥舞着手中的$o0，猛地刺向$T的xx。", }),
"hit":  ({
"结果划出了一处深深的伤痕。",
"结果在$T的身上划出了一条深深的血沟。",}),
"dodge": ({
"$T急忙一闪身，避开了$N的攻击。",
"$T身子一侧，总算躲过了$N的攻击。", }),
"dodge-on-horse": ({
"$T用力一扯马缰，跨下$o3猛地一跳，闪过了$N的攻击。",
"$T连忙一夹马腹，$o3负痛一个转身，避开了去。",
"$T慌忙弯腰，伏在马背上，躲过了$N的攻击。",
"$T急忙一个侧身闪开，却差点跌下马去。",}),
"miss" : ({
"结果离$T的衣角都还相差甚远。",
"结果跟$T的xx偏了几寸。", }),
"wait" : ({
"$N紧紧握着手中的$o0，缓缓移动脚步，伺机出手。",
"$N目不转睛地盯住$T，准备寻找对方的破绽出手。", }),
"wait-on-horse" : ({
"$N一手紧紧攥住马缰，一手持着$o0，等待着机会发动攻击。",
"$N双腿一夹，策动跨下$o2，伺机出手。", }),
"parry" : ({
"结果被$T格开了。",
"但是被$T挡开了。",
"结果被$T手中的$o1架开了去。",
"只听『铛』的一声，被$T掌中的$o1格开了。", }),
                ]),     
	]);
}

