mixed bat_message()
{
	return
([ 0:
	([
"attack": ({
"$N紧握手中的$o0，对准$T的xx狠命刺了过去。",
"$N挥舞着手中的$o0，刺向$T的xx。",
"$N手持$o0，瞅着$T的xx就是一下子。",
"$N仗起掌中的$o0，照着$T一阵乱捅乱扎。", }),
"attack-on-horse": ({
"$N手拿$o0，双脚一夹马肚，催动跨下$o3边冲边象$T的xx刺去。",
"$N一个错身，用力一扯马缰，掌中$o0反手扫向$T。",
}),
"hit": ({
"结果只造成了一处轻微的刺伤。",
"但是只轻轻地刺破了$T的皮肉。", }),
"dodge": ({
"$T急忙一闪身，避开了$N的攻击。",
"$T身子一侧，总算躲过了$N的攻击。",}),
"dodge-on-horse": ({
"$T用力一扯马缰，跨下$o3猛地一跳，闪过了$N的攻击。",
"$T连忙一夹马腹，$o3负痛一个转身，避开了去。",
"$T慌忙弯腰，伏在马背上，躲过了$N的攻击。",
"$T急忙一个侧身闪开，却差点跌下马去。",}),
"miss" : ({
"结果离$T的衣角都还相差甚远。",
"结果跟$T的xx偏了几寸。",}),
"wait" : ({
"$N双手紧握$o0，缓缓移动脚步，伺机出手。",
"$N目不转睛地盯住$T，准备寻找对方的破绽出手。",}),
"wait-on-horse" : ({
"$N一手紧紧攥住马缰，一手持着$o0，等待着机会发动攻击。",
"$N双腿一夹，策动跨下$o2，伺机出手。",}),
"parry" : ({
"结果被$T格开了。",
"但是被$T挡开了。",
"结果被$T手中的$o1架开了去。",
"只听『铛』的一声，被$T掌中的$o1格开了。",}),
	]),
]);
}
