// /d/city/kedian3.c
// Modified by Lonely Nitan@Mud

inherit ROOM;
string long_desc(); 
string day_event(){return NATURE_D->outdoor_room_event();}  

void create()
{
	set("short", "客店二楼");
	set("long", (:long_desc:)); 
	set("sleep_room", "1");
	set("no_fight", "1");
        set("hotel",1);

	set("exits", ([
		"out" : __DIR__"kedian2",
	]));

	setup();
}

string long_desc()  
{
	mixed  *local;
	string msg; 
	      
	local = localtime(time() * 60);
	
        /*
	if (local[2] < 5 || local[2] > 19) // 半夜
        */
        if (day_event() == "event_midnight") 
	
        msg = "月亮慢慢升到天中，夜色如水，客房中的客人已进入梦乡，只听到疲\n"
              "累的客人传来了呼噜声。\n"
"
          ()___
        ()//__/)_________________()
        ||(___)//#/_/#/_/#/_/#()/||
        ||----|#| |#|_|#|_|#|_|| ||
        ||____|_|#|_|#|_|#|_|#||/||
        ||    |#|_|#|_|#|_|#|_||\n\n";
			
        /*
	else if (local[2] < 10) // 清晨
        */
        else
        if (day_event() == "event_sunrise" || day_event() == "event_morning") 
	
	msg = "清晨的阳光浅浅地透进去，周围一片灰蒙蒙的。走道上传来早起客人\n"
	      "的脚步声。楼下的服务员正在准备客人要的早餐，忙碌的一天又开始了。\n"
"
        ||
        ||                   ||
     ||/||___                ||
     || /`   )____________||_/|
     ||/___ //_/_/_/_/_/_/||/ |
     ||(___)/_/_/_/_/_/_/_||  |
     ||     |_|_|_|_|_|_|_|| /|
     ||     | | | | | | | ||/||
     ||~~~~~~~~~~~~~~~~~~~||
     ||                   ||\n\n";

        /*
	else if (local[2] < 15) // 正午
        */
        else
        if (day_event() == "event_noon" || day_event() == "event_afternoon") 
	
	msg = "午后时分，窗外阳光普照，南来北往的客人络绎不绝的进来投宿。晚\n"
	      "起的客人也起床离开了。\n"
"

          ()___
        ()//__/)_________________()
        ||(___)//#/_/#/_/#/_/#()/||
        ||----|#| |#|_|#|_|#|_|| ||
        ||____|_|#|_|#|_|#|_|#||/||
        ||    |#|_|#|_|#|_|#|_||\n\n";

        /*
	else if (local[2] < 18) // 傍晚
	*/
	else
	if (day_event() == "event_evening") 
	
	msg = "下午的阳光洒进屋前的树丛，可以看到里面有些小鸟在窜来窜去，街\n"
	      "道边上的树影逐渐拉长，日渐西山了。店小二开始为晚上到来的客人准备\n"
	      "丰盛的晚餐。\n"
"

          ()___
        ()//__/)_________________()
        ||(___)//#/_/#/_/#/_/#()/||
        ||----|#| |#|_|#|_|#|_|| ||
        ||____|_|#|_|#|_|#|_|#||/||
        ||    |#|_|#|_|#|_|#|_||\n\n";

	else // 入夜
        if (day_event() == "event_night") 
	
	msg = "傍晚的阳光穿透窗边的缝隙，使街道看起来有些阴森。厨房的炊烟正\n"
	      "在袅袅升起，是晚餐时分了。来投宿的客人都下到大厅中享用丰盛的晚餐\n"
	      "了。\n"
"

        ||
        ||                   ||
     ||/||___                ||
     || /`   )____________||_/|
     ||/___ //_/_/_/_/_/_/||/ |
     ||(___)/_/_/_/_/_/_/_||  |
     ||     |_|_|_|_|_|_|_|| /|
     ||     | | | | | | | ||/||
     ||~~~~~~~~~~~~~~~~~~~||
     ||                   ||\n\n";
        
        else
        msg = "这是一间很大的客房，陈设十分简陋。靠墙放了十几张小木床，不少\n"
	      "客人正和衣而卧，满屋子都是呼呼的打酣声。西边有张床是空的，你蹑手\n"
	      "蹑脚地走了过去。\n";

        return msg;
}
