string *msg_d = ({
                      "他妈的","你妈的","傻B","和你妈睡",
                      "fuck","FUCK","Fuck","婊子",
                      "你奶奶的","和你妈做爱","她妈的","扯蛋","你爷爷的"
                      "小屁孩","放屁","滚蛋","放狗屁",
                      "放你妈的屁","tmd","TMD","真浪","tmmd","TMMD","日死你","干你娘",
                      "狗屁wiz","狗wiz","破wiz","日死你","shit","Shit","SHIT","傻b","妈比","妈b","tnnd",
                      "tyyd","TNND","TYYD","不是人","狗娘","狗娘养的","jb","JB","几吧","鸡吧","卵子","狗日","狗日的",
                      "t m d","T M D","我操","操你","操！","操!","nnd","NND","打炮","操你妈","手淫",
                      });
