// parry.h
//招架的描述文件。
//每个种类的招架至少为 4 招。

//双方均有兵器：
string *parry1=({

"$N手中$w轻轻划过$n的$v，化解了$n的攻势！\n",
"$N身形快速地晃了几晃，手中$w正好架住$n的$v！\n",
"$N一横手中的$w，拼力架住了$n的$v，只听兵的一声，火花四溅！\n",
"$N刷地一声躲闪开来，手中$w轻轻划过$v，几个起落，落在远处！\n"

});

//攻击方没有兵器，防守方有兵器：
string *parry2=({

HIY"$N"NOR HIY"心中一动，将自身气劲推高一层，只见灵光闪耀，气劲绕身急速溜转！\n强烈的气劲产生一环形旋风正好躲开了$n"NOR HIY"的攻击。\n"NOR,
HIY"$N"NOR HIY"神色凝重，全身肌肉暴张，身内骨骼与筋挤压得连珠断沉响，身外紫光\n围绕把$n"NOR HIY"的气劲全部化解。\n"NOR,
HIY"$N"NOR HIY"打出无数计拳脚，把$n痛击围绕自己的无数身形一一打散！\n"NOR,
HIY"$N"NOR HIY"脚底生风尢如雷神疾电，眨眼间就在$n面前像幻影一般消失无踪。\n"NOR,
HIY"只见$N"NOR HIY"气劲中忽发出一片金黄色的光芒，纷纷把$n"NOR HIY"的气劲托开四散。\n"NOR,
HIY"$N"NOR HIY"整个人旋转而起，在身体上方形成一股小型龙形气劲，气劲旋转而下在$N 的身体周围形成了一层保护。\n"NOR,
HIY"$N"NOR HIY"扭身回转，横身急闪避过一击。。。\n"NOR,
HIY"$N"NOR HIY"双目透出熊熊的红色光芒，突见$l之上射出一束火红色的闪光，$N身再\n生异变，由红光电红转绿光，光芒暴增一倍！\n"NOR,
HIY"只听见“波”的一声，$n"NOR HIY"反而随声倒退八丈，震得$l"NOR HIY"麻痛狂抖……\n"NOR,
HIY"只见$N"NOR HIY"身形急转，把体外气劲形成圆罩，卸尽$n"NOR HIY"的力道。\n"NOR,
HIY"$N"NOR HIY"卸去$n"NOR HIY"击中穴位劲气，鼓劲一纵，跃出三丈有余，突出$n"NOR HIY"劲力围锁，\n但仍惊魂未定，暗运内劲调息，相平息胸中的血气翻腾……\n"NOR,
HIY"$n"NOR HIY"惊骇得心跳与血液刹那间凝住，$l受到$N"NOR HIY"双脚缠锁，仍浑然不觉，呆若木鸡！\n"NOR,
HIY"$n"NOR HIY"左突右撞，只见周围全是$N"NOR HIY"灼热翻飞的火掌，身不由己，被火气掀得旋转翻添。\n"NOR,
HIY"$n"NOR HIY"仰天长啸，回音呼应，仿佛天神降世，体内异能流转四肢百骸，\n骨骼发出一阵“咯咯卡卡”的轻微声响，劲气竟较前不同。\n"NOR,
HIY"$N"NOR HIY"的$l似坚韧无骨，虽被$n"NOR HIY"绞磨得随势疾转，但却没有出现象$n"NOR HIY"所想的那样立时碎断！\n"NOR,
HIY"$N"NOR HIY"心内吃惊，手忙脚乱，顾此失彼，在$n"NOR HIY"以雷霆万钧之势的攻击下，\n竟毫无回手之力，瞬间已经连遭$n"NOR HIY"重击……\n"NOR,
HIY"$n"NOR HIY"暴喝连连，出手狠疾，鬼神莫测，一击得手，人如临风飞鸿，又倏然飘至$N"NOR HIY"背后再攻……\n"NOR,
HIY"$N"NOR HIY"身法变的越来越快，“雷神疾电”形成无数光影，急速移动，令人眼花缭乱。\n"NOR,
HIY"$n"NOR HIY"仿如脱胎换骨，拳势蕴含无限杀机，$N"NOR HIY"不敢怠慢，身形转动，展身急闪。\n"NOR,
HIY"$n"NOR HIY"不断灵活变招，$N"NOR HIY"攻出劲力始终难以击中目标。\n"NOR,
HIY"$n"NOR HIY"随机应变，$w"NOR HIY"向旁疾挥，潜藏于$w 内熊熊火舌，竟也像一条火龙般从$w"NOR HIY"倾泻而出，\n$N"NOR HIY"攻出的极热火劲，转眼被卸解的于干净净，这情景真让人感到匪夷所思！\n"NOR,
HIY"$N"NOR HIY"身转如轮，将$w"NOR HIY"舞的仿如海水生潮，一波追一波$n 痛怒攻心，愤然提腿攻击，\n$N 旋身闪避，射过$n"NOR HIY"攻来的一脚，迅疾绕向$n"NOR HIY"身后。$n"NOR HIY"没有旋转的余地，只好急运“金身”忍受捱打。\n"NOR,
HIY"$n"NOR HIY"的气劲在$N"NOR HIY"体内暴露的筋脉内陆续爆炸，闪着点点火光，血管终于抵受不住冲击，多处破裂，血流如注。\n"NOR,
HIY"$n"NOR HIY"闪避不及，陡然提气，催运对$N"NOR HIY"攻出“裂金身”拢圆硬接，\n两股劲力袭来，已拳如雷，\n击力千钧，虽被硬生磕开，但$n"NOR HIY"亦被冲击的剧震摇晃，不觉脚下一松。\n"NOR,
});

//攻击方有兵器，防守方没有兵器：
string *parry3=({
HIY"$N"NOR HIY"顿在惊骇莫名之际，立马飞身后退。。。\n"NOR,
HIY"$n"NOR HIY"腾空而起，在$N"NOR HIY"身边四处跳弹疾走，矫若游龙。。。\n"NOR,
HIY"$N"NOR HIY"大吼一声，随着吼声，劲气陡涨，霎时在周身形成一层橙黄色的保护气罩，\n使$N 险险躲过$n"NOR HIY"致命的一击。\n"NOR,
HIY"$n"NOR HIY"只觉$l"NOR HIY"一紧，$N"NOR HIY"缠锁的双腿己发力收紧扭锁，登时呼吸窒滞，眼突舌吐，痛苦的无以复加。\n"NOR,
HIY"$n"NOR HIY"挟着疾风己神速杀到，那气势仿佛狂风从天而降，又如雷神面目狰狞地驱动雷火四处\n围击山岳振撼，草木尽折，霎时只见狂风大作，尘暴四起，沙石纷飞。\n"NOR,
HIY"$N"NOR HIY"急忙强忍痛楚，以其诡异身法，蹿奔于气漩之间。。。\n"NOR,
HIY"$N"NOR HIY"遂祭起劲气，运至四肢，抢扑向前，“观音乱影”出手，人如飞鸿，围定$n"NOR HIY"旋转起来……\n"NOR,
HIY"$n"NOR HIY"灵念一动，随即变招，猛地旋身弹上半空，脱离$N"NOR HIY"的攻击范围。\n"NOR,
HIY"一阵旋风吹来，$n"NOR HIY"幻影旋起半空，如一团火，在空中燃烧，旋转……\n"NOR,
HIY"$N"NOR HIY"出招受挫，身形急展，倏地收招闪避，改变攻势，不作正面交锋，\n心内暗想：“还想硬拼？我才没这么笨！”\n"NOR,
HIY"$n"NOR HIY"意志坚定，转眼己摄心神，同时祭起内劲在周身如轮运转，\n全身肌肉崩紧贡涨，隐隐有金光索绕。。。\n"NOR,
HIY"$n"NOR HIY"人如旋风，陡地跃身而起，飞射而退。。。\n"NOR,
HIY"$n"NOR HIY"气运一周天，立感周身如有一股劲气狂摧，挣撞着欲冲出体外，\n浑身血管被鼓涨欲裂，$n的肌肉贡张，筋脉搏露涌现……\n"NOR,
HIY"$N"NOR HIY"猛催力劲，双臂突然绞磨疾旋，“绞磨灭绝”疾吐出手，越转越急下，\n劲气凝聚成一道气墙，抗衡着$n"NOR HIY"的$w。。。\n"NOR,
HIY"$N"NOR HIY"耳目极灵，沉身急闪，$l带着风声越顶划过。。。\n"NOR,
HIY"$n"NOR HIY"运起“乾坤无影”劈插格挡，将周身守得固若金汤，$N"NOR HIY"无功而返。。。\n"NOR,
HIY"$N"NOR HIY"穷追猛打，步步进逼，$n"NOR HIY"只能边挡边退，狼狈万分。。。\n"NOR,

});

//攻击方没有兵器，防守方没有兵器：
string *parry4=({

HIY"$N"NOR HIY"顿在惊骇莫名之际，立马飞身后退。。。\n"NOR,
HIY"$n"NOR HIY"腾空而起，在$N"NOR HIY"身边四处跳弹疾走，矫若游龙。。。\n"NOR,
HIY"$N"NOR HIY"大吼一声，随着吼声，劲气陡涨，霎时在周身形成一层橙黄色的保护气罩，\n使$N 险险躲过$n"NOR HIY"致命的一击。\n"NOR,
HIY"$n"NOR HIY"只觉$l"NOR HIY"一紧，$N"NOR HIY"缠锁的双腿己发力收紧扭锁，登时呼吸窒滞，眼突舌吐，痛苦的无以复加。\n"NOR,
HIY"$n"NOR HIY"挟着疾风己神速杀到，那气势仿佛狂风从天而降，又如雷神面目狰狞地驱动雷火四处\n围击山岳振撼，草木尽折，霎时只见狂风大作，尘暴四起，沙石纷飞。\n"NOR,
HIY"$N"NOR HIY"急忙强忍痛楚，以其诡异身法，蹿奔于气漩之间。。。\n"NOR,
HIY"$N"NOR HIY"遂祭起劲气，运至四肢，抢扑向前，“观音乱影”出手，人如飞鸿，围定$n"NOR HIY"旋转起来……\n"NOR,
HIY"$n"NOR HIY"灵念一动，随即变招，猛地旋身弹上半空，脱离$N"NOR HIY"的攻击范围。\n"NOR,
HIY"一阵旋风吹来，$n"NOR HIY"幻影旋起半空，如一团火，在空中燃烧，旋转……\n"NOR,
HIY"$N"NOR HIY"出招受挫，身形急展，倏地收招闪避，改变攻势，不作正面交锋，\n心内暗想：“还想硬拼？我才没这么笨！”\n"NOR,
HIY"$n"NOR HIY"意志坚定，转眼己摄心神，同时祭起内劲在周身如轮运转，\n全身肌肉崩紧贡涨，隐隐有金光索绕。。。\n"NOR,
HIY"$n"NOR HIY"人如旋风，陡地跃身而起，飞射而退。。。\n"NOR,
HIY"$n"NOR HIY"气运一周天，立感周身如有一股劲气狂摧，挣撞着欲冲出体外，\n浑身血管被鼓涨欲裂，$n的肌肉贡张，筋脉搏露涌现……\n"NOR,
HIY"$N"NOR HIY"猛催力劲，双臂突然绞磨疾旋，“绞磨灭绝”疾吐出手，越转越急下，\n劲气凝聚成一道气墙，抗衡着$n"NOR HIY"的$w。。。\n"NOR,
HIY"$N"NOR HIY"耳目极灵，沉身急闪，$l带着风声越顶划过。。。\n"NOR,
HIY"$n"NOR HIY"运起“乾坤无影”劈插格挡，将周身守得固若金汤，$N"NOR HIY"无功而返。。。\n"NOR,
HIY"$N"NOR HIY"穷追猛打，步步进逼，$n"NOR HIY"只能边挡边退，狼狈万分。。。\n"NOR,

});

