金风细雨楼第二次比武大会开始接受报名          了相(ckj) (Fri Oct 29 12:58)
-------------------------------------------------------------------------------
来自 无量功德碑(Board)
 金风细雨楼正式推出全新的一次比武大会, 欢迎大家报名参加! 请大家继续关注
 tls  留言版!

 日期: 11月中旬 (或wiz 将上海站试剑山庄load 到ln后的第一个周末)
 比赛方式: team 比武
 比赛地点: 书剑试剑山庄
 比武项目: 

  一: 门派团体赛:
                 由同门派间的 player 组成, 要求每队至少4人 (可以更多), 队中年龄最大的player 
                 不能超过年龄最小的player 4岁. (即: 如果最小player 为32岁5个月, 则最大的player 
                 只能有36岁5个月) 年龄限制以比赛时为准. 请各位player自己注意控制.
            注: 我在此对hs, mr 等主页对jfxyl 第一次比武大会的报道表示感谢. 但是在报道
            中我看到有"武功强弱一下就分出来了, 为巫师平衡门派提供了很好的依据" 云云.
            idle. 我们不是再三强调了民间比武不能拿来当平衡的依据吗? 否则谁还敢在比武
            中用全力?? 请各位在报道是特别在这一点上手下留情!!! 我们组委会全体成员先在
            这里谢过了. 这次比武我们特意增加了关于年龄的限制, 这样这次比赛比的就不光
            是武功,而且还包括比一个门派的梯队建设, 看它有没有足够的player 能参与进来.

 二: 自由团体赛:
                  对于大多数高手来说, 门派团体赛的年龄限制可能使他们不能参加.
                  因此我们同时将举行自由组队的团体赛. 要求: 每队至多4人, 每队的exp 总和不能
                  超过4 M (如果有哪个老大exp 已经超过4 M, 请速与我联系) exp 以比武时为准, 请
                 大家注意控制.

 三: 比武规则:
                  参赛队将被分为若干小组进行单循环比赛. 小组出线后以淘汰赛方式决出冠军. 比
                  赛时允许所有player 使用任何command, 任何武功 (包括yun lifesave. fear wudang dizi,
                  congra wd dizi), 以及任何在试剑山庄里可以找到的道具, 比赛任何一方的
                  全部player 死亡则比赛结束.  不符合年龄或经验限制的队伍将被取消成绩.
 四: 奖金:

                  门派团体赛: 第一名:   1600 G                        第二名:  800 G                      前四名: 300 G
                  自由团体赛: 第一名:   1000 G    第二名:  600 G                前四名: 200g 
    门派团体赛: 第一名:   1600 G                        第二名:  800 G        前四名: 300 G

 五: 报名方式:
                  a. 所有报名请用email 邮寄到bdd50@hotmail.com (不要在yz post 或 tell taoye 的方
                  式.) 其中请注明: 1. 游槌稍(中文名, id, 以及门派). 2. 到比武时的所有成员的大致
              式.) 其中请注明: 1.队伍成员(中文名,id,以及门派).2.到比武时的所有成员的大致
sorry all...

 五: 报名方式:
                  a. 所有报名请用email 邮寄到bdd50@hotmail.com (不要在yz post 或 
                  tell taoye 的方式.) 其中请注明: 1. 游槌稍(中文名, id, 
                  以及门派). 2. 到比武时的所有成员的大致
                  年龄及经验. 3. 参赛项目 (门派还是自由). 4. 映ぜ坝长的联系方法. 5. 如果有某
                  一天本涌熄无法参赛, 请注明时间及理由. 如果有可能. 组委会将尽量照顾到
                  这一点.
                  b. 报名情况如果需要更改, 请尽快用email 通知组委会, 如果因为通知不及时造成损
                  失, 组委会将不负任何责任.
                  c. 现有组委会组委为 本北 (taoye) 和了相(ckj).  我们需要另外一名组委帮助工作, 有
                  意的player 也请email 到以上地址. 组委会成员将可以参加比武.

 另: 书剑主页及sld 主页里都有关于试剑山庄的描述, 大家可以去看看.
addoil all
addoil all
addoil all
