#include <ansi.h>
int ckiller=4;
mixed names = ({
        ({
        "少林广场","王府路","华藏庵","有所不为轩","紫霄宫大门",
        "天微堂","日月坪","大雪山山谷","六和塔","全真教大门", 
        "墓门","桃花山庄正厅","神龙教大厅","独尊厅","星宿海", 
        "雪山寺山门","一品堂大院","昆仑派山门","五指堂", "玄妙观",
        "朱雀外门","青龙外门","白虎外门","玄武外门","天安门",
        "秘密通道","福威镖局","玄妙观","灵隐寺","泉州南门",
        "灵州南门","诸葛亮殿","烟雨楼","南阳城","佛山南门",                
        "蛇骨塔","长安乐坊","衡阳西街","喜州城","葛鲁城", 
        "伊犁","山海关","老龙头","天山脚下","竹林小舍",
        "丽春院","涌泉寺","听雨轩","五老峰","紫金城",
        "松风观","终南山脚","抱子岩","白马潭","升仙坊",                
        "嘉应门","玄妙观","峻极禅院","侠义厅","萧家桥", 
        "凌霄内门","凌霄殿","峨嵋寝宫","渔家","天心岩",
        "嘉峪关","丝绸之路","黑风口","龙门峰","竹屋",
        "南城","萧然居","铁木真部落","铁木真营帐","黑风口",
        "蒙古草原","回族部落","小溪流","鳌拜府","王府井大街",
        "塘沽口","汝州城","永定门","草莓地","大渡河边",
        "长安乐坊","十字街头","长安城西门","乐府诗社","浣花溪",
        "金牛武馆","锦城驿","南诏德化碑","剑川镇","江畔",
        "玉虚观","星云湖畔","鲁望镇","喜州城","太和街口",
        "葛鲁城","圣湖","忘忧谷","大雪山北麓","华严顶",
        "凌云梯","十二盘","佛山镇街","英雄会馆","北帝庙",
        "福威镖局","榕城驿","向阳巷老宅","终南山主峰","寒水潭",
        "太湖","南浔镇","净慈寺","胡庆余堂","保淑塔",
        "风雷堂","圣姑堂","青龙堂大厅","成德殿","平定州",
        "大字岭","悬空寺","衡阳西街","刘府大院","茶亭",
        "玄坛庙","打谷场","群仙观","莲花峰","莎萝坪",
        "五佛寺","古浪","黄河帮寨门","黄土高原","青城",
        "漪澜堂","归来客栈","太和殿","泰和殿","养心殿",
        "天师洞","松风观","泉州南门","神龙教大厅","峻极禅院",
        "嵩岳寺塔","万景山庄","沧浪亭","紫金庵","寒山寺",
        "玉皇顶","岱宗坊","桃花轩","般若台","九龙壁",
        "澜沧江畔","玄岳门","遇真宫","紫霄宫大门","朝天宫",
        "观景楼","望云台","安抚使衙门","玄武门外门","朱雀门外门",
        "日月洞","逍遥洞","雪山祭坛","雪山寺山门","观星台",
        "燕子坞","听香水榭","扬州武馆","丽春院","草堂寺",
        "终南山脚","普光寺","全真教大门","祝融殿","福严寺",
        "缥缈峰山脚","独尊厅","昆仑派山门","迎风酒店","惊神峰"
        "五指堂","中指峰","无名峰","拇指峰","太白酒楼",
        "盛京城门","赵王府","灵獒宫","巴颜喀拉山","星星峡",
        "居庸关","星星峡","暖阁","皇宫正门","惊神峰",
        "潇湘馆","喜福堂","迎宾楼","囚室","净慈寺",
        "永安寺","坟墓内部","喜福堂","迎宾楼","囚室",
        }),
        });

string ask_jianxi()
{     object guo,ob;
      object *team;
	  int i=0,count=0,minexp,maxexp;
int ckiller;
      string where;
	  guo =this_object();
	  ob=this_player();
	  
	  destruct(present("mi jian",ob));if (ob->query_condition("mjb2_busy")) return "我没有收到任何消息。";
	  
      //too low exp


      if(ob->query("combat_exp")<1000000)
      return  "你的功夫太差了。不要自寻死路!";//too low exp
      team=ob->query_team();
      count=sizeof(team);
	 // write("\n"+sprintf("%d",count));
	  if(count<=1)
      return "就你一个人?"; //too few people
      if(count>=5)
	  return "此事不宜张扬。"; //too many people
	  minexp=team[0]->query("combat_exp");
	  maxexp=minexp;if (ob->query_condition("mjb2_busy")) return "我没有收到任何消息。";
      
	  for(i=1;i<count;i++)
      { if(team[i]!=0)
	  { if(team[i]->query("combat_exp")<minexp)
	    minexp=team[i]->query("combat_exp");
		if(team[i]->query("combat_exp")>maxexp)
        maxexp=team[i]->query("combat_exp");
	  }
	  }
	  if ((maxexp-minexp)>3000000)
      return "你们的武功相差太悬殊。";//exp too far
     //check ok
      
	  where=names[0][random(205)];
	  guo->apply_condition("mjb_busy",30);
	  ob->set_temp("team_count",count);ob->set_temp("tjob",where);
	  ob->apply_condition("mjb_busy",60);ob->apply_condition("mjb2_busy",15);
	  for(i=0;i<count;i++)
	  team[i]->apply_condition("mjb_busy",60);
ckiller=4;
	  for(i=100;i*i*i/10<=maxexp;i++);
         ob->apply_condition("mptjob",23);
	  return    "我刚得到消息，有一伙别派弟子与我派作对。派奸细偷去了我派的机要文件\n"+
		        "你们赶快去"+where+"设防阻截，把他们全部消灭。抢到文件后就地销毁(xiaohui)。\n"+
			    "肯定会有不少别派弟子接应他，多加小心。"; 
}

