【俠客行關外地圖】
                　　　　　　　　　   ︿　　　
                                     ︱
                                     ︿



                                                      白
大                                                    云
門                                      雞            峰
坎＼二                              鐵  冠  鹿      ／  ＼
子  門  滿                          壁─  ─鳴＼玉／  天  ＼龍
    坎─天  谷  白  密  黑  夾      崖  砬  峰  柱          門
        星＼草─  ─  ─風─心      ︱  子      峰＼  池  ／峰
            垛  河  林  口  子      長              ＼  ／
                            ︱      白                梯
                            二      瀑                云
                            龍＼半／布                 峰
                            斗  拉
                                瓢


                              山神廟
                              ／
                           荒路        船廠─冰面─大門坎子
                          ／            ︱
           小巷─北城  荒路      雪地─雪地
           ／     ︱    ︱      ／
       小土屋    集市─東城─雪地
                  ︱    ︱
         香肉館─南城 土窯館
                  ︱
                 木橋
                  ︱
                 大道
                  ︱
                 大道
                ／
             大道
              ︱
             寧遠
            ／
         官道
        ／
     官道
    ／
山海關
    ＼
    老龍頭



