【“俠客行”襄陽城圖】

                                  玄武門外門 
                                      ︱ 
                            北城頭-玄武內門-北城頭 
                                      ︱ 
                    胡同 新羅坊  兵-北大街-茶 馬廄\    小弄 
                     ︱      ︱  營   ︱   館  ︱      ︱ 
              胡同-大街口-北內大街-丁字街口-北內大街-大街口-小弄 
                     ︱                                ︱ 
              書店-西內大街                        東內大街-忠烈祠 
                     ︱                                ︱ 
白  西城頭 兵營 客-西內大街 郭府 安撫使衙門 將軍府 東內大街-鏢 兵營 東城頭  青 
虎    ︱     ︱ 店   ︱      ︱       ︱       ︱      ︱   局 ︱     ︱    龍 
門-白虎內門-西大街--西大街-西大街--中央廣場--東大街-東大街--東大街-青龍內門-門 
外    ︱      ︱      ︱     ︱       ︱       ︱     ︱      ︱      ︱    外 
門  西城頭  大校場  聚義館  當鋪 錢-南大街-學 藥鋪 民-街-民 木匠鋪  東城頭  門 
                                 庄   ︱   堂      宅 道 宅  
                               賭場-南大街-覓香樓
                                      ︱ 
                               兵營-南大街-鐵匠鋪 
                                      ︱ 
                            南城頭-朱雀內門-南城頭 
                                      ︱ 
                                  朱雀門外門

