#include <ansi.h>

inherit ITEM;

void create()
{
	set_name( HIC "『峨嵋山旅游图』" NOR, ({ "luyou tu", "tu" }) );
	set_weight(10);
	if( clonep() )
		set_default_object(__FILE__);
	else {
		set("unit", "张");
                set("long",@LONG         
                        金顶        静修庵
                         |            |
                        云海  后山  山道
                          \     |    / \
          九老洞-小径    山道 后山 山道 山道-药王洞
                   \     /   \  | /   \
                  小径-小径   山道   小溪
                                |      |
蛇窟尽头                 寝室 后门   小溪
   |                      |     |       \
  蛇窟              寝室-花园-后园     瀑布
   |                      |     |        |
蛇窟人口                 寝室 小道     山洞-山洞
   |                            |
 小道-小道-北侧门-北廊--北廊--神灯阁--北廊--北廊-膳房-伙房
                    |           |            |
             禅房-西廊-禅房    后殿    禅房-东廊-厢房
                    |           |            |
        坪   禅房-西廊-禅房   接引殿   禅房-东廊-厢房      藏经楼
        |           |           |            |            /
      小道-西侧门-西廊-西廊-千佛庵大殿-东廊-东廊-东侧门-归云阁
       /            |           |            |
      坪     禅房-西廊-禅房   毗卢殿   禅房-东廊-厢房
                    |           |            |
             禅房-西廊-禅房   文殊殿   禅房-东廊-厢房
                                |
                            千佛庵大门-清音阁-万年庵
                                         |
                                       神水阁
                                         | 
                                        石阶          
                                         |
                     ?               山门殿        
                                         |         
                     ?          玉女峰-山门                         
                                     |  
               保国寺大殿  罗峰山  石坊                                
                    |        |       |               
         凤凰台-保国寺大门-伏虎寺-解脱桥                
                    |
                  广场
                    |
                 解剑石                                  
                    |
                  石阶          
LONG );


		set("value", 50);
		set("material", "paper");
	}
	setup();
}
