一。 五毒教简介
  五毒教是一个十分隐蔽的门派，因为它地处苗疆蛮荒之地，所以
江湖上知道的很少。关于五毒教的种种传说也大多是捕风捉影，因
为一来五毒教徒的活动范围一般都限与苗疆，很少外出；而且五毒
教的弟子也很少正面和人打斗，与五毒教为敌的人许多都会莫名其
妙的死掉，所以江湖上也只是知道存在着这个神秘门派而已。
  但是由于传说五毒教新教主刚刚即位，有意广收门徒，扩展势力，
所以经常派一些教徒到中原来物色根骨好的弟子，所以关于五毒教
的一切才逐渐为人所知。
二。 五毒教拜师指南
  五毒教地处苗疆，位置隐秘，加上沿途艰险，多有狼虫虎豹，毒
雾瘴气弥漫，所以新人如果直接前往拜师，可能凶多吉少。好在教
主曾派人到江湖中物色弟子，玩家可以直接出扬州东门后向南走，
在黑森林外有一个小店，直接拜店里的游方道人，然后
ask dao ren about 五毒教   就可以穿过黑森林，直接到达五毒教
大门口。至于回路怎么过黑森林就要靠自己摸了，但黑森林里有凶猛
的野兽，毒窟里有许多毒虫，所以玩家千万要小心。
  拜完师后就可以学习了，五毒教的功夫以毒为主，其中毒又以养毒
虫为主。教中书房里有书可以读，也可以找毒郎中要《毒经》读。
教中厨房里有免费的食物,饿了可以去(yao),那里也可以灌水。
  等到千蛛万毒手等级达到50以上，经验有15000左右的时候，就可以
到毒窟去驯(xun)一条毒虫来练功。当然刚开始你只能降伏百毒窟的
毒虫，以后等经验高了才可以去千毒窟去，万毒窟的毒虫都是成了一定
气候的，没有个600k-700k经验不要去碰它。
  五毒的毒虫有多种用处，是五毒功夫的重要组成部分。
    1.当经过搏斗降伏一条毒虫(比如 xun chan chu)成功后，就可以
      利用毒虫的毒气练习厉害的千蛛万毒手。
      perform unarmed.suck <毒虫名> 
      五毒教弟子在抵御毒气的同时也能增加一点经验和浅能，同时最重
      要的是毒虫经过你的饲养会越来越厉害，能帮你做很多事情。
    2.你可以命令毒虫做很多事:
         attack  sb.   攻击某人
            sha  sb.   杀死某人     (下这个命令时毒虫会follow对方)
          guard  sb.   保护某人     (单独打guard表示保护自己,毒虫会
                                     在对方突然攻击时主动挡住对手的
                                     攻势， 或者在主人战斗时掩护主人)
           stop        让毒虫停止任务回到自己身边来
  五毒弟子在毒郎中处可以练制(lianzhi)各种毒药，配方可以问毒郎中要毒经
然后see一下。弟子们养的毒虫在退出时可以暂时存(cun)在白髯老者那里，下次
来时再取出来。同时为了方便起见，那里还备有竹篓，玩家可以把虫子放到竹篓
里背着走(shouchong--收，fangchong--放)。
三 五毒教的功夫
   1. 千蛛万毒手
      千蛛万毒手是五毒教的独门功夫，有独门修炼方法。靠吸取毒虫身上的毒
      气来练成毒功，虽然厉害，但毒气会损坏自己的容貌，使自己变的丑陋无比。
     perform qzwd           千蛛万毒     
     perform suck <毒虫名>
   2. 五毒神功
      五毒教必修的一门功夫，五毒弟子就是靠它才可以日夜与毒虫毒药为伴。  
      exert heal  疗伤，另外五毒弟子如果不小心中毒的话也可以用它把毒气化掉
      exert powerup    暂时提升攻击力
      exert bx_arrow   碧血箭  五毒弟子临死的最后一击，将毕生功力汇聚成一股
                               奇毒血箭，喷向对手，不论成功与否使用者都会死
                               亡，而且损失50-100的最大内力
   3. 五毒钩法
      五毒的钩法其实是剑法的一种
      perform suo    金钩锁魂    锁拿对方兵器
   4. 五毒烟萝步
      五毒教祖师模仿毒虫动作而创立的一门轻功
      perform dodge.snake   金蛇游身
   5. 毒技
      也就是用毒的技巧，是五毒教弟子必修的功夫，关系到投毒的成败和暗器的伤害力
四 其他
   1. 玩家如果拜了何铁手为师，就可以向他要含沙射影暗器。
   2. 腾蛟亭墙上的画象据说是教主亲手所画。
   3. 传说五毒教开山祖师最后归隐深山，但没人知道他修炼的地方。
   4. 听说要进万毒窟需要教主亲发的信物才可以。
   5. 据说齐云敖藏有金蛇毒液，不过他不随便给人的。
   6. 听说何红药秘密练制了一种绝毒的毒药，不知道准备干什么。