抢劫之我见                                  慈悲(cibei) (Fri Dec  3 23:25)
-------------------------------------------------------------------------------
来自 大理留言板(Board)
    今天遇到抢劫，duolu north，结果，“慈悲被灭尸正当防卫杀死了”;不理解，被抢劫者要跑，抢劫者倒成了正当防卫。死的不值，本以为“烈士”算不上，起码弄个“勇敢市民”当当，xixi;　　死过一次以后，以为不会再被抢，又从那里路过，结果还是不能通过，又没有钱，灭尸又不肯放我走，只好quit。正好可以考虑一下这个“抢劫”的优劣。
换个角度想一想，如果我在那里抢劫，肯定会死的很难看，也就是说，这个“抢劫”是高手的专利。当然，真正的高手是不屑有这么卑劣的举动的。
真是这样的话，不能不探讨一下wiz弄这个东西(rob)是什么企图，为了高手的发展？还是为了限制新手的成长速度？起码事实上起到了这样两个作用。为什么要这么做？不理解。
我加入书剑的时间不长，下决心玩mud之前，访问了许多mud主页，包括书剑的主页，以及一些书剑玩家的主页。从中可以看出，书剑的wiz在增添内容、完善内容方面花费了不少心思。增添新意，无可厚非，应当鼓励(addoil wiz)，但是每增添一项新内容，要考虑它的合理性以及可操作性。;　　我对这个“抢劫”持有不同意见。并不是说这个“抢劫”完全不好，而是认为应当对可以抢劫者有所限制。;　　我认为，当抢劫者遇到比他还要高的高手路过时，起码要吃点苦头。我想，金庸先生在写小说的时候，如果写到一个高手（无论是大侠还是大魔头）遇到被人抢劫的时候，绝对不会mailu，也不会因为被fang，就不计较此事了。相信大侠会kill 抢劫者，然后解救被拦在那里的受难者，大魔头也会kill抢劫者，怎么处理受难者，也许要看其心情好坏。有一点，我们经常可以在金庸先生的小说里看到那些所谓“魔头”也常常为了自己在某年某月所做的一件好事而沾沾自喜。所以，我有如下建议：;　　１、限制抢劫者的exp。限制线设置在多少，应当考虑到目前本站玩家的平均水平，以不高于平均线2/3为宜，或者可以在800k到1m之间。这样可以让抢劫者有危机感，现实生活中抢劫犯被抓住的概率就很高。;　　２、出于保护新手考虑，应当规定50k或100k（或者年龄１８岁以下）以下的玩家不受路障限制。新手绝大多数没有还手余地，duolu又会被kill，为了保护新手，鼓励玩家，应让新玩家自由发展。（武馆门卫的资助和引路曾经令我热泪盈眶，的确给人很温馨的感觉）;　　３、每抢劫成功一次，抢劫者的神（无论正负）应当相应减少，因为这种行径毕竟不是光彩的。;　　４、exp高于抢劫者的玩家路过此处，应当与抢劫者autokill，这样才符合侠魔之本色，不能等到抢劫者不fang，才与之抗争，焉有高手风范？？被抢者kill抢劫者，应当给被抢者大幅度加神（无论正负）;　　5、抢劫数额应当有一定数目规定，太少对抢劫者不公平，可是50gold实在太多，newbie很难拿出这笔钱，毕竟绝大多数newbie还要靠别人资助才能学习literate，xue gu literate一次居然要5 silver，啧啧，巡城job一次才能xue一次。。。。难道书剑里想造就一批文盲？idle
6、还没想好，希望能有更好的办法。;　　之所以罗嗦了这许多，是希望书剑能够更好地发展，更吸引玩家。虽然我成了这次抢劫中的受害者，但我还会继续玩下去，只希望能够更改以下规则，使它更完善。;　　另：以上建议的出发点是允许抢劫，但是不鼓励抢劫。因为，抢劫本身并不是什么好事，我们的游戏还是要以引人向善为基本出发点。;　　不写了，继续挖泥巴去！addoil cibei;　　#99 addoil 书剑　　　　　　　　　　　　　　　　　　
慈悲 99.12.3
