// paper.c by hubo

#include <ansi.h>;
inherit ITEM;
void create()
{
set_name( HIC "羊皮册子" NOR, ({ "yangpi cezi", "cezi" }) );
set_weight(10);
if( clonep() )
         set_default_object(__FILE__);
else {
    set("unit", "本");
                set("long",
@LONG

城里成千成万的人都死了，神峰里暴君的众卫士和伊斯兰的勇士们都死了。我的

阿里已到了真主那里，他的玛米儿也要去了。我把我们的事写在这里，让真主的儿子

们将来知道，不管是胜或败，我们伊斯兰的勇士们战斗到底，永不屈服！暴君隆阿欺

压了我们四十年。这四十年中，他征了千万百姓来给他造了这座迷城，在神峰中开凿

了宫殿。这些百姓都给他杀了。他死了之后，他的儿子桑拉巴比他更凶狠。伊斯兰教

徒养十头羊，每年要给他四头，养五头骆驼，每年要给他两头。我们一年比一年穷了。

哪一家有美丽的姑娘，就给他拉进迷城中去。进了迷城之后，没一个能活着出来。“我

们是伊斯兰教的英雄儿女，能受这些异教徒的欺压吗？当然不能！二十年之中，我们的

战士曾五次攻打迷城，总是因为不识路径，走不出来。有两次曾攻进了神峰，暴君桑拉

巴却不知使甚么妖法，把我们战士的刀剑都收去了，终于给他的卫士杀得一个不剩。这

一年，我刚十八岁，我爸爸妈妈都给桑拉巴手下的人杀了，我哥哥做了伊斯兰教徒的族

长。春天，我遇见了阿里。他是我族里的英雄。他杀死过三头老虎，群狼见了他就四散

奔逃，天山顶上的兀鹰吓得不敢下来。他抵得过十个好汉，不，抵得过一百个。他的眼

睛像麋鹿那样温柔，他的身体像鲜花那样美丽，可是他的威武却像沙漠中刮的大风。阿

里来到我们帐里，和我哥哥商量攻打迷城。他得到了一部汉人写的书，他说他想了一年，

懂得了武功的道理，就算空手没有刀剑，也能把桑拉巴的武士们打死。于是他招了五百个

勇士，把他想到的道理教给他们，他们又练了一年。这时我已经是阿里的人了。我第一眼

见到他，就是他的了。他是我的心，是我的鲜血，是我的容貌。他对我说，他一见了我，

就知道这次一定能够打胜。他们练好了武功，可是不知道迷城的路径，更加不知道神峰里

的秘密。阿里和我哥哥商量了十天十夜，没有法子。因为外面的人一走进迷城，就给他们

杀了。没一个人能活着出来。大伙儿一起又商量了十天十夜，仍然没有法子。本事再大，

再勇敢，进不了迷城，总是一场空。我说：“哥哥啊，让我去吧！”他们知道我说的是甚么

意思。阿里是大勇士，但他忽然流下泪来。于是我带了一百头山羊，在迷城外面放牧。第

四天上，桑拉巴手下的人就把我捉去献给了他。我哭了三天三夜才顺从他。他很喜欢我，

我要甚么就给我甚么。起初，桑拉巴不许我走出房门一步，但是他越来越喜欢我了。我每

天想念我们的人，想念在大草原中放羊唱歌，那真是快活。我最想念的，是我的阿里。桑拉

巴见我一天一天的憔悴瘦弱，问我要甚么。我说要到各处去逛逛。他忽然大怒，打了我一掌，

于是我有七个白天不跟他说话，有七个黑夜不向他笑。第八天上，他带我出去了，以后每隔

三天，他带我出去一次，先在迷城各处玩，后来甚至到了迷城的口子上。我把每一条道路都

记得清清楚楚，最后，就算我瞎了眼睛，也能在迷城各处来去，不会迷路了。这花了大半年

时光，我想哥哥和阿里一定已等得很不耐烦，可是我还没知道神峰的秘密，后来，我肚子里有

了孩子，那是桑拉巴的孽种。他很喜欢，我却恨得每天哭泣。他问我要甚么，我说：“我给你

怀了孩子，但是你一点也不爱我。”他说：“我不爱你？你要甚么东西，难道我不肯给你么？你

要大海底下的红珊瑚呢，还是南方的蓝宝石？”我说：“人家说，你有一座翡翠池，美丽的人在

池里洗了澡更加美，丑的人洗了就更加丑。”他的脸苍白了，声音颤抖了，问我是谁说的。我骗

他说我做了个梦，是神仙说的。其实，我也不知道是不是真的有翡翠池，不过宫里的女人都这样

偷偷的说，桑拉巴从来不准谁看到，连说也不许说。他说：“去洗澡是可以的，不过谁见到这池子

之后，就得舌头割掉，以免把秘密说了出去，这是祖宗定下的规矩。”他求我别去，我一定要去。

我说：“你心里一定以为我很丑，我在翡翠池洗了澡，你怕我更加丑了。”终于他带我去了。到这翡

翠池，要从神峰的宫殿里经过。我身上带了一把小刀，想在翡翠池中刺死他，因为宫里到处都有凶

恶的卫士守卫，翡翠池四周却一个人也没有，可是小刀给大殿底下的磁山收去了。这样，我知道了

磁山的秘密。我洗了澡后，不知道是不是真的更加美丽些，不过他是更爱我了。但他还是割去了我

的舌头，怕我把秘密说出去。我知道了一切，但没法去告诉哥哥和阿里。我日日夜夜向真主祈祷，

真主终于听见了他可怜女儿的声音。真主赐给了我聪明智慧。桑拉巴有一把短剑，佩在身上从不离开。

这柄短剑有两层鞘子，里面一层鞘子就像是一把剑一般。我向他讨了来。我画了一张迷城的地图，把进

出的通道仔仔细细的画在上面，我把地图封在一颗蜡丸里，藏在第二层剑鞘里面。在我生了孩子的第三

个月，他带我出去打猎。我乘没人见到，就把短剑丢在迷城外面的腾博湖里。我回来之后，放了许多鹰

出去，在鹰脚上都写上了“腾博湖”的名字。有几头鹰被桑拉巴手下人射了下来，他们见到“腾博湖”的名

字，心想腾博湖很出名，大漠上几岁的孩儿也都知道，所以也不起疑心。我知道这许多鹰中，一定会有

一两头给我们族里的人捉到，哥哥和阿里就会到腾博湖中去仔细找寻，就会知道迷城的路径。唉，哪知

道他们虽然找到了短剑，却查不出剑中的秘密，不知道剑鞘中另有剑鞘。哥哥和阿里说，我送这把剑出

来，定是叫他们进攻，去杀暴君桑拉巴。他们就攻了进来。大部分勇士都迷了路，转来转去永远没能出

来。我的哥哥，我那力气比两头骆驼还要大的哥哥，就这样迷失了。阿里和其余勇士捉到了一个桑拉巴

的手下，迫着他带路，攻进了神峰。在大殿上，他们的刀剑都被磁山收了去，桑拉巴的武士拿玉刀玉剑

来杀他们。然而阿里和他的勇士学会了本事，虽然空手，仍是一个个的和他们一起战死。桑拉巴见他手

下的武士都死了，阿里又紧紧迫着他，就逃进玉室来，想带我从翡翠池旁逃出去，阿里追了上来，我一

见到他，忍不住就扑上去。我们抱在一起，他用许多好听的名字来叫我，我没了舌头，不能还叫他，可是

他懂得我心里的声音。那卑鄙的桑拉巴，可恶的桑拉巴，比一千个魔鬼还要坏一万倍的桑拉巴，突然从后

面一斧，将我的阿里的头砍成了两半，他的血溅在我身上。桑拉巴从床上抱起孩子，放在我手里，叫道：

“咱们快走！”我举起那个孽种，用力往地下一摔，他就死在阿里的鲜血堆里。桑拉巴见我摔死了自己的儿

子，惊得呆了，举起了黄金的斧头，我伸长了头颈让他砍，他忽然叹了口气，从来路冲了出去。阿里到了

真主身旁，我也要跟他去。我们的勇士很多，桑拉巴的武士都被我们杀光了，他一定也活不成。他永远不

能再来欺压我们伊斯兰教徒。他儿子给我摔死了，他的后代也不能来欺压我们，因为他没后代了。以后我

们的人就能在沙漠上草原上平安过活，年轻姑娘可以躺在他心爱的人怀里唱歌。我哥哥、阿里和我都死了，

可是我们已打败了暴君。暴君的堡垒造得再坚固，我们还是能够攻破。愿真神安拉佑护我们的人民。
LONG
);
set("value", 1);
set("material", "paper");
}
setup();
}

