string place = "";
string the_nation = "";
int all = 0;
int select_quest();
string create_waidi();
string jiuming();
int not_wizard(object ob);
string eur_nation();
string ind_nation();

nosave mixed *story;

nosave string *special_stone = ({
        "/clone/gift/cjade",
        "/clone/gift/cagate",
        "/clone/gift/ccrystal",
        "/clone/gift/cdiamond",
        "/clone/gift/jiuzhuan",

});

mapping place_npcfile = ([
        "北京东城" : "/d/beijing/npc/",
        "北京西城" : "/d/beijing/npc/",
        "扬州城"   : "/d/city/npc/",
        "长安城"   : "/d/changan/npc/",
        "成都城"   : "/d/city3/npc/",
        "苏州城"   : "/d/suzhou/npc/",
        "杭州城"   : "/d/hangzhou/npc/",
        "襄阳城"   : "/d/xiangyang/npc/",
        "大理一带" : "/d/dali/npc/",
]);

nosave string *all_jiuming = ({
        "带着哭腔叫喊：『强盗！强盗啊！！』",
        "声嘶力竭地大喊：『杀人啦！救命啊！！』",
        "狂吼：『你们不让我活，我就跟你们拼了！！』",
        "害怕地尖声嘶叫，四处飞奔！",
        "操着尖刀疯狂飞舞，挡住身后的钱箱不肯退却半步！",
        "飞奔回家关上房门，用桌椅死命顶住，急急忙忙的收拾金银细软。",
        "胸口被砍了一刀，鲜血狂喷而出，痛极呼叫！",
        "听到吵闹声，不知道发生了什么事情，伸长了脖子四处张望。",
        "四下探望，找准了退路，方才东张西望的查探动静。",
        "看见人群涌了过来，虽然不明事由，仍然拔足飞奔，兀自喊着：『打来了！打过来了！』",
        "抽出兵器，挡在胸口，拨开人群上前探个究竟。",
});

nosave string *woman_jiuming = ({
        "声嘶力竭的叫喊：『流氓！流氓啊！！呜呜！！！』",
        "尖声惊叫：『不要，不要啊！救，救命！！』",
        "凄惨地唉声痛哭：『呜呜，我不要活啦，让我死了算了！！』",
        "哭喊着：『我杀了你们，我跟你们拼啦！』",
        "低声抽泣着，目光呆滞。",
        "四处躲藏，浑身颤抖，抓起泥土就往脸上涂抹。",
        "紧咬牙关，一声不吭，抓起一把刀就冲了出去。",
});

nosave mixed *all_story = ({
({
        "日子过了一天又一天，福州的海港日夜繁忙，人来人往，熙熙攘攘。",
        "晚风煦暖，吹过这万顷起伏的碧绿海涛，卷起漫天白絮，洋洋洒洒四处飘荡",
        "一艘外形奇特的三桅帆船静悄悄的驰来，静悄悄的靠了岸。",
        "片刻之后......",
        "数十个人鱼贯而出，顺着踏板来到码头，很快融入茫茫人海中。",
        "三桅帆船复又起航，逐渐消逝在海平线上。",
        "福州海港一切如常，人群照常忙碌着，谁也没有注意到方才一幕。",
        "只有一双眼睛，始终注视着这一切，人海中，一条人影跟随着一群人往前挤进...",
        "南海竹屋：一个瘦长身影疾步近来，屈膝挺腰：『报！福州海港发现一群神秘人来访中华！』",
        "南海神尼微诧，旋即扬起眉毛，凝神倾听，目光示意探子继续...",
        "『据福州飞鸽传讯，此群人貌相装束似乃外邦，形迹可疑，行程目的尚待查访！』",
        "南海神尼轻点下颌，闭目凝思，旋即下令：『加派人手，详查！』",
        "探子微一俯腰，挺身离开...",
        "place，热闹繁华，悄无声息中，数十个陌生人混进城门...",
        "突然，陌生人全部甩掉披风，拔出雪亮的兵刃，其中一个抬脚踹飞身边的小摊！",
        "............",
        "人群炸开了锅，百姓四处逃窜，妇孺尖叫声四起。",
        (: create_waidi :),
        (: jiuming :),
        (: jiuming :),
        (: jiuming :),
        (: jiuming :),
        (: jiuming :),
        "据说一批来自 the_nation 的侵略者来到了中国！",
        "根据前线最新报告，这批入侵者目前在 place 出没频繁！",
        "各位同胞，团结起来！紧握手中武器，奋勇杀敌，将胆敢侵犯我们中华的敌人全部消灭！",
}),
({
        "伦敦郊外，某处庄园内，英皇乔治廿三正与情妇——某男爵夫人幽会中。",
        "乔治廿三（甜言蜜语）：『哈尼，贝比，卖辣腐......』",
        "男爵夫人（搔首弄姿）：『亲爱的皇上，我漂亮吗？』",
        "乔治廿三使劲地点着头，连声说道：『漂亮，漂亮，非常的漂亮！』",
        "男爵夫人：『要是穿上来自中国的丝绸，那就更漂亮啦！』（作小鸟依人状）",
        "乔治廿三（用力挠着稀疏的头发）：『近日国库空虚，这......』",
        "男爵夫人（撒娇）：『不嘛！我就要中国的丝绸！』",
        "乔治廿三被缠得没了办法，一咬牙、一顿足：『好好好，我去想办法！』",
        "听了乔治廿三的话，男爵夫人颤声问到：『真的？』惊喜之情溢于言表。",
        "乔治廿三用力拍着瘦骨嶙峋的胸脯，努力作大丈夫状：『君无戏言！』",
        "『欧，达令，爱老虎油！』男爵夫人马上扑入乔治廿三怀里，一顿乱啃......",
        "第二天，乔治廿三返回皇宫，传令大赦天下死囚。",
        "乔治廿三亲自接见这批亡命之徒，酒肉款待，还每人发给两枚金币作为路费。",
        "被赦囚徒感恩戴德，一个个向天发誓，对英皇死命效忠。",
        "次日，武装到牙齿的囚徒们离开伦敦，坐船自朴茨茅斯港出发，向着东方进军。",
        "三数个月后......",
        "place，热闹繁华，悄无声息中，数十个陌生人混进城门...",
        "突然，陌生人全部甩掉披风，拔出雪亮的兵刃，其中一个抬脚踹飞身边的小摊！",
        "............",
        (: eur_nation :),
        (: create_waidi :),
        (: jiuming :),
        (: jiuming :),
        (: jiuming :),
        (: jiuming :),
        (: jiuming :),
        "据说一批来自 the_nation 的侵略者来到了中国！",
        "根据前线最新报告，这批入侵者目前在 place 出没频繁！",
        "各位同胞，团结起来！紧握手中武器，奋勇杀敌，将胆敢侵犯我们中华的敌人全部消灭！",
}),
({
        "『老大～～！老大～～～！』",
        "天竺某城贫民窟，一个小混混一路喊着跑了进来。",
        "老大出现，一把揪住混混，不悦的问：『什么事这么慌张？』",
        "混混喘着粗气：『老...老大，有...有达摩那家伙的消息啦！』",
        "『那个拖欠了我们很多保护费的达摩？他躲在哪里？』老大恨恨的道。",
        "混混抹了把汗：『原来他...他跑到了震旦，现在那里叫中...华。』",
        "『咦？』老大有些迷惑的道：『中......华？』",
        "『据说他现在混上了中华什么寺的掌门，手下也有百十号人马。』",
        "『哦？』老大愤愤不平：『达摩这玩杂耍的小子，居然也能......』",
        "混混色迷迷地看着远方：『据说中华黄金遍地、美女如云，达摩那家伙...』",
        "『啧啧......』老大舔了舔自己嘴边的「哈喇滋」。",
        "四周的人忽啦一下全围了上来，流着口水：『......』",
        "老大愣了半晌，忽然一挥手，怪吼一声道：『兄弟们，一块去中华打拼啊！』",
        "周围的地痞流氓混混无赖们轰然响应，纷纷抄起了家伙。",
        "一伙人浩浩荡荡的往中华进发......",
        "place，热闹繁华，悄无声息中，数十个陌生人混进城门...",
        "突然，陌生人全部甩掉披风，拔出雪亮的兵刃，其中一个抬脚踹飞身边的小摊！",
        "............",
        (: ind_nation :),
        (: create_waidi :),
        (: jiuming :),
        (: jiuming :),
        (: jiuming :),
        (: jiuming :),
        (: jiuming :),
        "据说一批来自 the_nation 的侵略者来到了中国！",
        "根据前线最新报告，这批入侵者目前在 place 出没频繁！",
        "各位同胞，团结起来！紧握手中武器，奋勇杀敌，将胆敢侵犯我们中华的敌人全部消灭！",
}),
});

