// Room: /u/jingx/workroom.c
// This is a room made by roommaker. write by Fan. :)

inherit ROOM;

void create()
{
        set("short", "½ðÁÛ³Ø");
        set("long", @LONG
                ¾ÅÏöýˆÒ÷ó@Ìì×ƒ£¬ïLë…ëH•þœ\Ë®ÓÎ
       ½ð÷[ØMÊÇ³ØÖÐÎï£¬Ò»ÓöïLë…±ã»¯ýˆ
    ¿´µ½ÕâÀï£¬¹´ÆðÇ°³¾ÍùÊÂ£¬Äã²»½û¸ÅÌ¾£¬ÕæÄË³ÉÒ²·çÔÆ£¬°ÜÒ²·çÔÆ£¡
ÐÄÖÐ²»½ûÔÙ´ÎÏÆÆð¼¸·Öã°âê£¬¼¸·ÖÈôÓÐËùÊ§...
  ÄþÔ¸ÖÍÁôÔÚ´Ë´¦ ÄþÔ¸½ÐÊ±¼äÖÐÖ¹,ÎÒ²»»áÔÙÐÅÎ´À´ ÎÒ²»ÒªÔÙ¿´ÀúÊ·
  »¹ÄÜ»î²ÅÊÇ·í´Ì ¹Ê´Ë²»ÓÃ×öÉµÊÂ,ÈÃÍ´¿à ÂÖÇ§´Î ÕÃÏÔÄÇ¿ìÀÖÓÐ¾¡Ê±
  Êï¹âÈ«²¿Ï¨Ãð É±µôÎÒÓ°×Ó,ÎÒÖ»ÄÜ¶À´¦ ±³ºóÈ«Ã»ÓÐÖ§Öù
  Ê²Ã´½Ð¾øÍû Ì§ÆðÑÛÍûÍû,Èç½ñÎÒÔÚÄãÃæÇ°³ÊÌÃ Ëæ±ãÊÕ¿´
  Áé»ê±»³é¸É ²ÐÁô×ÅÇû¸É,´Ó´ËÓëÎ´ÁËÔ¸Í¬´æÍö µØÀÏÌì»Ä
  »¹²»¹»¾øÍû ÉÐ¿É¸ü¾øÍû,Áô¸øÎÒÈÕºóÓÃÀ´ÐÎÈÝÇ°Ãæ¾³¿ö 
  Î´·Å¿ª ÌáÇ°ÊÍ·Å   ½«½öÓÐÔ¸Íû¶¼·ç¹âéçÔá
LONG
);
        set("item_desc", ([ /* sizeof() == 1 */
  "di" : " 1  ÑïÖÝ¡¸´óéÅÊ÷¡¹     2  ¡¸Î×Ê¦ÐÝÏ¢ÊÒ¡¹     3  ¡¸  ôä´ä³Ø  ¡¹
4  ¡¸»Æ½ð¸«¡¹         5  ¡¸ºé»Ä¹ÅÔó¡¹       6  ¡¸ÎäÁÖ´ó»á¹ã³¡¡¹
7  ¡¸ÒÆ»¨¹¬ÑûÔÂ¡¹     8  ¶ëáÒ¡¸Ãð¾ø¡¹       9  ÉñÁú½Ì¡¸ºé°²Í¨¡¹
10 ¡¸ÌÒ»¨É½×¯Ä¹ÊÒ¡¹   11 ¡¸È«Õæ½ÌÍõÖØÑô¡¹   12 ¡¸ÐÇËÞº£¡¹
13 ÉÙÁÖ¡¸´ïÄ¦¶´¡¹     14 Ñ©É½ÅÉ¡¸Ð¡ÖÇ¡¹     15 ¡¸Å·Ò±×Ó¡¹
16 Îäµ±¡¸½ðµî¡¹       17 åÐÒ£ÅÉ¡¸åÐÒ£×Ó¡¹   18 ÌìÁúËÂ¡¸¿ÝÈÙ¡¹
19 »ªÉ½ÅÉ¡¸·çÇåÑï¡¹   20 °×ÍÕÉ½¡¸ÉñÉß¡¹     21 Ä½ÈÝ¼Ò¡¸Ä½ÈÝ²©¡¹
22 áÔÉ½ÅÉ¡¸¾þ¼«ìøÔº¡¹ 23 »ªÉ½¡¸¹×Ä¾¡¹       24 ÈªÖÝ¡¸ÉñÄ¾¡¹
25 À¥ÂØÅÉ¡¸ºÎ×ãµÀ¡¹   26 Îå¶¾½Ì¡¸ºÎÌúÊÖ¡¹   27 ¡¸´óÀí¶ÎÕý´¾¡¹
28 ¡¸±ù»ðµºÐ»Ñ·¡¹     29 Ã÷½Ì¡¸Ê¥»ðÌÃ¡¹     30  ¡¸ÌìÏÂÎÞË« ¡¹
31 Ì©É½¡¸·âìøÌ¨¡¹     32 ÁéðÕ¹¬¡¸±Õ¹ØÊÒ¡¹ ¹ 33  ¸ß²ý¡¸Ñ©Ñ©¹È¡¹
34 ºÚÄ¾ÑÂ¡¸¹ë·¿¡¹     35 ¡¸¹íÃÅ¹Ø¡¹

",
]));
        set("valid_startroom", 1);
        set("exits", ([ /* sizeof() == 45 */
  "1" : "/d/city/chatroom",
  "2" : "/d/wizard/wizard_room",
  "3" : "/d/gaochang/room41",
  "13" : "/d/shaolin/damodong",
  "4" : "/d/gaochang/room34",
  "lon" : "/u/lonely/workroom",
  "love" : "/u/lovet/workroom",
  "a" : "/u/anqt/workroom",
  "bad" : "/u/bad/workroom",
  "ken" : "/u/ken/workroom",
  "me" : "/u/meteor/workroom",
  "sin" : "/u/sinb/workroom",
]));
        set("channel_id", "½ðÁÛ³Ø");
        set("outdoors", "xyju");
        set("freeze", "1");
        set("no_clean_up", 0);
        set("wiz_only", "1");

        setup();
        replace_program(ROOM);
}

