


【系统】林震南(Lin zhennan)：会飞的鱼护镖获得经验742500，潜能236300，声望101300。
【系统】林震南(Lin zhennan)：咖啡护镖获得经验1064000，潜能448000，声望224000。
【系统】林震南(Lin zhennan)：会飞的鱼护镖获得经验540000，潜能288000，声望144000。
【系统】萧峰(Xiao feng)：酷比在萧峰任务中获得奖励2390200点经验，1249799点潜能，86600点江湖声望。
【系统】萧峰(Xiao feng)：鬼七在萧峰任务中获得奖励1599700点经验，985771点潜能，76100点江湖声望。
【系统】慕容复(Murong fu)：澄身在慕容任务中获得经验：36200、潜能：4500。
【系统】慕容复(Murong fu)：澄身在慕容任务中获得经验：62600、潜能：7800。
【系统】林震南(Lin zhennan)：咖啡护镖获得经验748000，潜能528000，声望88000。
【系统】慕容复(Murong fu)：澄身在慕容任务中获得经验：26300、潜能：3200。
【系统】慕容复(Murong fu)：澄身在慕容任务中获得经验：86100、潜能：10700。
【系统】林震南(Lin zhennan)：会飞的鱼护镖获得经验441000，潜能189000，声望126000。
【系统】萧峰(Xiao feng)：鬼七在萧峰任务中获得奖励935400点经验，392688点潜能，22600点江湖声望。
【系统】林震南(Lin zhennan)：段肠人护镖获得经验450000，潜能157500，声望45000。


