// n_area.h by konn

string *n_area_msg = ({

// n_area0.c
    "这里是通往南镇城的重要通道, 人来人往热闹非凡, 狭窄的街道已被挤得水\n"+
    "泄不通, 北方则是闻名天下的金刀门, 若您往东走可到达枫林港口, 往南行\n"+
    "则可至中央广场, 愈南愈充满了神秘的色彩。\n\n",

// n_area1.c
    "只见商人们成群结队的从这里徐徐而过, 小贩的叫卖声, 让你觉得这里真是\n"+
    "个繁荣的地方啊! 观光的旅客亦不少, 个个身穿华丽的衣裳, 走在街上更觉\n"+
    "得炫目耀眼, 一阵清风而过, 你更感到神清气爽。\n\n",

// n_area2.c
    "此处是个歇息赏景的好地方, 远眺青山, 耳听鸟鸣, 心中有说不出的轻松愉\n"+
    "快, 头顶跚\跚\飞过的雁儿, 更点缀了轻松惬意的画面, 站在这里向小贩讨了\n"+
    "碗水喝, 擦擦额头的汗渍, 也该准备启程了。\n\n",

// n_area3.c
    "由此处望南而去, 便是中央广场了, 那里可是全国属一属二的繁华地区, 那\n"+
    "里最出名的土产便是红茶了, 听说连当今天子都喜欢喝那里所出产的红茶, \n"+
    "您何不也到那里品嚐品嚐呢? \n\n",

// n_area4.c
    "到这里已渐渐安静下来, 没有西大街东半部如此的喧哗嘈杂, 但旅人依然不\n"+
    "少, 你可以悠闲的在这里散步着, 从这里往东而去, 便是这闹非凡的西大街\n"+
    "往西行去, 则是进入鲜有人迹的乡下地方。\n\n",

// n_area5.c
    "当你尚未到达此处时, 老远就看到一老一少两丐蹲在这里, 老的约七八十岁\n"+
    "了, 小的大约只有六七岁, 不知道什么原因使得他们得沿街乞讨为生, 看他\n"+
    "老少两人面黄肌瘦的, 就发个慈悲心赏几个子儿给他们吧!\n\n",

// n_area6.c
    "沿途走来发觉人烟已渐渐稀少, 偶而看到几位顽童在路边玩耍嬉闹着, 由\n"+
    "此再往南而下已算是乡下地方, 住家也只也两三户而已, 或您想买些什么\n"+
    "东西的话, 相信往东走会是比较好的选择。\n\n",

// n_area7.c
    "在这里你可以看到乡下人的纯朴生活, 将他们与富贵人家相比, 更显出他\n"+
    "们的朴实, 只见到三两只山鸡在你身边不远处在找寻着食物, 一步一啄的\n"+
    "慢慢地找着, 东边就是一家民房, 西边则是一片小山坡。\n\n",

// n_area8.c
    "这里是一个凸起的小山坡, 只见满地都是野姜花, 参杂着一些含羞草, 站\n"+
    "在这里往东一看, 一栋民房座落在山坡不远处, 屋顶是以片片棕红瓦片所\n"+
    "盖\, 远远望去像是一片枫树林。\n\n",

// n_area9.c
    "走到这里, 向前已经没有路了, 只见前面一片树林, 葱翠的树木半遮着森\n"+
    "林的一条小路, 往西而去也是树林一片, 这里离开了繁华热闹的市区, 让\n"+
    "你感到十分的舒畅, 但又觉得不太习惯。\n\n",

// n_area10.c
    "这里是一大片树林, 茂密的树叶将光线遮住了, 使你看不清你现在的位置\n"+
    ", 听得脚底下一些不知名的虫儿叽叽、叽叽的叫着, 配合着节奏的韵律, \n"+
    "到也满有趣的, 但这个地方不适合久留啊。\n\n",

// n_area11.c
    "这里是一片原始森林, 树木长得又茂盛又翠绿, 在这里不但可以避开外头\n"+
    "那酷热的阳光, 又可以在这里睡个午觉, 岂不妙哉? 但这里却是猛兽时常\n"+
    "出没的地方, 还是小心点好。\n\n",

// n_area12.c
    "浓密的草木挡住了前方的去路, 远方一思幽幽的光线照了过来, 前面好像\n"+
    "有住家的样子, 你心里一阵低咕「谁会住在这种地方呢? ”你不禁想向前\n"+
    "走去好探个究竟。\n\n",

// n_area13.c
    "这座洞窟结构像是天然所形成的, 这里住了一位为了避世的世外高人, 他\n"+
    "就是当今朝庭的国师, 因曾数次与皇上意见相突, 又遭小人毁谤, 因此隐\n"+
    "居在这小山洞里, 不问世事。这洞里的中央摆\了一张青石板所磨制的桌子\n"+
    ", 另加几张石椅, 角落则放了一张木床, 洞里冬暖夏凉, 极为舒适。\n\n",

// n_area14.c

    "\n\n",

// n_area15.c

    "\n\n",

// n_area16.c

    "\n\n",

// n_area17.c

    "\n\n",

// n_area18.c

    "\n\n",

// n_area19.c

    "\n\n",

// n_area20.c

    "\n\n",

// n_area21.c

    "\n\n",

// n_area22.c

    "\n\n",

// n_area23.c

    "\n\n",

// n_area24.c

    "\n\n",

// n_area25.c

    "\n\n",

// n_area26.c

    "\n\n",

// n_area27.c

    "\n\n",

// n_area28.c

    "\n\n",

// n_area29.c

    "\n\n",

// n_area30.c

    "\n\n",

// n_area31.c

    "\n\n",

// n_area32.c

    "\n\n",

// n_area33.c

    "\n\n",

// n_area34.c

    "\n\n",

// n_area35.c

    "\n\n",

// n_area36.c

    "\n\n",

// n_area37.c

    "\n\n",

// n_area38.c

    "\n\n",

// n_area39.c

    "\n\n",

// n_area40.c

    "\n\n",

// n_area41.c

    "\n\n",

// n_area42.c

    "\n\n",

// n_area43.c

    "\n\n",

// n_area44.c

    "\n\n",

// n_area45.c

    "\n\n",

// n_area46.c

    "\n\n",

// n_area47.c

    "\n\n",

// n_area48.c

    "\n\n",

// n_area49.c

    "\n\n",

// n_area50.c

    "\n\n",

// n_area51.c

    "\n\n",

// n_area52.c

    "\n\n",

// n_area53.c

    "\n\n",

// n_area54.c

    "\n\n",

// n_area55.c

    "\n\n",

// n_area56.c

    "\n\n",

// n_area57.c

    "\n\n",

// n_area58.c

    "\n\n",

// n_area59.c

    "\n\n",

// n_area60.c

    "\n\n",

// n_area61.c

    "\n\n",

// n_area62.c

    "\n\n",

// n_area63.c

    "\n\n",

// n_area64.c

    "\n\n",

// n_area65.c

    "\n\n",

// n_area66.c

    "\n\n",
});

string n_area(int i)
{   return n_area_msg[i];   }

