天地会任务以下简称tdh job


设计思路：
    前提：如果要做tdh job，则不可以同时做gf job，xs抢mm job。
    理由：gf和tdh对立，抢mm违背tdh 宗旨。其他暂时还没想到。

    天地会共有10个堂口。10个堂口都可以向堂主领任务。
    流程：

1：领到任务：
随机产生一个npc甲，
任务描述：联络该npc。

2：找到该npc,将有两个任务分支：
	A分支：另外随机产生一个npc乙-> 3A
	       任务描述：继续联络该npc乙/或保护乙。

	B分支：去另外一个分堂联络。-> 3B

3A： 找到第二个npc乙后两个分支：

	Ax分支:返回第一个随机npc甲。
       		描述：一起到甲处。
       		路上偶尔官兵阻杀，返回甲处后，会出现大批官兵。
       		与甲乙两npc合力杀掉官兵，任务完成。
	Ay分支:出现官兵缉拿第二个npc乙，
       		描述：保护乙。
       		杀掉官兵，保护成功，任务完成。

3B：到达第二个分堂地点
	a: 出现官兵截杀。杀死官兵后：联系第一个分堂。任务完成。
	b: 寻找随机npc丙：找到后，帮助该npc杀死官兵，任务完成。



相关资料：

陈近南道：“本会共有十堂，前五房五堂，后五房五堂。前五房莲堂，洪顺堂、家后堂
、参太堂、宏化堂。后五房青木堂、赤火堂、西金堂、玄水堂、黄土堂。九堂的香主都
已聚集在此。

那前五房中，长房莲花堂该管福建，二房洪顺堂该管广东，三房房家后堂该管广西，四
房参太堂该管湖南、湖北，五房宏化堂该管浙江。后五房中，长房青木堂该管江苏，二
房赤火堂该管贵州，三房西金堂该管四川，四房玄水堂该管云南，五房黄土堂该管中州
河南。天地会为郑成功旧部所组成，主力在福建，因此莲花堂为长房，实力最强，其次
为两广、两湖，更其次为浙江、江苏。

莲花堂香主蔡德忠
洪顺堂香主方大洪
家后堂香主马超兴
参太堂香主胡德第
宏化堂香主李式开 矮小瘦削，说话很轻，骂人也不多，

青木堂尹香主
赤火堂香主古至中  属下： 邝天雄
西金堂 书上找不到
玄水堂香主林永超
黄土堂香主姚必达

蔡德忠一笑，伸手轻轻一弹自己额头，道：“对，对，一说起旧事，就是没了没完。现
下我读『三点革命诗』，我读一句，你跟著念一句。”当下读诗道：“三点暗藏革命宗，入
我洪门莫通风。养成锐势从仇日，誓灭清朝一扫空。”韦小宝跟著念了
会中的三十六条誓词，十禁十刑，二十一条守则，

 陈近南微笑道：“这是唯恐误打误撞，真有人向他去买『清毒复明膏药』。他一听你还
价黄金五两，白银五两，便问：『为什么价钱这样贵？』你说：『不贵，不贵，只要当真复
得了明，便给你做牛做马，也是不贵。』他便说：『地振高冈，一派溪山千古秀。』你说：
『门朝大海，三河合水万年流。』他又问：『红花亭畔哪一堂？』你说：『青木堂。』他
问：『堂上烧几柱香？』你说：『五柱香。』烧五柱香便是香主。他是本会青木堂的兄弟，
属你该管。你有什么事，可以交他办。”

