
inherit ROOM;


void create()
{
	set("short", "栖霞宫");
	set("long", @LONG
栖霞宫原名云升宫，位于云阳县城西北5千米处。始建于汉代
，南北朝以来屡加修建，规模宏伟，是道教全宗派的著名宫寺之一
。整个宫寺建于山巅，四周青松环绕，建筑翘檐飞角，画栋雕梁，
楹柱高大，基石均由虎豹装饰，栩栩如生。宫内祀元始天尊、太上
老君等道家鼻祖坐像，正殿内有一巨型炼丹炉，寺内遍挂名家楹联
诗刻。传说汉扶嘉曾避秦乱隐居于此，离开时种下一棵罗汉松，松
至今仍傲然挺立，四季长青，栖霞宫除正殿外，有系虎石、金盘池
、萝龙井、舍身岩、狐狸洞、听松壁等多处古迹名胜。 
 

LONG);
	
	set("exits", ([
		"north" : "/d/jiujiang/shanlu1",
                "south" : __DIR__"tulu2",
	]));
    
	set("outdoors", "qiuci");
	setup();
	replace_program(ROOM);
}
