小小建议                                     渡轻(easy) (Mon Jan 10 18:50)
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
来自 少林弟子留言板(Board)
最近，看到少林被cut 的post 特多，真是可叹呀！;最近，看到少林弟子走的也特多，真是可悲呀！;我以为要cut的总归要cut ,要走的总归要走并没有什么;要伤心的;对于cut 我想说说我的看法（个人意见）;我认为被cut 原因只有一个----自己太买弄，别人看不过,;要求wiz cut。当然了，有的时候确实不是自己的原因，就是;自己厉害了，人家眼红了，天天说要cut，wiz 当然也没有;办法了。只有cut 了。对于这样的cut 最简单，谁嚷的最厉害;就杀了谁，agree?要是自己太买弄就不能怪别人了，那就只有;自任倒霉了。;还有，对于武功是不是真的要平衡，我认为作为现在的mud，;真的没有说是特别公平的，所以我想引用great(书剑老少林）;对我说的一端话，希望能给大家一点启示。;原话记不大清楚了，大致意思是这样的：我当时想到上海玩;就问他到哪个门派比较厉害，他的回答是都一样厉害，我当时;很迷惑，因为早就听说上海的某个门派特厉害了，于是我就追;问他为什么，他的回答是“武功的强弱可以用 pk 来找平衡”;这句话对我的启发很大，就想市场经济一样，如果mud 中有的;门派特别厉害，那就定期去屠杀一次，不让他出高手呀，agree?;现在有tk 更是好了，少林的武功虽然面，但是人多呀，人海;战术不光是在星际争霸中好用，mud 中也是一样呀;不知道我的post 对现在还在奋战的战友们有没有点提示？
;                                   个人浅见
----少林渡轻敬上
2000.1.10
