感悟泥潭                                 趙浪-vingp(Thu Sep 17)
----------------------------------------------------------------------
    暑假至今，趙浪此人身陷泥潭，不經意間，也已長大成人。
    其歷經江湖四年風雨。現如今，雖非蓋\世武功\，但也并非泛泛之輩。想當年，
幼小體弱，連只兔子也得讓其三分，溜之大吉。往事不堪回首。現如今也能一劍
斃之取其肉以饗天下英雄好漢。
    憶當年，趙浪此人呱呱墮地于世間。年幼無知,不善言語。semote除會用hi與
bye之外，就是些不倫不類的胡語亂語，其口齒之呆滯，使人啼笑皆非。令人心慰
的是，他倒痴于練武，心誠可見，實屬不易。十五歲經驗達三千多。十六歲達一萬
多，然而武功\技能卻不敢恭維。因而，十六歲后，他就不敢再留戀經驗而苦練技能
4，到了十八歲，也算略有小成。
    此人成長過程，先前口齒不靈。不料，后來，他卻頑皮成性，不通世務。練武
之余，游山玩水，行跡江湖，沾花惹草。此天性，對其實在無可奈何。此人性格也
令人琢磨不透，時而對人heihei一下，時而又對人love個不停。時而沉默不語，時
而又用semote拂亂一陣。實在很想扁他一頓。
    如今，他也已長大成人，正值青春年少之際。實想覓一紅塵知己，雨夜風晨，
花前月下。無奈其所識之女俠，要么\為未成年少女，要么\就已為人妻。實為一大
憾事。或許\一日，萍水相逢。嘻！嘻！
    曾經見過太多的離別，并且也為趙浪疲憊不堪。不知怎么\也有些老之感。實
想，催促趙浪金盆洗手、退隱江湖，無奈于心有所不忍。久之，越陷越深。世耶？
夢耶？
    泥潭春光無限好，mud秋雨几多愁!
    路漫漫其修遠，吾將上下而求索！.

