inherit ROOM; 
 
#include <ansi.h>
void create() 
{ 
        set("short", "¾«Áé½ç");
        set("long",
"[1;32mÕâÀïÊÇÒ»¸öÒìÊÀ½ç£¬À´µ½ÕâÀï£¬ÒÑ¾­Ô¶ÀëÁËÄãµÄ½­ºş¡£ÕâÀï\n"
"Ã»ÓĞ¶÷Ô¹£¬Ã»ÓĞ·×Õù¡£ÓĞµÄÖ»ÊÇ¶¯ÌıµÄÒôÀÖ£¬ÓÅÃÀµÄ·ç¾°¡£Ê®ËÄ¸ùÓñÊ¯Öù\n"
"×Ó²ÎÌì¶øÁ¢£¬¿´²»µ½¾¡Í·¡£ÓñÖù¼ä°×ÔÆçÔÈÆ£¬Í¸¹ı°×ÔÆ£¬ÒşÔ¼ÄÜ¿´µ½µñÀ¸\n"
"»­¶°£¬Ìıµ½Ë¿ÖñóÏ¸è£¬¹â²ÊÁ÷¶¯£¬ÆæÀö²»¿ÉÃû×´¡£ÕâÀïÃ»ÓĞÖçÒ¹Ö®·Ö£¬Ö»\n"
"ÓĞ¿ÕÆøÖĞ²»Ê±´«À´ÂÆÂÆÇåÏã£¬ÁîÈË¸Ğµ½Æ½¾²°²Äş¡£\n"
);
        set("exits", ([ 
  "north" : __DIR__"spirit2",
]));
        set("no_clean_up", 0);

        set("no_magic", 1);
	setup();
        replace_program(ROOM);
}

