inherit ROOM; 
#include <ansi.h> 
void create()
{
        set("short", "¾«Áé´åÂä");
        set("long",
"[1;32mÑÛÇ°ÊÇ¼¸´¦¼«ÎªÆÕÍ¨µÄ´åÉá£¬¼¸¸ö¾«Áé×åµÄĞ¡º¢×ÓÕıÔÚÎİÍâ\n"
"×·Öğ´òÄÖ£¬¼¸Ö»·Ê·ÊµÄ´ó°×¶ì£¬¿´¼ûÄãÀ´£¬Éì³¤ÁË²±×Ó¸Â¸ÂµÄ½Ğ£¬ËÆºõÆæ\n"
"¹ÖÄã¾ÓÈ»ÕÒµ½ÁËÕâÀï¡£ÕâÀïÃ¿µ±Ï¦ÑôÎ÷ÏÂµÄÊ±ºò£¬ºñºñµÄÃ©²İÕ±³ÉµÄÎİ¶¥\n"
"±ã»á±»µ­µ­µÄ´¶ÑÌÕÖ×¡£¬Õû¸ö´åÀïÃÖÂş×ÅÒ»¹ÉÓÕÈËµÄÃ×·¹µÄÏãÎ¶¡£\n"
);
        set("exits", ([ /* sizeof() == 4 */
   "south" : __DIR__"lake",
   "west" : __DIR__"spirit10",
   "east" : __DIR__"zhanglao",
   ]));

        set("no_magic", 1);
	setup();
        replace_program(ROOM);

}


