你低吟道："含羞倚醉不成歌，纤手掩香    欧阳菲菲(oyff) (Thu Nov  4 17:32)
蕖Ｙ嘶ㄓ持颍荡钜猓扑既牒岵ā
-------------------------------------------------------------------------------
来自 慕容世袭图谱(Board)
> 你的小李探花悄悄告诉你：我要走了
你悄悄告诉你的小李探花：哦.......
你的小李探花悄悄告诉你：我要转站了
你悄悄告诉你的小李探花：去哪里？
你的小李探花悄悄告诉你：河北
你的小李探花悄悄告诉你：咱们.....咱们离婚吧
你的小李探花悄悄告诉你：wiz说必须离婚
你悄悄告诉你的小李探花：去哪里离婚？
你的小李探花悄悄告诉你：不知道是不是
你的小李探花悄悄告诉你：等我问清楚了在说吧
你的小李探花悄悄告诉你：如果 你认为现在离合适,那....也可以
你的小李探花悄悄告诉你：cry oyff
你悄悄告诉你的小李探花：也行
你悄悄告诉你的小李探花：好吧
你的小李探花悄悄告诉你：sigh
你悄悄告诉你的小李探花：去哪里办手续？
你的小李探花悄悄告诉你：在咱们结婚的地方
你悄悄告诉你的小李探花：现在就去吧
> 小李探花满含失望地长叹一声，说道：既然如此，也就罢了！
【闲聊】月下老人(Yuexia laoren)：从今天起，小李探花和欧阳菲菲就不再是夫妻了。
【闲聊】月下老人(Yuexia laoren)：又一桩失败的婚姻，唉 ... ...
你隐约觉得有一样很重要的东西丢失了！
【谣言】某人：武当派第二代弟子「哀莫大于心死」小李探花(Jinsong)决定要自杀了。
谣言】某人：武当派第二代弟子「哀莫大于心死」小李探花(Jinsong)自杀了，以后你再
也见不到这个人了。
小李探花(jinsong)告诉你：你决定要自杀了，真的永别了。
