to lockin                                  知秋(zhiqiu) (Wed Apr 12 06:35)
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
来自 隔世石碑(Board)

 我之所以会来到这个世界,是为了你!我很珍惜这个生命!
在于我,是一段美丽的回忆!曾经很多人想要我这个id,我
都拒绝了,因为我把它当做一个真实的人生,好象
前生注定了,我是为你而生,所以除了你没有人知道我的密码,
北京的我也是如此!然而,好象上天已经注定,今生的我同样又
是一个悲剧,我知道我们姻缘的断裂是
我的错!但是,我非常珍视这段姻缘和曾经的欢笑!虽然我们不
可能在续前缘!但我的内心,希望我在这个世界里存在的每一天
都是为了你,从出生直至死亡!今天,看见自己突然又多出来了玉
佩,是你的好友送的!他曾经也要求过,但是我拒绝了,并
且,为了完成你好友的心愿,给了他别人的id,无论他是暂时借用,
还是其他的目的也好我的人生已经到了尽头,等你们用完我这
个id的时候,请设法通知我,我希望自己能亲手让我自己消失在
这个世界里.可能你会说我做作或是虚假,因为我曾经去探
过白驼山,直到我死在那里,我才知道,zhiqiu对于我是怎样一个
美好的回忆,在那个生命的记录里,只有一次死亡,那次死亡还
是你连线的时候的事,对于我是真真正正一段欢乐的人生,连
这个世界最最普通的仇杀和pk都没有经历过!
我很悲伤,就象那天死亡的时候一样悲伤!
我希望自己结束自己生命的日子快点到来,

以你好朋友练功的速度,我想这个日子马上就会到来的!
最后,再一次表达我的歉意,是我让你在这个世界的人生没法完美!
sorry lockin!!
等我再来的时候,就是和这个世界永别的时刻了!
bye lockin!!
                                                                                       zhiqiu 绝笔
