【“海洋II”襄阳城图】

                                  玄武门外门 
                                      ｜ 
                            北城头-玄武内门-北城头 
                                      ｜ 
                    胡同 新罗坊  兵-北大街-茶 马厩    小弄 
                     ｜      ｜  营   ｜   馆  ｜      ｜ 
              胡同-大街口-北内大街-丁字街口-北内大街-大街口-小弄 
                     ｜                                ｜ 
              书店-西内大街                        东内大街-忠烈祠 
                     ｜                                ｜ 
白  西城头 兵营 客-西内大街 郭府 安抚使衙门 将军府 东内大街-镖 兵营 东城头  青 
虎    ｜     ｜ 店   ｜      ｜       ｜       ｜      ｜   局 ｜     ｜    龙 
门-白虎内门-西大街--西大街-西大街--中央广场--东大街-东大街--东大街-青龙内门-门 
外    ｜      ｜      ｜     ｜       ｜       ｜     ｜      ｜      ｜    外 
门  西城头  大校场  聚义馆  当铺 钱-南大街-学 药铺 民-街-民 木匠铺  东城头  门 
                                 庄   ｜   堂      宅 道 宅  
                               赌场-南大街-觅香楼
                                      ｜ 
                               兵营-南大街-铁匠铺 
                                      ｜ 
                            南城头-朱雀内门-南城头 
                                      ｜ 
                                  朱雀门外门

