// migong lev12  两仪剑 昆仑掌

#include <ansi.h>

inherit NPC;
#include "/quest/menpai/romnpc.c"
#include "/quest/menpai/givegift.c"
string* names = ({
"赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫",
"蒋","沈","韩","杨","朱","秦","尤","许","何","吕","施","张",
"孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻",
"柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎",
"鲁","韦","昌","马","苗","凤","花","方","傻","任","袁","柳",
"邓","鲍","史","唐","费","廉","岑","薛","雷","贺","倪","汤",
"藤","殷","罗","华","郝","邬","安","常","乐","呆","时","付",
"皮","卞","齐","康","伍","余","元","卜","顾","盈","平","黄",
"和","穆","肖","尹","姚","邵","湛","汪","祁","毛","禹","狄",
"米","贝","明","藏","计","伏","成","戴","谈","宋","茅","庞",
"熊","纪","舒","屈","项","祝","董","梁","樊","胡","凌","霍",
"虞","万","支","柯","昝","管","卢","英","仇","候","岳","帅",
"司马","上官","欧阳","夏候","诸葛","闻人","东方","赫连","皇甫",
"尉迟","公羊","澹台","公治","宗政","濮阳","淳于","单于","太叔",
"申屠","公孙","仲孙","辕轩","令狐","钟离","宇文","长孙","幕容",
"司徒","师空","颛孔","端木","巫马","公西","漆雕","乐正","壤驷",
"公良","拓趾","夹谷","宰父","谷梁","楚晋","阎法","汝鄢","涂钦",
"段千","百里","东郭","南郭","呼延","归海","羊舌","微生","梁丘",
"左丘","东门","西门","佰赏","南官",

"缑","亢","况","后","有","琴","商","牟","佘","耳","墨","哈",
"谯","年","爱","阳","佟","第","五","言","福","蒯","钟","宗",
"林","石",
});

string* nm2 = ({
"忠","孝","礼","义","智","勇","仁","匡","宪","令","福","禄","大","小","晓",
"高","可","阿","金","世","克","叔","之","公","夫","时","若","庆","文","武",
"多","才","长","子","永","友","自","人","为","铁","","","","","","","","",
"","","","","","","","","","","","","","",
});

string* nm3 = ({
"霸","白","班","斌","宾","昌","超","诚","川","鼎","定","斗",
"法","飞","风","锋","钢","罡","贯","光","海","虎","华",
"浩","宏","济","坚","健","剑","江","进","杰","俊","康",
"良","麟","民","明","鸣","宁","培","启","强","荣","山",
"泰","涛","挺","伟","熙","祥","雄","旭",
"毅","瑜","羽","宇","岳","舟",
});


void create()
{
  
       int i = random(sizeof(names));
   set_name(names[i]+nm2[random(sizeof(nm2))]+nm3[random(sizeof(nm3))], 
 ({ "sha shou"  }));
 
set("title", RED"武林杀手"NOR);
 
 if (random(2)==0)
   set("gender", "男性" );
 else set("gender", "女性" );
 set("long",
"武功高强，心狠手辣的武林杀手。\n");

set("isteamjob",1);
  set("max_qi",6000+random(3000));
  set("max_jing",6000+random(3000));
  set("max_sen",3000+random(3000));
  set("max_neili",13000+random(3000));
  set("max_mana",3000+random(3000));
  set("eff_neili",13000+random(3000));
  set("neili",3000+random(3000));

        set("age", 14+random(30));

       set("jiali" , 100);

        set("no_get",1);
        set("intellgent",1);
	set("pursuer",1);
        set("combat_exp", 1000000);
            if (random(20)==0)
{
            set_temp("apply/attack", 200);
        set_temp("apply/defense", 200);
           set_temp("apply/armor", 1200);
        set_temp("apply/damage", 1200);
 }       


        setup();
initlvl(200+random(180));
	


}



void init()
{
        remove_call_out("leave");
        call_out("leave",300);
}

void leave()
{
        object ob = this_object();
        if (!ob->is_fighting()) {
                message_vision(this_object()->query("name") + "钻进路边的杂草，不见了。\n" NOR,this_object());
                destruct(this_object());
                }
        else call_out("leave",30);
}
int do_back(object me)
{                       
        me = this_object();
  tell_room(environment(me), me->query("name")+"匆匆忙忙的离开了。\n", ({me}));	
  destruct(me); 
  return 1;
}


void die()
{
int i,pot,exp;
	object killer;
	exp= random(88)+88;
	pot= exp*2/3+1;
	if(objectp(killer = query_temp("last_damage_from")))
{
addnl(killer,"exp",exp);
}
	::die();

return ;
}