//Cracked by Roath
string* hs = ({
	"say 
          华山派原为五岳剑派中势力最强的一派，但因华山两位前
    辈岳肃和蔡子峰对武学的见解不同，华山派至此竟分裂为剑、气
    二宗。二宗各持己见，终于水火不容，同门操戈！高手伤亡怠尽
    ，华山因此式微。华山派男玩家可拜岳不群为师，女玩家则可拜
    宁中则为师。到武功具有一定的水平后，则可拜华山高矮两长老
    为师，或尝试寻找风清扬学习「独孤九剑」。风清扬为当世唯一
    身具「独孤九剑」的人物。独孤九剑，有进无退，招招都是进攻
    ，攻敌之不得不守！威力可想而知。",
});

string* gb = ({
	"say 
          丐帮是武林第一大帮，洪帮主的降龙十八掌以刚猛为主，
    故如果你想学降龙十八掌需有较高的臂力。丐帮的打狗棍更是武
    林一绝，要想学打狗棍只有拜洪帮主。只有丐帮六袋弟子才能拜
    洪帮主，或者是。。。丐帮弟子不能在钱庄里存钱，但可以向别 
    人乞讨(beg)，丐帮弟子可以随地睡觉，还可以查(check)别人功
    夫的深浅。丐帮的密道四通八达，让丐帮弟子行动方便。
    (help beg, help check)", 
});

string* sl = ({
	"say 
          少林武技，名显于世，始于隋末。当时少林寺有十三武僧
    ，应秦王李世民之邀，出山参加了讨平王世充的战役，他们凭着
    超群的技艺，活擒王世充的侄儿王仁则，逼降王世充。胜利后论
    功行赏，除昙宗一人受封大将军外，其余十二人不愿受封，回归
    少林，但均获赐紫罗袈裟，另赐少林寺大量的田地、银两，并赐
    「立僧兵」、「酒肉」等「荣宠」！自此少林寺遂以武功闻名于
    世。 ",
});

string* wd = ({
	"say 
          武当和少林乃武林的泰山北斗。武当张真人自创的“太极”
    是以柔克刚的武林绝学。武当功夫精简。只有一套剑法，一套拳法，
    和一套轻功身法。武当弟子都是道家中人故需精修道德经，以此长
    气。武当弟子在太极神功和道家心法有很高境界之时可与人还魂或
    自救。",
});

string* mz = ({
	"say 
          雪山派是密宗的一支，雪山派有两个主要人物：鸠摩智和
    金轮法王。鸠摩智住持在大雪山大轮寺，为土蕃国国师；金轮法
    王则在蒙古做国师。雪山派的日月轮法威力奇大，另外降伏法是
    雪山派绝学，可以驱赶被降伏的人攻击他人，朝任何方向行走，
    甚至在钱庄取钱给你，好玩极啦！想来我们雪山吗？先去大轮寺
    当喇嘛吧。",
});

string* xx = ({
	"say 
          星宿派的开山祖师丁春秋，师承是逍遥派。逍遥派的武功
是道家一脉，但是丁老仙一生精於炼毒，已不同於道家的炼丹。星宿
派的功夫基本都是丁老仙叛师後自创，主要在毒字上下的功夫。掌上
带毒、暗器上带毒、化功大法吸人内力，江湖上人提起，无不谈虎色
变。",
});

string* bt = ({
	"say 
          武林中人谈起白驼山无不变色。庄主西毒欧阳峰更是武林
    中第一高手。庄主的蛤蟆功独步武林，不但可以伤人，还可与人
    聊毒。白驼的毒功和星宿毒功乃天下两大奇功。庄主最护短，要
    是弟子在外被欺，他会为你出头。",
});

string* th = ({
	"say 
          桃花岛一派乃“东邪”黄药师所创。黄药师素来厌憎世俗
    之见，行事但求心之所适，因此上得了“东邪”雅号。但东邪之
    “邪”并非西毒之“毒”，这一点请桃花岛弟子牢记在心。桃花
    武功中对指法尤有独到造诣，桃花岛的弹指神通与大理一阳指各
    擅胜场。但是桃花岛最为精深的却是奇门遁甲、阴阳五行之术。
    新手可先拜于太湖归云庄陆乘风门下，学些桃花岛基本功夫，再
    图上岛拜黄药师为师。",
});

string* dl = ({
	"say 
          大理国位处中原西南方的云南。于五代后晋天福二年建国
。段氏一派是大理皇室。段氏原本出身中原武林世家，虽贵为皇族，
家传武功却从来不曾荒废，反而愈加勤奋。段氏的一阳指六脉神剑，
皆是江湖上赫赫有名的武功。",
});

string* em = ({
	"say 
          峨嵋派的创派祖师是郭襄女侠。郭女侠在她四十岁那年，
    忽然大彻大悟，出家为尼，后来开创了峨嵋一派。峨嵋派半数是
    尼姑，其余的有男有女。灭绝师太是现任第三代掌门。
          峨嵋弟子崇信大乘佛教，讲究渡人渡己，可通过劝服战斗
    中的玩家或ＮＰＣ罢斗，在实用中增长修为，并取得实战经验。
    峨嵋派不喜与人争斗，弟子门人常常闭门修炼以增长人体潜能。
    峨嵋派内功临济十二庄，讲动静功修练，其排列顺序是：天地之
    心、龙鹤风云、大小幽冥。若能贯通幽冥二庄（１８０级）更可
    到达武林人士梦寐以求的龙虎交会、水火既济的境界、并熟通采
    制灵丹之妙法。此外还可拜周芷若学习九阴白骨爪。",
});

string* qz = ({
	"say 
          全真教乃是天下武林正宗。创教祖师王重阳，又号「中神通」
    ，首次华山论剑，连败东邪、西毒、南帝、北丐，夺得武功天下第一
    的称号。王重阳师弟「老顽童」周伯通，虽生性好玩，却痴心武学，
    悟性高绝，被困桃花岛十五年悟得空明拳和左右互搏两大奇功，第三
    次华山论剑傲居「中顽童」。王重阳座下全真七子，亦是身怀绝技，
    嫉恶如仇的有道之士。",
});

string* bx = ({
	"say 
          华山派原为五岳剑派中势力最强的一派，但因华山两位前
    辈岳肃和蔡子峰对武学的见解不同，华山派至此竟分裂为剑、气
    二宗。二宗各持己见，终于水火不容，同门操戈！高手伤亡怠尽
    ，华山因此式微。华山派男玩家可拜岳不群为师，女玩家则可拜
    宁中则为师。到武功具有一定的水平后，则可拜华山高矮两长老
    为师，或尝试寻找风清扬学习「独孤九剑」。风清扬为当世唯一
    身具「独孤九剑」的人物。独孤九剑，有进无退，招招都是进攻
    ，攻敌之不得不守！威力可想而知。",
});

