mixed bat_message()
{
        return
        ([
                0:([
"attack":({
"$N对准$T的xx拼命就是一剑。",
"$N挥舞着手中的$o0，刺向$T的xx。",
"$N手持$o0，朝$T的xx用力划了过去。",
"$N握着$o0朝$T一阵乱砍。",
        }),
"hit": ({
"结果只是造成一处轻微的刺伤。",
"结果轻轻地刺破了$T的皮肉。", }),
"dodge": ({
"$T急忙一闪身，避开了$N的攻击。",
"$T身子一侧，总算躲过了$N的攻击。", }),
"dodge-on-horse": ({
"$T用力一扯马缰，跨下$o3猛地一跳，闪过了$N的攻击。",
"$T连忙一夹马腹，$o3负痛一个转身，避开了去。",
"$T慌忙弯腰，伏在马背上，躲过了$N的攻击。",
"$T急忙一个侧身闪开，却差点跌下马去。", }),
"miss": ({
"结果离$T的衣角都还相差甚远。",
"结果跟$T的xx偏了几寸。",}),
"wait" : ({
"$N紧紧握着手中的$o0，缓缓移动脚步，伺机出手。",
"$N目不转睛地盯住$T，准备寻找对方的破绽出手。",}),
"wait-on-horse": ({
"$N一手紧紧攥住马缰，一手持着$o0，等待着机会发动攻击。",
"$N双腿一夹，策动跨下$o2，伺机出手。",}),
"parry" : ({
"结果被$T格开了。",
"但是被$T挡开了。", 
"结果被$T手中的$o1架开了去。",
"只听『铛』的一声，被$T掌中的$o1格开了。",}),
                ]),
		1:([
"attack":({
"$N对准$T的xx拼命就是一剑。",
"$N双眉一翘，手中的$o0向$T的xx攻了过去。",
"$N[呵]的大叫一声，挥舞着手中的$o0砍向$T的xx。",
"$N挥舞着手中的$o0，刺向$T的xx。",
"$N手持$o0，朝$T的xx用力划了过去。",
"$N握着$o0朝$T一阵乱砍。",
        }),
"hit": ({
"结果只是造成一处轻微的刺伤。",
"结果轻轻地刺破了$T的皮肉。", }),
"dodge": ({
"$T急忙一闪身，避开了$N的攻击。",
"$T身子一侧，总算躲过了$N的攻击。", }),
"dodge-on-horse": ({
"$T用力一扯马缰，跨下$o3猛地一跳，闪过了$N的攻击。",
"$T连忙一夹马腹，$o3负痛一个转身，避开了去。",
"$T慌忙弯腰，伏在马背上，躲过了$N的攻击。",
"$T急忙一个侧身闪开，却差点跌下马去。", }),
"miss": ({
"结果离$T的衣角都还相差甚远。",
"结果跟$T的xx偏了几寸。",}),
"wait" : ({
"$N紧紧握着手中的$o0，缓缓移动脚步，伺机出手。",
"$N目不转睛地盯住$T，准备寻找对方的破绽出手。",}),
"wait-on-horse": ({
"$N一手紧紧攥住马缰，一手持着$o0，等待着机会发动攻击。",
"$N双腿一夹，策动跨下$o2，伺机出手。",}),
"parry" : ({
"结果被$T格开了。",
"但是被$T挡开了。", 
"结果被$T手中的$o1架开了去。",
"只听『铛』的一声，被$T掌中的$o1格开了。",}),
                ]),
		2:([
"attack":({
"$N对准$T的xx拼命就是一剑。",
"$N紧握着手中的$o0向着一阵乱砍。",
"$N双眉一翘，手中的$o0向$T的xx攻了过去。",
"$N[呵]的大叫一声，挥舞着手中的$o0砍向$T的xx。",
"$N挥舞着手中的$o0，刺向$T的xx。",
"$N手持$o0，朝$T的xx用力划了过去。",
"$N握着$o0朝$T一阵乱砍。",
        }),
"hit": ({
"结果造成一处的明显的刺伤。",
"结果明显的刺破了$T的皮肉。", }),
"dodge": ({
"$T急忙一闪身，避开了$N的攻击。",
"$T身子一侧，总算躲过了$N的攻击。", }),
"dodge-on-horse": ({
"$T用力一扯马缰，跨下$o3猛地一跳，闪过了$N的攻击。",
"$T连忙一夹马腹，$o3负痛一个转身，避开了去。",
"$T慌忙弯腰，伏在马背上，躲过了$N的攻击。",
"$T急忙一个侧身闪开，却差点跌下马去。", }),
"miss": ({
"结果离$T的衣角都还相差甚远。",
"结果跟$T的xx偏了几寸。",}),
"wait" : ({
"$N紧紧握着手中的$o0，缓缓移动脚步，伺机出手。",
"$N目不转睛地盯住$T，准备寻找对方的破绽出手。",}),
"wait-on-horse": ({
"$N一手紧紧攥住马缰，一手持着$o0，等待着机会发动攻击。",
"$N双腿一夹，策动跨下$o2，伺机出手。",}),
"parry" : ({
"结果被$T格开了。",
"但是被$T挡开了。", 
"结果被$T手中的$o1架开了去。",
"只听『铛』的一声，被$T掌中的$o1格开了。",}),
                ]),
		3:([
"attack":({
"$N对准$T的xx拼命就是一剑。",
"$N紧握着手中的$o0向着一阵乱砍。",
"$N双眉一翘，手中的$o0向$T的xx攻了过去。",
"$N[呵]的大叫一声，挥舞着手中的$o0砍向$T的xx。",
"$N挥舞着手中的$o0，刺向$T的xx。",
"$N手持$o0，朝$T的xx用力划了过去。",
"$N伦起$o0猛的向$T的xx砍了下去。",
"$N双手持着$o0，向着$T从下往上的挥出了一剑。",
        }),
"hit": ({
"结果造成一处的严重的刺伤。",
"结果明显地刺破了$T的皮肉。", }),
"dodge": ({
"$T急忙一闪身，避开了$N的攻击。",
"$T身子一侧，总算躲过了$N的攻击。", }),
"dodge-on-horse": ({
"$T用力一扯马缰，跨下$o3猛地一跳，闪过了$N的攻击。",
"$T连忙一夹马腹，$o3负痛一个转身，避开了去。",
"$T慌忙弯腰，伏在马背上，躲过了$N的攻击。",
"$T急忙一个侧身闪开，却差点跌下马去。", }),
"miss": ({
"结果离$T的衣角都还相差甚远。",
"结果跟$T的xx偏了几寸。",}),
"wait" : ({
"$N紧紧握着手中的$o0，缓缓移动脚步，伺机出手。",
"$N目不转睛地盯住$T，准备寻找对方的破绽出手。",}),
"wait-on-horse": ({
"$N一手紧紧攥住马缰，一手持着$o0，等待着机会发动攻击。",
"$N双腿一夹，策动跨下$o2，伺机出手。",}),
"parry" : ({
"结果被$T格开了。",
"但是被$T挡开了。", 
"结果被$T手中的$o1架开了去。",
"只听『铛』的一声，被$T掌中的$o1格开了。",}),
                ]),
		4:([
"attack":({
"$N对准$T的xx拼命就是一剑。",
"$N的$o0就象不是拿在手上似的，忽左忽右，突然又往$T的xx砍下去。",
"$N紧握着手中的$o0向着一阵乱砍。",
"$N双眉一翘，手中的$o0向$T的xx攻了过去。",
"$N[呵]的大叫一声，挥舞着手中的$o0砍向$T的xx。",
"$N挥舞着手中的$o0，刺向$T的xx。",
"$N手持$o0，朝$T的xx用力划了过去。",
"$N伦起$o0猛的向$T的xx砍了下去。",
"$N双手持着$o0，向着$T从下往上的挥出了一剑。",
        }),
"hit": ({
"结果造成一处的严重的刺伤。",
"结果明显地刺破了$T的皮肉。", }),
"dodge": ({
"$T急忙一闪身，避开了$N的攻击。",
"$T身子一侧，总算躲过了$N的攻击。", }),
"dodge-on-horse": ({
"$T用力一扯马缰，跨下$o3猛地一跳，闪过了$N的攻击。",
"$T连忙一夹马腹，$o3负痛一个转身，避开了去。",
"$T慌忙弯腰，伏在马背上，躲过了$N的攻击。",
"$T急忙一个侧身闪开，却差点跌下马去。", }),
"miss": ({
"结果离$T的衣角都还相差甚远。",
"结果跟$T的xx偏了几寸。",}),
"wait" : ({
"$N紧紧握着手中的$o0，缓缓移动脚步，伺机出手。",
"$N目不转睛地盯住$T，准备寻找对方的破绽出手。",}),
"wait-on-horse": ({
"$N一手紧紧攥住马缰，一手持着$o0，等待着机会发动攻击。",
"$N双腿一夹，策动跨下$o2，伺机出手。",}),
"parry" : ({
"结果被$T格开了。",
"但是被$T挡开了。", 
"结果被$T手中的$o1架开了去。",
"只听『铛』的一声，被$T掌中的$o1格开了。",}),
                ]),
        ]);
}
