mapping *targets = ({

//for exp 100k-250k
({
"独脚大盗","殷无禄","慧洁尊者","慧色尊者","亲兵","宋青书","史仲猛",
"史伯威","陈达海","慧空尊者","史季强", "慧虚尊者","慧如尊者","辛然",
"丁同","殷野王","李四","白衣武士","黑衣大盗","殷无福","彭连虎","侯君集",
"亲兵队长","独行大侠","白袍剑侠","慧真尊者", "周颠","殷离","说不得",
"彭莹玉","史孟捷", "张中", "冷谦","侯通海","沙通天","苏普","慧合尊者",
"慧光尊者","钱青健","殷无寿","计老人","苏鲁克","谷虚道长",
"华赫艮","范晔","巴天石","张淡月","吴光胜","郁光标","钟灵",
"摩诃巴思","张泉","玉虚散人","甘宝宝","干光豪","葛光佩","龚光杰",
}),

// for exp 250k-500k
({
"包不同","静迦师太","澄观","计老人","周颠","苏梦清","风波恶","静照师太",
"澄寂","静虚师太","澄和","李文秀","辉月使","澄坚","说不得","静心师太",
"殷梨亭","澄净","莫声谷","静真师太","史孟捷","澄灵","张松溪","彭莹玉",
"静闲师太","澄灭","俞岱岩","澄明","静玄师太","樊一翁","澄尚","妙风使",
"武敦儒","张中","静和师太","宋长老","澄识","史仲猛","静空师太","澄思",
"潇湘子","澄心","冷谦","静道师太","澄信","史叔刚","澄行","静慧师太","澄意",
"全冠清","流云使","赵爵爷","殷野王","李明霞","澄欲","澄知","武修文","贝锦仪",
"澄志","陈长老","侯君集","方碧琳","樊一翁","尹克西","邓百川",
"张浩天","凌震天","洪哮天","黄令天","桑结","苏荃","钟志灵","无根道人","殷锦",
}),

// for exp 500k-750k       
({
"流云使","玄苦大师","风波恶","俞岱岩","潇湘子","史叔刚","裘千仞","玄惭大师",
"殷梨亭","杨逍","玄难大师","张松溪","韦一笑","玄生大师","包不同","玄慈大师",
"俞莲舟","辉月使","史孟捷","宋远桥","殷天正","尹克西","邓百川","谢逊",
"玄悲大师","范遥","慕容复","黛绮丝","李莫愁","莫声谷","殷梨亭","妙风使",
"成昆","卫天望","方天劳","潘天耕","俞莲舟","达尔巴","血刀老祖","洪安通",
}),

// for exp 750k-1.1M
({
"渡难","殷天正","玄悲大师","范遥","渡劫","韦一笑","玄慈大师","杨逍","渡厄",
"谢逊","玄生大师","慕容博","玄难大师","宋远桥","李莫愁","黛绮丝", "玄惭大师",
"玄苦大师","流云使","成昆","流云使","张三丰","黄药师","本因大师","枯荣长老",
"洪七公","张无忌","金轮法王","鸠摩智","血刀老祖","洪安通","裘千仞",
})
});
