#include <ansi.h>

inherit SKILL;
mapping firework=
([                                                "firework":
"
  /\ /\     /\ /\     /\ /\     /\ /\     /\ /\     /\ /\     /\ /\     /\ /\ 
=(=^.^=)= =(`O.O')= >(>o.o<)< =( -.-!)= =(=:.:=)= =(=~.~=)= =(=`.'=)= =(+*o*!)
(``) ('') (``) ('') ("^) (^") (..) (..) (,.) (.,) (,,) (,,) ( ") ( ") (..) (..

开心咪咪  甜美咪咪  生气咪咪  无奈咪咪  伤心咪咪  迷惘咪咪  恶心咪咪  病猫咪咪


  /\ /\     /\ /\     /\ /\     /\ /\     /\ /\     /\ /\     /\ /\     /\ /\ 
=(     )= =(=`^'=)= =(=~*~=)! ={=-.-+}= =(-@.@-)= =(=`b`=)= =(=`T`=)= =(=^U^=)
(  )&(  ) (^`) ('^) [:^] [^:] (,,) (..) (__) (__) (".) (.") (. ) (. ) ("') ('"

冷漠咪咪  高傲咪咪  摩登咪咪  可怜咪咪  学究咪咪  瞌睡咪咪  狡猾咪咪  大笑咪咪

","title":RED"小猫像集"NOR,
]);

mapping firework()
{
  return (firework);
}

