mapping renwu_npc = ([
/*
     name:
         level,
         class,
         shuxing,
         *ids,
         long,
         title,
         *fabao_file,
*/
        "云中子"   : ({
                "2",
                "xian",
                "风",
                ({"yun zhongzi","yun","zi"}),
                "头戴青纱一字巾，脑後两带飘双叶；额前叁点按叁光，
                脑後两圈分日月。道袍翡翠按阴阳，腰下鞭□王母结。
                脚登一对踏云鞋，夜晚闲行星斗怯；上山虎伏地埃尘，
                下海蛟龙行跪接。面如傅粉一般同，似丹砂一点血；
                一心分免帝王忧，好道长两手补完地缺。",
                "终南山玉柱洞",
                ({"",}),
        }),
                
        "燃灯道人" : ({
                "2",
                "xian",
                "火",
                ({"randeng daoren","randeng","daoren",}),
                "怎见得他相貌稀奇，形容古怪！真是仙人班首，佛祖流源。
                 有诗为证：“一天瑞彩光摇曳，五色祥云飞不彻；鹿鸣空内
                 九臬声，紫芝色秀千层叶。中门现出真人相，古怪容颜原
                 自别；神舞虹霓透汉霄，腰悬宝无生灭。灵鹫山下号燃灯，
                 时赴蟠桃添寿域。”",
                 "灵鹫山元觉洞",
                ({"",}),
        }),     
        "赤精子"  : ({
                "2",
                "xian",
                "火",
                ({"chi jingzi","chi","zi"}),
                "变抓髻，淡黄袍，古定剑，八叉鹿，乃是驾雾腾云清隐士。",
                "太华山云霄洞",
                ({"",}),
        }),
        "广成子"  : ({
                "2",
                "xian",
                "水",
                ({"guang chengzi","guang","zi"}),
                "九华巾水合袍，太阿剑梅花鹿，乃是道德清高奇异人。
                有诗为证：“有缘得悟本来真，曾在终南遇圣人；指出长
                生千古秀，生成玉蕊万年新。浑身是日难为道，大地飞
                尘别有春：吾道了然成一贯，不明一字最艰辛。”",
                "九仙山桃源洞",
                ({"",}),
        }),
        "太乙真人" : ({
                "2",
                "xian",
                "雷",
                ({"taiyi zhenren","taiyi","zhenren",}),
                "仙风道骨一修真之人，乃是哪吒师傅。",
                "乾元山金光洞",
                ({"",}),                
        }),
        "灵宝大法师" : ({
                "2",
                "xian",
                "水",
                ({"master lingbao","master","lingbao","bao"}),
                "",
                "崆峒山元阳洞",
                ({"",}),                
        }),
        "道德真君"  : ({
                "2",
                "xian",
                "圣",
                ({"daode zhenjun","daode","zhenjun"}),
                "",
                "青峰山紫阳洞",
                ({"",}),                
        }),
        "惧留孙"   :  ({
                "2",
                "xian",
                "土",
                ({"ju liusun","ju","sun"}),
                "笑口常开笑天下之事，大肚能容容百家之言。
                若问此君为何人？后世入释成弥勒。",
                "夹龙山飞云洞",
                ({"",}),                
        }),

        "文殊广法天尊" :  ({
                "2",
                "xian",
                "风",
                ({"wenshu tianzun","wenshu","tianzun",}),
                "后世释中三士，但见其法身：
                面加蓝靛，赤发红髯；浑身上五彩呈祥，偏体内光拥护。降广
                杵滚滚红焰飞来，金莲边腾腾霞光乱舞；正是：太极阵申皈依
                大法现威光，朵朵祥云笼八面。",
                "五龙山云霄洞",
                ({"",}),                
        }),
        "普贤真人"  : ({
                "2",
                "xian",
                "雷",
                ({"puxian zhenren","puxian","zhenren",}),
                "后世释中三士，但见其法身：
                面如紫霞，巨口獠牙；霎时间云笼红顶上，一会儿瑞彩罩金身。
                璎珞垂珠挂遍体，莲花托足起祥云；三头六臂持利器，手内降
                魔杵一根。正是：有福西方成正果，真人今日已完成。",
                "九宫山白鹤洞",
                ({"",}),                
        }),
        "慈航道人"  : ({
                "2",
                "xian",
                "水",
                ({"cihang daoren","cihang","daoren",}),
                "后世释中三士，但见其法身：
                面如傅粉，三头六臂；二目中火光焰 现金龙，两耳内朵朵金莲生
                瑞彩。足踏金鳌，霭霭祥云千万道；手中托杵，巍巍三宝如意擎
                在手。长毫光灿灿，杨柳在肘後，有瑞气腾腾。正是：普陀妙法甚
                庄严，方显慈航道行。",
                "普陀山落伽洞",
                ({"",}),                
        }),
        "黄龙真人"  : ({
                "2",
                "xian",
                "火",
                ({"huanglong zhenren","zhenren","huanglong",}),
                "",
                "二仙山麻姑洞",
                ({"",}),                
        }),
        "玉鼎真人"  : ({
                "2",
                "xian",
                "圣",
                ({"yuding zhenren","yuding","zhenren",}),
                "仙风临身百事清，三花聚顶万世修，乃是杨戬的师傅。",
                "玉泉山金霞洞",
                ({"",}),                
        }),
        "道行天尊"  : ({
                "2",
                "xian",
                "水",
                ({"daoxing tianzun","daoxing","tianzun"}),
                "",
                "金庭山玉屋洞",
                ({"",}),                
        }),
        "陆压"    : ({
                "2",
                "xian",
                "暗",
                ({"lu ya","lu"}),
                "三山五岳散仙客，红尘仙境界外仙。
                修行各异又何疑，本是殊途又同归。",
                "昆仑山玉虚宫元始门人",
                ({"",}),                
        }),
        "哪吒"  : ({ //乾坤圈 混天绫 风火轮 九龙罩
                "3",
                "xian",
                "火",
                ({"ne zha","nezha",}),
                "",
                "乾元山金光洞太乙门人",
                ({"",}),                
        }),
        "黄天化" : ({ //钻心钉,莫邪宝剑 非铜非铁亦非金 乃是乾元百炼精；变化无形真妙用，要知能杀亦能生
                "3",
                "xian",
                "风",
                ({"huang tianhua","huang"}),
                "",
                "青峰山紫阳洞道德门人",
                ({"",}),
        }),
        "杨任"   : ({  //五火神焰扇  烈焰腾空万丈高，金蛇千道逞英豪：黑烟卷地云三尺，煮梅翻波咫尺消
                "3",
                "xian",
                "火",
                ({"yang ren","yang",}),
                "",
                "青峰山紫阳洞道德门人",
                ({"",}),
        }),
        "杨戬" :  ({
                "3",
                "xian",
                "圣",
                ({"yang jian","yang"}),
                "",
                "玉泉山金霞洞玉鼎门人",
                ({"",}),                
        }),
        "雷震子" : ({
                "3",
                "xian",
                "雷",
                ({"lei zhenzi","lei","zhenzi"}),
                "",
                "终南山玉柱洞云中子门人",
                ({"",}),                
        }),
        "金吒"   :  ({ //吴钩剑
                "3",
                "xian",
                "水",
                ({"jin zha","jin"}),
                "",
                "五龙山云霄洞文殊门人",
                ({"",}),                
        }),
        "木吒"   :  ({ //遁龙桩
                "3",
                "xian",
                "水",
                ({"mu zha","mu"}),
                "",
                "九宫山白鹤洞普贤门人",
                ({"",}),                
        }),
        "土行孙" : ({  //捆仙绳
                "3",
                "xian",
                "土",
                ({"tu xingsun","tu","sun"}),
                "一个矮子，身不过四尺，面如土色",
                "夹龙山飞云洞惧留孙门人",
                ({"",}),                
        }),
        "龙吉公主" : ({
                "2",
                "xian", 
                "圣",
                ({"longjie gongzhu","gongzhu","longjie",}),
                "",
                "九天玄女",
                ({"",}),                
        }),
        "殷洪"   :  ({ //阴阳镜  此镜半边白半边红，把白的一晃，便是死路
                "3",
                "xian",
                "暗",
                ({"yin hong","yin","hong"}),
                "太华山云霄洞赤精子门人",
                ({"",}),
        }),
        "殷郊"   : ({ //番天印，落魂钟
                "3",
                "xian",
                "暗",
                ({"yin jiao","yin","jiao",}),
                "面如蓝靛，发似朱砂，上下獠牙，多生一目。",
                "九仙山桃源洞广成子门人",
                ({"",}),
        }),
        "韦护"  : ({ //降魔杵 此宝拿在手中，轻如灰草，打在人身上，重似泰山
                "3",
                "xian",
                "雷",
                ({"wei hu","wei","hu",}),
                "",
                "金庭山玉屋洞道行门人",
                ({"",}),
        }),
        "李靖"  : ({ //七宝玲珑塔
                "3",
                "xian",
                "火",
                ({"li jing","li"}),
                "",
                "灵鹫山元觉洞燃灯门人",
                ({"",}),
        }),
        "姜子牙" : ({ //杏黄棋*恢复气血  打神鞭
                "2",
                "xian",
                "水",   
                ({"jiang ziya","jiang","ziya"}),
                "",
                "昆仑山玉虚宫元始门人",
                ({"",}),                
        }),
]);
