to all tls dizi                             心虎(lifox) (Sat Sep 25 05:58)
-------------------------------------------------------------------------------
来自 无量功德碑(Board)
　　大家好，我是superfox,也是bigdog。今天我不想谈关于我为什么自杀的事情。我只想说在我心中;埋藏以久的一些话语。;　　我是从去年11月开始玩MUD的。这个MUD是我的第一个MUD，TLS也是我第一个门派，唯一一个门派;也许这对一些人来说只是一个游戏，也许我在这里并不是一个老玩家。但是我用心的去玩它，深深;的爱着TLS，以我的全部热情。;　　但是，最近TLS发生的一些事情却让我很失望，我不知道是怎么了，是我跟不上这个MUD了，还是;这个世界已经改变了。我感到无尽的伤心，失望。;　　当我还是bigdog的时候，我由于一些原因放弃了继续练这个ID到最终。但我没有自杀，我决的留;下这个ID似乎还有用。我尽力的帮助newbei,我尽力的为TLS做着每一件事情。我唯一的希望就是能;看到TLS有一天能发展强大，能聚集无数高手。所以我制作主页，所以我整天的去get tie。但是最;近的事情却让我...;　　pto来到TLS我非常欢迎，毕竟是一个高手，jasonaaa来到TLS我同样很高兴，因为在不久的将来;他们就是TLS的高手。但是对于这次发生的事情我很伤心，PK同门在TLS是从来没有过的事情.不过
pto没有错。jasonaaa是我带进TLS的。也许我说话的口气真的象师傅，但我也想告戒所有后来的TLS
newbei，一切事情在自己能做的情况下最好不要要求前辈帮助。因为为了帮花一分钟，而他们却有;可能放弃一次job.最好是自己多看看主页，请教一些经验，这比帮你拿一本书，或者弄一把sword;有用多了。还有一些新手喜欢试命令或者emout,这个我以前也一样。但是最好告诉你要试
(否则就直接选择kbing吧！他有时后robot不会看的到的！hehe.)一些比较不好的命令最好不要try;例如　slap XXX或者vote chblk XXX，这样的指令是很让人生气的。;　　关于novell和hhh的事情我也想说几句，novell是我的师兄，我们做过三次师兄弟。我还比较了解他;他并不是一个吝啬的人。对于制作主页他提供了很多quest和文章，现在TLS发展的比过去有了这么大;的进步，他功不可没。hhh的要求也并不是一个无理的要求，only look.因为好奇心是每个人都有的;但是，在MUD不但有同门，还有朋友，更有原则和信用。所以，novell拒绝，也是可以原谅的。我认为;最主要的是相互的信任和理解。人难免都有一些不可处理的事情，在现实中如此，MUD中也一样。只要;相互理解，信任。还有什么事情不可解决呢？novell和hhh handshake吧！如果真的希望TLS强大，
TLS的最后心愿了。
                       了寒
