发信人: jinna@phoenix (吉娜), 信区: mud
标  题: MudOS 的历史
Date:      Thu Apr 25 14:24:10 1996

※译者注:本篇原作者实在用太多"we"这个字了,我想简略一点也很难,所以请忍着点看吧!
         另外,此篇文章完全是以第一人称自述的方法写的.
-------------------------------------------------------------------------------
(你们得先知道,我是wayfarer@portals|tmi|overdrive, 所以,这篇文章将会明显地倾向于
 MudOS. 我将尽我所能地保持客观, 并且为你们介绍MudOS之全貌. 此外,我也得提醒你们
 ,这篇文章将会有点冗长.)

   唉, 我已经告诉过自己要避免一直讲自己的事,但我仍犯了这个错误. 我非常地憎恶网
路上的激烈争辩. 然而, 事情已经不可控制了.许多被人们提及的事都很容易看出是假的.
人们不只攻击我们所正在做的(MudOS), 同时也对我们(Jacques,Truilkan和我自己)施以人
身攻击. 这一切种种都非得如此不行吗?? 难道我们就不能保持理性地互相交换意见?
(sheesh不会翻)

   这整个计画最初是由几位共同在TMI服务的朋友, 在一起讨论驱动程式(driver)时而产
生的. 自从 lars(人名)不再对于各种经由E-mail以及谣传所提出的问题提供回答(这并不
是对 lars的批评. 他现在非常忙碌,此外我认为他已经尽可能地去发展这份驱动程式), 所
以,我们坐下来共同讨论那些人们所提及的问题, 试图集合众人自己的构想、方法, 并且将
其付诸实行. 正如你们所知, 当我们刚开始进行没多久(计画是从版本3.0.52-3开始发展的
), 我们就发觉有必要为这份驱动程式进行加强功能及除错的工作. 然而,我们也不想被
lars程式严格的相容性要求所阻碍,所以我们从未宣称:"我们所发展的程式与 lars的程式
相容."

   当计画开始之最初, Whiplash与我是唯一进行程式编写工作的人. 我们所发展出程式之
版本称为 <lars的版本序号>A (美国版本). 起初这一版本之程式执行相当顺利, 但是当我
们做了越多的改良, 我们同时也发展出比 lars更多的内部版本, 而程式的版本也从最初的
版本 A而增加为如:3.0.53.A2.2. 再次的, 我们起初做得非常顺利, 但是当 lars终于释出
3.1 及其之后的两个版本时, 使用这种版本序号系统就变得相当不便.就在此时,Truilkan(
人名)开始加入发展工作.然而,要身处异地的三个人共同来做统一版本的工作, 也使得事情
变得更加复杂及令人困惑.

   就在同时, 我们程式的不相容性也开始被使用者提出讨论. 程式使用者及在TMI服务的
人们总是抱怨, 程式执行的效率不如他们较旧的版本 2.45,或甚至是版本 3.0. 人们似乎
以为执行的速度应该是相同的, 并且不了解为何相容的程式码不能执行.

   此外, Buddha(人名)和我为了改变程式名字的事, 做了一番讨论. 基本上,我们准备要
释出一份泥巴程式库(mudlib)及驱动程式的综合体, 这份程式使你很容易就能做出任何你
想要的东西. 不只是那种纯粹的幻想式mud, 甚至任何其他种类的mud也都可以达成. 许多
的问题不断地从我们的脑袋中蹦出来, 但是更多的困难把我们拉回到现实, 因为如果东拼
西凑地重写一份mudlib, 那么你必得考虑到: 没有人是为了酬劳而做这事的, 同时, 大多
数发展mud的人们并不都是能够聚在一起.(要知道, 如果有人要在Mud上设计一些东西,甚至
只是讨论一些简单的构想, Mud都是一个相当糟糕的媒介.) 无时无刻, 问题不断地发生,但
结果通常都是:回到我们称为"MudOS"---驱动程式及泥巴程式库的综合体. 我们甚至没有谈
到我们所正在发展的驱动程式(driver). 因为那只是个构想而已.(读到这里,请不要质疑:
这并不是我们最初的目标...等等的问题.我也知道,我也从未宣称它是,或者宣称这个构想
有任何的好处! 它只是当时我们发展过程中的所想出来的点子.)

   之后有一些版本诞生了, 我们也终于解决了程式不相容的问题, 并且也订定了一套与
lars分离的版本序号系统. 于是,我们开始了自己的版本序号. 最初,我们把程式取名为"
LPCA ",而最后定名为Buddha所建议的"MudOS enhanced LPmud driver". 起先,我们觉得这
名字相当地有趣, 但是最后反而觉得它听起来相当地酷. 此外,假如决定发展generic
 driver / mudlib计画, 那这个名字刚好相当地合适. 我们自知在真正完成之前, 将会对
程式做许多的改良及除错, 所以程式版本的号码从 0.8开始而舍 1.0不用. 在一些版本释
出后, 我们把程式改名为 MudOS Driver.因为原来的名字令人觉得太长(但在文件档中仍然
称为 MudOS enhanced LPmud driver.),最近我们也为了同样原因而删去"driver"这个字.

   现在,你们可能会说:那时候改名改得太贸然. 我们修改了相当多部分的程式, 而不相容
的问题依然很少. 此外,在一份新程式中是有必要放上一些新玩意儿,以及更多的修正程式
错误. 然而我仍然为那时初始的抉择所困惑. 正如你们所见(如果你们相信我并不是在撒谎
), 并没有任何抉择是为了提升我们个人的名声,亦或贬低 lars的程式. 我们之所以改名是
为了:(ａ)我们的程式与 3.0版的并不相容. (ｂ)我们需要一种方便的版本识别系统.(ｃ)
为了不想自己的程式被人称为"另一种从 LPmud抄袭得来的driver". 我亦可以确定上述原
因也是genesis's driver(译注:另外一种同类型的程式)改名为"cd"的原因. 这些程式可以
重新开始自己的程式版本, 它们也不会和标准的 LPmud driver混为一谈, 并且它们明确地
不会被大众认为又是"另一种抄来的程式". 另外一个优点则是如 Johan(人名)所说:这个名
字较具竞争力,因为它听起来较酷. 我们渴望人们使用这份程式.(最少也因为tmi mudlib具
备一些特征). 然而,我们从未尝试得到个人声名, 或是贬低 lars.以上所述原因就是为什
么我们不再称自己的程式为"MudOS".

   在我告诉你们整个故事之后, 让我来对一些特殊的意见提出回答.

   首先,我注意到有两派正在批评、攻击我们的人:一派就是拥有自己类型程式的人们,另
一派就是需要有稳定程式可用的人.

   送给那些 lars程式的忠实使用者一句话: 他很忙. 他曾说过他只打算释出更新的修改
程式错误的版本. 但他并不打算在新版本中加入任何的新东西. 这就是为什么会有如此多
的不同版本. 所以, 我们何不聚在一起, 集思广益, 写出一个新的版本?  因为这就是当初
MudOS诞生的过程. 最初, 在TMI的人们聚在一起,把自己所写的程式拿出来互相讨论, 然后
把相异处改变, 统一其形式. 我相信这邀请函曾被登在rec.games.mud讨论区上. 大约有十
位网友接受相邀, 并且我们也互相讨论了一会儿. 之后大约过了一、两个月, 我们有了一
个专属于我们的讨论区, 上面刊载了我们所提出的种种构想、建议...等等. 然而,没有人
能够抽空在一起把程式写出来. Whiplash最早接下了这个工作,他也汇集了来自许多人的建
议. 但是,渐渐地大家就开始离开了, 直到全部皆是. Whiplash与我真的是唯一有在直接发
展程式的人. 之后,truilkan和jacques加入了我们. 就这样,其他人开始提供一些程式码的
片段给我们, 并且帮我们测试. 这样的工作效率,出人意料之外地良好(除了有许多人必须
从全国各地,甚至世界各地来帮忙写程式之外....,因为从远方写程式,总是非常令人头痛的
事.) 此外,如何征求得每一个人的同意? 几乎是不可能的. 这也是为什么有一些人在工作
刚开始时,就离开的原因. 他们不同意大多数人的决定, 而且没有兴趣参与."你无法让每一
个人快乐."

   此外,我送给其他程式的使用者一句话:我们从未宣称"我们的泥巴比你们的好". 我们从
未把这件事视为理所当然. 我们只是想尝试做出一个好的 LPmud driver. 是的,它是一个
LPmud. 我们未曾说它不是, 至于为何改名的原因,我已在前面说明过. 你们不断地指责我
们无礼,以及剽窃 lars的心血. 这完全是错误的. 我们是从 lars的程式加以扩充, 而这
也得到 lars的应允. 你们之中有许多人也批评我们的程式是从其他程式中抄来的. 并且
说:我们的程式与其之间并无实质上的差异. 嗯..好的,再次重申,我们从未宣称我们的程式
不是 LPmud driver. 但是, 我们的程式的确与其程式有实质上的差异. 我们所说的可是完
全不同的东西. backend已被完全重新编写过,而变得更有效率,也支援socket efuns.此外,
函数控制也全部更新. 内部储存的大部分皆已完全更新过. 事实上, 几乎驱动程式的每一
部分都已做了某一方面的改变. 这不只是在谈程式中已经加入的新东西. 综观所有的程式
码, 我们与LPmud 驱动程式相异的地方远多于相似处. 在你们做出如此的指控之前, 你们
应该先看看我们的驱动程式与我们的宣称有否相悖. 或许你们已经把自己的驱动程式做了
相同的修改, 那是正确的. 再次地声明, 我们从未宣称:"我们的程式比你们的好". 我们只
是尝试把原本的程式提升为更有效率, 并且将其释出,以供大众使用. 正因如此,我们的立
场是不同的. 因为我们在TMI上工作, 我们乐于帮助那些程式使用者,为他们修正程式中的
错误. 你们也许把自己使用的驱动程式称为 LPmud driver,我则是称其为"MudOS". 然而,
它有着不同的名字, 所以无庸置疑的, 在这两种程式之间,有着相当显著的差异以及不相容
性. 假使你释出程式版本, 而且你愿意帮助使用它的人们, 那么你至少将会在程式的名称
上加些标示, 以与 lars的版本有所区别.

   给使用genesis程式的人们:感谢你们理性地持续这项讨论. 我想你们了解我们的作法.

   正如我所说的, 我对激烈的对辩没有兴趣. 我只是想澄清一些被误导的观念. 我将会更
乐于和理性的人们讨论, 而非那些以无理的藉口试图激怒我们的人.

  PS: 本文件由菠萝面包聘请 anslasax 翻译, 并获授权转载.

