// kugu-blade perform du 

//changed by wuyou 
 
   
#include <ansi.h> 
  
string  *msga = ({ 
        HIC"$N就地一滚，来了一式“地趟刀”，手中神刀砍向$n的双脚。\n"NOR, 
        HIR"$N吐气发力，双爪齐出，直奔$n的面门，拼死要把$n抓得头破血流。\n"NOR, 
        RED"$N双手箕张，拦在$n身前，手中神刀自下而上反劈过来，$n躲闪不及，一条臂膀顿时掉落地上。\n"NOR, 
        HIW"$N一声嘶鸣，侧身单爪硬生生抓向$n的腰部，右手单刀直入胸膛。\n"NOR, 
        HIY"$N跃入半空，左爪自上而下飞速而至，五指直入$n的头颅。\n"NOR, 
        HIY"$N抢前几步，手腕一转，借势送出神刀，随后向$n狠狠的直劈过去，封住了$n的退路。\n"NOR, 
        }); 
        
string  *msgd = ({ 
        HIC"$n见神刀旋转奇疾，连忙一个筋斗跃起，神刀呼的从脚下飞过。\n\n"NOR, 
        HIC"$n不慌不忙，如陀螺般急转了个圈，避了开来。\n\n"NOR, 
        HIC"$n措手不及，危急中弯腰缩头，神刀刚好从头顶飞过。\n\n"NOR, 
        HIC"$n一个侧翻，身体在空中横滚出去，避过了这雷霆一击。\n\n"NOR, 
        HIC"$n大出意料之外，无奈之下只得滚倒在地，险些未能避过。\n\n"NOR, 
        HIC"$n双掌运足内力疾拍，神刀被荡得失了准头，从$n身旁飞了过去。\n\n"NOR, 
});      

