
nosave string *channel_name = ({
"频道", "公共频道","网路讯息","频道精灵","网络监控",
"网络","天神","错误","调试","系统","巫师","巫师","天籁","水陆大会","闲聊","初来乍到",
"谣言","门派","摊贩叫卖","情意绵绵","小道消息","大罗仙","异域佛祖","佛祖","西游记",
"千里传音","听说","亲朋好友","潭际闲聊","商贸频道","谈天说地","心笙乐府","求仙访道",
"斜月三星","慈悲红尘","沙场战神","真武道尊","天河之尊","大力鬼王","地府女主","广寒宫主",
"东海龙神","魔毒神君","魔毒神姬","嗜血精灵","焚心似火",
"广寒仙子","四海神龙","佛法无边","妙道通天","三清仙客","妖气冲天","雪域百鸟","幽冥魅影",
"狐媚众生",
"天神之眼", "系统信息","谣言惑众", "潭际飞梭",  "屠人大赛",
"顺风耳", "千里眼","新手频道", "聊天频道", "新手频道","悄悄话", "伴侣",
"财神爷","帮会消息", "天降奇缘",
"注册","中文", "英文", "管理密码", "信息通告",
});
nosave string *family_name = ({
"方寸山三星洞", "南海普陀山", "大唐将军府", "万寿山五庄观", "花果山盘丝洞", "轩辕古墓",
"蜀山剑派", "天蓬府", "昆仑山月宫", "东海龙宫", "阎罗地府", "大雪山", "陷空山无底洞",
"乱石山碧波潭", "枯松涧火云洞", "神剑山庄", "花果山水帘洞", "三界山天一宫",
"方寸山", "三星洞","灵台","普陀山","将军府","万寿山","五庄观","花果山","盘丝洞","轩辕",
"古墓","蜀山","蜀山派","天蓬","昆仑山","月宫","东海","龙宫","阎罗","地府","雪山",
"万兽谷","陷空山","无底洞","乱石山","碧波潭","枯松涧","火云洞","水帘洞","三界山",
"天一宫","流沙河",
});
nosave string *bad_word = ({
// 系统保留字
  "西游记", "百姓", "某些人", "管理",
  "某人", "巫师", "天神", "玩家",
  "尸体", "我", "你", "他", "她", "它", "大家", "自己", "自已",
  "中国", "中华", "皇帝", "鬼魂", "头颅", "杀人", "蒙面",
// 名人的名字
  "毛泽东", "周恩来", "朱德", "刘少奇", "彭德怀", "林彪", "江青", "刘伯承", "贺龙",
  "聂荣臻", "叶剑英", "陈毅", "罗荣桓", "粟裕",
  "邓小平", "陈云",   "胡耀邦", "江泽民", "朱容基", "钱其琛", "李瑞环",
  "胡锦涛", "温家宝",
  "孙中山", "孙文", "蒋介石","希特勒","东条英机",
  "李大钊", "陈独秀", "列宁", "斯大林", "马克思", "恩格斯",
//翱翔天际
  "巫师","翱翔天际","精灵",

// 偏旁部首
  "丨", "丿", "丶", "匚", "刂", "冂", "亻", "勹", "亠", "冫", "冖",
  "讠", "卩", "阝", "廴", "凵", "厶", "艹", "廾", "扌", "囗", "彳",
  "彡", "犭", "饣", "夂", "忄", "丬", "氵", "宀", "辶", "彐", "屮",
  "纟", "巛", "灬", "礻", "肀", "疒", "衤",
// 脏话以及敏感字眼
  "屁", "鸡巴", "性", "淫", "嫖", "阴", "操", "奸", "妓", "睾丸",
  "赤佬", "瘪三", "傻逼", "蠢蛋", "阉割", "阉人", "裸体", "婊子",
  "统一", "法轮", "吃人", "革命", "反动", "台独", "黑客", "骇客",
  "废物", "低能", "垃圾", "变态", "混蛋", "浑蛋", "白痴", "弱智",
  "国民", "共产", "社会", "自由", "民主", "主义", "人民", "中央",
  "打倒", "反对", "反动", "攻击", "占领", "消灭", "攻陷", "抢劫",
  "称霸", "广告", "色情", "侮辱", "辱骂", "骂人", "大便",
// 通用名字 及 通用称谓
  "将军", "副将", "参将", "牙将", "武将", "官兵", "兵丁", "士兵",
  "捕头", "巡捕", "快捕", "铁捕", "捕快", "衙役", "差役", "官差",
  "太监", "公公", "宦官", "宫女", "侍女", "随从", "亲随", "伙计",
  "土匪", "强盗", "大盗", "劫匪", "恶霸", "恶棍", "叛徒", "流氓",
  "艺人", "小二", "跑堂", "穷汉", "乞丐", "杂役", "工头", "流浪汉",
  "脚夫", "车夫", "挑夫", "马夫", "轿夫", "渔夫", "民夫", "牧人",
  "庄家", "管家", "店家", "船家", "梢公", "老板", "掌柜", "商人",
  "铁匠", "匠人", "工匠", "裁缝", "农夫", "医生", "药师", "采药人",
  "豪客", "侠客", "刀客", "剑客", "游客", "赌客", "刺客", "旅客",
  "拳师", "武师", "镖师", "保镖", "打手", "护院", "教头", "趟子手",
  "忍者", "武士",
  "老爷", "夫人", "少爷", "公子", "相公", "书生", "小姐", "太太",
  "丫鬟", "家丁", "仆人", "下人", "小童", "哑仆", "书僮", "使女",
  "爷", "奶", "父", "母", "叔", "舅", "爸", "妈", "爹", "娘",
  "先生", "老婆", "丈夫",       "老公", "妻子", "姘头",
  "女人", "女子", "女的", "女孩", "妇人", "姑娘", "丫头", "小孩",
  "男人", "男子", "男的", "男孩", "孩子", "小伙", "小子", "孩童",
  "老翁", "老头", "老者", "老人", "青年", "中年", "壮年", "后生",
  "和尚", "尼姑", "喇嘛", "道士", "沙弥", "上人", "僧人", "行者",
  "禅师", "师太", "尊者", "罗汉", "大师", "比丘", "道长", "道人",
  "师傅", "师父", "师兄", "师弟", "师姐", "师妹", "师叔", "弟子",
  "教主", "寨主", "帮主", "舵主", "洞主", "堂主", "门主", "岛主",
  "坛主", "掌门", "方丈", "主持", "护法", "龙头", "长老", "大哥",
  "帮众", "教众", "教徒",
  "鬼魂","帝后","天后","巫女",
  "家兵","家将","亲信",

  "当铺","药铺","钱庄","客栈","客店","留言","小便",
});
nosave string *novel_name = ({
// 次敏感字眼
   "正义", "邪恶", "官府", "武林", "绿林好汉", "好汉", "英雄", "伟人",
   "黑社会",

// 次系统保留字
  "孔子", "孟子", "庄子", "黄帝", "嬴政", "秦始皇", "刘邦", "项羽",
  "曹操", "刘备", "孙权", "孔明", "周瑜", "关云长", "夏侯敦", "陆逊",
  "吕布", "赵云", "典韦", "关羽", "马超", "张飞", "吕蒙", "邓艾",
  "李白", "杜甫", "苏轼", "苏辙", "苏洵", "韩愈", "柳宗元", "欧阳修",
  "陆游", "王维", "王勃", "柳永", "司马相如",
// Mud 地名
  "长安","长安城","开封","开封城","江州","江州城","长安城南","长安城东","长安城西",
  "黄金宫","九重天","冥界","十绝阵","天龙八部","八部天龙",
  "取经","大闹天宫","红楼","红楼梦","泾水桥",
  "白骨","白骨洞","豹头","豹头山","宝象","宝象国","比丘","比丘国",
  "清华","清华庄","清华洞","车迟","车迟国","三清观","毒敌","毒敌山","琵琶洞",
  "凤仙郡","火焰山","翠云山","黑风山","黄风岭","积雷山","摩云洞","金兜山","金兜洞",
  "荆棘岭","木仙庵","金平府","青龙山","玄英洞","祭赛国","碧波潭","枯松涧","火云洞",
  "灵山","雷音寺","毛颖山","三连穴","女儿国","解阳山","盘丝岭","盘丝洞","黄花观",
  "紫云山","平顶山","莲花洞","压龙山","压龙洞","麒麟山","獬豸洞","钦法","钦法国",
  "青龙山","玄英洞","双叉岭","天竺","天竺国","通天河","陈家庄","乌鸡","乌鸡国",
  "宝林寺","小西天","隐雾山","连环洞","玉华","玉华县","虎口洞","竹节山","九曲盘桓洞",
  "云栈","云栈洞","朱紫","朱紫国",

//武学，道行境界
  "初学乍练","初窥门径","粗通皮毛","略知一二",
  "半生不熟","马马虎虎","已有小成","渐入佳境",
  "驾轻就熟","了然于胸","出类拔萃","心领神会",
  "神乎其技","出神入化","豁然贯通","登峰造极",
  "举世无双","一代宗师","震古铄今","深不可测",
  "纵横天界","天下无双","笑傲西游","群雄之尊",
  "佛哭帝怒","绝天灭地","擎日挽月","古今一人",
  "新入道途","闻道则喜","初领妙道","略通道行",
  "渐入佳境","元神初具","道心稳固","一日千里",
  "道高德隆","脱胎换骨","霞举飞升","道满根归",
  "不堕轮回","已证大道","反璞归真","天人合一",
  "仙福永享","寿与天齐","佛仙齐拜","古今同生",
  "初具法力","略晓变化","降龙伏虎","腾云驾雾",
  "神出鬼没","预知祸福","妙领天机","呼风唤雨",
  "负海担山","移星换斗","包罗万象","随心所欲",
  "变换莫测","法力无边","无法无天","逆转时光",
// 次通用字 及 已杜撰NPC名字
  "名字待定", "普通百姓", "新手", "帮助文件", "白无常", "黑无常",
  "月下老人", "赵爵爷", "京城客", "进香客", "中神通",
  "钱缝", "钱眼开", "龙卷风", "刘好弈", "王坏水", "茶博士", "说书人",
  "托钵僧", "李半仙", "王公公", "空空儿", "徐霞客", "徐洪祖", "钱善人",
// 动物
  "麻雀", "鹦鹉", "大雁", "斑头雁", "支麻鸭", "天铃鸟",
  "毒蛇", "巨蟒", "毒虫",       "怪蟒", "菜花蛇", "眼镜蛇", "蝮蛇", "蜘蛛",
  "蜈蚣", "蝎子", "苍蝇", "蟑螂", "蚂蝗", "蚂蚱", "蚱蜢", "蛐蛐",
  "蟋蟀", "青蛙", "蛤蟆", "泥鳅", "壁虎", "刺猬", "蚊子",
  "老虎", "狮子", "大象", "豹子", "狐狸", "灰狼", "头狼", "大灰狼",
  "野鸡", "野猪", "野兔", "野鸭", "野马", "野狗", "猴子", "老鼠",
  "黄牛", "狼狗", "驴子", "水牛", "白鹅", "鸭子", "黄狗",
  "兔子", "公鸡",
  "乌龟", "金鱼", "鲤鱼", "鲫鱼", "鲸鱼", "海马", "螃蟹", "王八",
  "甲鱼", "青鱼",
// NPC人物
// 门派master
  "菩提祖师","菩提","云阳","云阳真人","广羲子","广筠子","云清","云静","云霄",
  "观音菩萨","观音","惠岸行者","惠岸","黑熊怪","净瓶使者","掌禅僧","剃度僧","掌厨僧",
  "白发老人","秦琼","尉迟恭","罗成","袁天罡","程咬金","薛仁贵","秦平","秦安","秦富",
  "罗春",
  "镇元大仙","镇元","福星","禄星","寿星","张国老","吕洞宾","汉钟离","蓝采和","韩湘子",
  "何仙姑","曹国舅","铁拐李","清风","明月",
  "紫霞仙子","紫霞","青霞仙子","青霞","春十三娘","白晶晶","香香公主",
  "比干","妲己","胡秋娘","女娲","女娲娘娘","香香","纣王","师师",
  "静虚老祖","静虚","蜀山剑圣","剑圣","酒剑仙","李逍遥","林月如","轻云子","凌云子",
  "追云子","松儿","鹤儿","明儿","赵灵儿",
  "猪悟能","猪八戒","八戒","猪小戒","于老头","春春",
  "西王母","王母","王母娘娘","嫦娥","痴梦仙姑","痴梦","织女","牛郎","月奴","麻姑",
  "吴刚","月下老人","轿夫头","轿夫",
  "东海龙王","龙王","敖广","龙宫太子","龙少爷","龙女","紫云公主","龟八斗","鲸无敌",
  "龙表弟","蒲牢","狴犴","睚眦","霸下","螭吻","饕餮","蚣蝮","金猊","椒图",
  "地藏王菩萨","秦广王","初江王","宋帝王","平等王","仵官王","阎罗王","泰山王",
  "都市王","卞城王","轮转王","王方平","阴长生","黑无常","白无常",
  "孔雀明王","大鹏明王","青狮老魔","白象尊者","孔雀公主","秃鹰尊者","鹦鹉将军",
  "乌鸦先生","黄雀侍儿","小钻风","浣花",
  "玉鼠精","地涌夫人","田鼠精","碧鼠精","蝙蝠精","鼹鼠精",
  "九头驸马","万圣龙王",
  "黄飞虎","红孩儿","圣婴大王","牛魔王","急如火",
  "谢晓峰","谢掌柜","铁真真","燕十三","纪芙",
  "六耳弥猴","马元帅","流元帅","崩将军","芭将军",
  "纯阳祖师","纯阳","朝阳先师","朝阳","幻忘子","玄如晦","虬须客","大天妖",
  "妖帅","大天魔","魔帅","鬼冥","藏尸地鬼王","鬼幽","项羽",

//重要np
  "李靖","店小二","崔珏","雅典娜","如来佛","如来","孙悟空","悟空","黄泉","钟馗",
  "霸枪",
// 增加的名字
"浪荡","太上老君","老君","不可不戒",

//一些重要的物?
  "灵珠","圣灵珠","雷灵珠","风灵珠","水灵珠","土灵珠","火灵珠","还阳丹","云丹",
  "金创药","混元丹","人参果","人参","猕猴桃","猕猴","仙丹","碧藕","火枣","交梨",
  "冷香丸","七叶琼草","神力丸","三才封髓丹","何首乌",
  "金刚经","千字文","三字经","论语","太白自选集","女儿经","伏魔山心经","道德经",
  "玄天宝鉴","猕猴手记","格斗秘诀","少林拆招秘诀","拳经","医术","无字经","医书",
});
nosave string *msg_d = ({
"他妈的","你妈的","傻Ｂ","我操","操你","和你妈睡","有活的没有","没死会？","操",
"操！","ＦＵＣＫ","婊子","有没有活的","想死","ＳＨＩＴ","你奶奶的","和你妈做爱",
"她妈的","你爷爷的","有没有喘气的","ＣＡＯ","放你妈的屁","ＴＭＤ","ＴＭＭＤ",
"操你妈","日死你","干你娘","没死回？","操你姐","狗屁ＷＩＺ","狗ＷＩＺ","破ＷＩＺ",
"死ＷＩＺ","日死你","ＮＮＤ","ＫＡＯ","放屁","干你妈","干你的","ＴＮＮＤ","ＳＢ",
"草","ＳＨＡＢＩ","蛋子","你妈","你爹","牛比","放屁","吃屎","你大爷","操你妈","打炮",
"６ＭＡＮＧ","大便","小便","避孕套","手淫","老处女","小处女","娼妇","日你妈","贱Ｂ",
"杂种",});
nosave string *limit_id=({
//dirty word
"fuck","shit","sex","father","mother","cao","gan","niao","diao","nnd","dyd",
"kao","naizi","nai","laobi","chedan","qusi","qiangjian",
//system used
"vip","shxy","xyj","heidian","wiz","wizard","npc","mud",
//attribu
"str","int","con","cor","spi","dex","per","cps","kar",
//cmds-adm
"adcp", "adrm","changename","dump","dumpprog","dumpsocket","profile",
"purge","purgehouse","restore","setclub","shutdown","socket","updateall",
"updatedir","updatei","vi","wakeup","wizrenwu","xadpass","xboard","xgrep",
"xpass","xsearch","xupdate",
//cmds-arch
"ban","board","call","callouts","chagold","chasm","checkall","checkhp",
"checkip","cleanup","cleartemp","clone","closeshop","config","cp","cshshop",
"doc","edit","endlog","eval","examine","fenbu","findusr","giveall","ip",
"kcname","localcmds","log","meiyaos","mkdir","mudinfo","mv","noboard",
"openshop","promote","qdel","qinfo","reboot","restore","rm","rmdir","setowner",
"setskill","shutdown","toto","where","wizlock",
//cmds-wiz
"allow","block","cat","cd","chblk","chinese","ckmoney","cmd","copyskill",
"cost","cpu","data","desc","dest","dns","dxsearch","ff","fstring","ftell",
"full","gly","home","ilist","info","jbless","jinggao","kickout","ls","maphere",
"mbless","mcheck","more","nuke","punish","pwd","qiujin","qload","reclaim",
"register","rehash","sameip","scoree","search","searchexp","smash","snoop",
"summon","tail","tianfu","tmp","toguest","topadd","ulist","unchblk","update",
"uu","version","which","wizwho","yss",
//cmds-imm
"edemote","goto","halt","mem","mudos","shout","status","whoami","whohave",
"whois","whoride","xuanbu",
//cmds-std
"abandon","fangqi","accept","apprentice","ask","baofa","bian","buy","cast",
"chanting","check","close","combine","cut","dismount","drop","eat","enable",
"enchant","enforce","exercise","dazuo","exert","expell","fight","find","fly",
"follow","freeze","get","give","go","invite","ji","job","kill","learn","lingwu",
"listshop","localtime","look","marry","meditate","mingsi","mount","observe",
"open","perform","practice","lian","propose","protect","put","recruit","remove",
"reply","score","scribe","sleep","skill","song","special","stab","steal",
"study","xue","surrender","touxiang","team","throw","unwield","wear","wield",
"yanlian",
//cmds-usr
"alias","backup","banghui","bjtime","brothers","cls","cmlist","color","describe",
"digmoney","dipan","dntg","femote","finger","help","hp","id","inventory","quest",
"quests","keep","keepto","lock","map","maps","mieyao","mudage","mudlist","news",
"nick","passwd","port","quit","qujing","recall","refuse","right","save","scheme",
"semote","set","skills","sos","suicide","swear","time","title","top","topten",
"tune","unset","uptime","value","vote","wannian","wheremoney","who","wimpy",
"wimpydir","wizlist","xyjtime",
//daily word
"kiss","none","anyway","wiz","test", "where",
//emote word
"haha","haaa",
//family name
"lingtai", "fangcun", "longgong","wuzhuang","xueshan","moon","jjf",
"huoyun","tianpeng","putuo","bibotan","wzg","hell","wudidong","jiangjun",
"jiangjunfu","shushan","sanjie","pansidong","psd","xuanyuan","xy","shenjian",
//xyj place name
"changan",
"wuji","baoxiang","jisai",
//famous npc name
"wukong","sunwukong","baqiang","laoren","laojun","fuckyou","fuckall","lijing",
"xuerengui",
//misc
"zhen","pillow","→","city","ghost",
});
int valid_name(string name)
{
  int len = strlen(name);
  int i, j;
  if (member_array(name, channel_name) != -1)
  {
    write("不能使用天气或频道以及系统特有名词作为名字。\n");
    return 0;
  }

  if (member_array(name, family_name) != -1)
  {
    write("不能使用门派以及系统特有名词作为名字。\n");
    return 0;
  }

  if (member_array(name, novel_name) != -1)
  {
    write("不能使用MUD已经采用了并且是常用的特有符号作为名字。\n");
    return 0;
  }

  if( member_array(name, msg_d)!=-1 )
  {
    write("对不起，这样的中文字符被系统禁止注册。\n");
    return 0;
  }

  //for (i = 0; i < len; i += 2)
  //  for (j = i + 1; j < len; j += 2)
  for (i = 0; i < len; i ++)
    for (j = i + 1; j < len; j ++)

        if (member_array(name[i..j], bad_word) != -1)
        return 0;
  return 1;
}

/*
int valid_id(string id)
{
  int i;
  for(i=0;i<sizeof(limit_id);i++)
  {
    if(strsrch(id,limit_id[i])!=-1)
    {
      write("\n很抱歉，类似含有 "HIR BLINK+limit_id[i]
        +NOR" 这样的英文字符被系统禁止注册！\n\n"NOR);
      return 0;
    }

  }

  return 1;
}

*/
int valid_id(string id)
{
    if(member_array(id,limit_id)!=-1)
    {
      write("\n很抱歉，类似 "HIR BLINK+id
        +NOR" 这样的英文字符被系统禁止注册！\n\n"NOR);
      return 0;
    }

  return 1;
}

