//点穴效果
//兵器：
mapping *weapon_type = ({
([     "weapon":"brush",                        //笔
        "eff":20,
        "msg": "$N不等$n回过神来，手中$w突然向$n的$x疾点！\n",
]),
([     "weapon":"throwing",                     //飞镖
       "eff":18,
       "msg" : "$N趁$n不备，$w发射向$n的$x大穴！\n",
]),
([     "weapon":"stick",                        //棒
       "eff":17,
       "msg": "$N忽然招数一变，$w向$n的$x点去！\n",
]),
([     "weapon":"sword",                        //剑
       "eff":16,
       "msg" : "$N将$w越舞越轻灵，竟招招不离$n的$x！\n",
]),
([     "weapon":"hook",                         //钩
       "eff":15,
       "msg" : "$N手中$w虎虎生风，恶狠狠向$n的$x招呼过去！\n",
]), 
([     "weapon":"whip",                         //鞭
       "eff":13,
       "msg" : "$N将$w一卷，绕过$n的兵器，袭向了$n的$x！\n",
]),
([     "weapon":"club",                         //棍
       "eff":12,
       "msg" : "$N忽然回身，将$w从斜下里，向$n的$x戳去！\n",
]),
([     "weapon":"dagger",                       //匕首
       "eff":10,
       "msg" : "$N将$w越舞越轻灵，竟招招不离$n的$x附近！\n",
]),
([     "weapon":"spear",                        //矛
       "eff":8,
       "msg" : "$N突然将手中$w一抖，泛出朵朵枪花,疾攻而至，$n的$x顿觉窒滞，面上显出紧张神色！\n",
]),
([     "weapon":"blade",                        //刀
       "eff":7,
       "msg" : "$N用$w轻轻一挑，$n似乎被慑住了魂魄，眼睁睁的看着刀尖挑向$x，连动也不能动!\n", 
]),
([     "weapon":"staff",                        //杖
       "eff":5,
       "msg" : "$N双臂一抖，$w尖一挺，夹带一股劲气而出，直指$n的$x,$n身形一个踉跄已被劲气所伤！ \n",
]),
([     "weapon":"axe",                          //斧
       "eff":3,
       "msg" : "$N手握$w把末端，直劈出去，近身处却又$w头后转，$w把急点$n的$x,$n大叫一声，身体向后仰去！ \n",
]),
([     "weapon":"hammer",                       //锤
       "eff":2,
       "msg" : "$N拿捏力道，手中$w急速扫向$n的$x,$n身形一晃，显然$x已被罡气扫中！ \n",
]),
});

//空手：
mapping *unarmed_type = ({
([     "weapon":"finger",                       //指-弹，点
       "eff":20,
       "msg" : "$N身形闪动，双手虚握，运气于指尖,一股雄厚的指力，点向$n的$x$n气血一滞，已被重重的点中！\n",

]),
([     "weapon":"hand",                         //手-拂
       "eff":18,
       "msg" : "$N慢慢推动真力到手上，飘忽不定的拂向$n的$x,惊诧间，$n脸色一下变得惨白，昏昏沉沉接连退了好几步！\n",
]),
([     "weapon":"claw",                         //爪-抓
       "eff":15,
       "msg": "$N吐气扬声，双爪奋力向$n的$x抓去，$n的$x一被抓中，鲜血溅得满地！\n",
]),
([     "weapon":"strike",                       //掌-拍，按
       "eff":10,
       "msg" : "$N聚全身之力于双掌之上，以迅雷不及掩耳之势攻向$n的$x,$n一声惨叫，整个身体象断了线的风筝一样飞了出去！ \n",
]),
([     "weapon":"cuff",                         //拳-打，击
       "eff":8,
       "msg" : "$N骤然化作漫天花雨，$N的拳上已经充满无穷的气力，打向$n的$x!\n",  
]), 
([     "weapon":"leg",                          //腿-踢
       "eff":5,
       "msg" : "$N一脚向$n的踢去,$n突然动作慢了下来，接着$n好象风中的树叶般，漂摆起来！\n",
]),
([     "weapon":"unarmed",                      //基本拳脚-撞，打
       "eff":2,
       "msg" : "$N挥拳打向$n的$x！\n",
]),
});

