//by dwolf
//97.11.16       

#include <ansi.h>
inherit ITEM;
void create()
{

        set_name(YEL"纵横天下总图一"NOR, ({ "map","map1"}));
        set_weight(300);
        set("unit", "张");
        set("long", "        纵横天下总图一 \n"
"                                                  长白山              \n"
"                                                    /                 \n"
"                                     草原---------- 奉天------鸭绿江  \n"
"                                                   /                  \n"
"                                                  /                   \n"
"                                              山海关                  \n"
"                                        北京---/                      \n"
"                                        /  \\                          \n"
"                                     保定   \\                         \n"
"                                     /      |                         \n"
"                                     +------+                         \n"
"                                    /       ==~~                      \n"
"                                    |     ~~~济南 -+-------蓬莱       \n"
"       ==~~                         |         /  泰山                 \n"
"     ~~兰州                       ~~ ==~~     |                       \n"
"         \\---+-长安--+-潼关--洛阳---开封      |                       \n"
"             |       华山     |      |   \\---徐州                      \n"
"             |                |      |        |                       \n"
"       剑门关+------------\\  /       |        |                       \n"
"       ^^                 襄阳       |         \\                      \n"
"			     \\___    |       ~~==~~                      \n"
"			          汉口        金陵                      \n"
"			         ~~==~~                               \n" 
);
        set("value", 10000);
        set("material", "paper");  
}
